{
    "version": "https://jsonfeed.org/version/1",
    "title": "Catatan celoteh @FachrulCH",
    "description": "",
    "home_page_url": "https://fachrul.id",
    "feed_url": "https://fachrul.id/feed.json",
    "user_comment": "",
    "icon": "https://fachrul.id/media/website/profile_fachrul_paperprint_300.jpg",
    "author": {
        "name": "Fachrul Choliluddin"
    },
    "items": [
        {
            "id": "https://fachrul.id/oh-ternyata-saya-condong-ke-auditory-learning/",
            "url": "https://fachrul.id/oh-ternyata-saya-condong-ke-auditory-learning/",
            "title": "Oh Ternyata Saya Condong ke Auditory Learning",
            "summary": "Foto olehÂ Armin RimoldiÂ dariÂ PexelsAwal mulanya saya percaya saya adalah seorang tipe visual learning, dimana saya akan cepat paham ketika memproses informasi secara visual melalui gambar, charts, diagram, peta, bahkan saya rutin menuangkan ide dalam bentuk mind mapping, namun akhir-akhir ini saya menyadari adanya proses pergeseran tipe&hellip;",
            "content_html": "<figure class=\"post__image post__image--left\" ><img src=\"https://fachrul.id/media/posts/50/pexels-armin-rimoldi-5553630.jpg\" alt=\"Foto oleh Armin Rimoldi dari Pexels\" width=\"300\">\n<figcaption >Foto olehÂ <strong><a href=\"https://www.pexels.com/id-id/@armin-rimoldi?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Armin Rimoldi</a></strong>Â dariÂ <strong><a href=\"https://www.pexels.com/id-id/foto/pria-pena-meja-musik-5553630/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></strong></figcaption>\n</figure>\nAwal mulanya saya percaya saya adalah seorang tipe <em>visual learning</em>, dimana saya akan cepat paham ketika memproses informasi secara visual melalui gambar, charts, diagram, peta, bahkan saya rutin menuangkan ide dalam bentuk <em>mind mapping</em>, namun akhir-akhir ini saya menyadari adanya proses pergeseran tipe membelajar menjadi <em>auditory learning</em>, dimana saya lebih senang dan cepat pahamÂ ketikaÂ mencerna informasi melalui media audio/suara.<br><hr>\n<p><br>Pembelajar auditory memiliki kemampuan untukÂ menyimak informasi dengan mudahÂ dalam bentuk suara, kita mampu memahami emosi melalui intonasi, serta senang dengan hiruk-pikuk suara.Â Kurang lebihÂ adaÂ beberapa tanda dari <em>audio learning</em>Â menurut saya:</p>\n<ul>\n<li>Mudah ingat pecakapan yang terjadi tempo dulu, masih ingat bit/jokes standup yang sudah lama ditonton</li>\n<li>Lebih paham dengan membaca tulisan dengan lantang</li>\n<li>Ketika di kelas, walaupun jarang mencatat tetapi saat ulangan masih bisa menjawab karena menyimak apa yang disampaikan guru</li>\n</ul>\n<p>Saya baru paham akhir-akhir ini bahwa saya adalah seorang <em>auditory learner</em>, setelah merenungi ciri-ciri <em>auditory learner</em>Â lebih cocok dengan saya seperti point-point di atas, walaupun saya tidak setuju dengan pengkotakan label ini (selain auditory learning, ada pula visual learning, dan kinetik learning) karena setiap orang bisa jadi memiliki irisan antar tipe (hybrid).</p>\n<p>Saya cenderung lebih paham ketika belajar diÂ suasana ramai, kalaupun di rumah, saya akan menyalakan TV sebagai background/white noise sembari menemani saya belajar karena ini akan membantu saya menjaga fokus dengan baik ketimbang sunyi senyap.</p>\n<p>Manfaat lain dari mengetahui tipe mana yang paling cocok dengan kita adalah potensi untuk memaksimalkan gaya belajar kita, apakah audio, visual ataupun kenetik, Mungkin saya bisa berbagi tips yang saya gunakan selama ini untuk belajar, diantaranya:</p>\n<h3 id=\"mcetoc_1fo6opmt60\">Bacalah dengan lantang</h3>\n<p>Informasi yang ingin dipahami, karena kita perlu melibatkan indra pendengaran agar bisa lebih meresapi maknanya.</p>\n<p>Saat menghapal nomer telepon ataupun OTP code, saya akan membaca dengan lantang dan mengingat ucapan saya sendiri ahaha.</p>\n<h3 id=\"mcetoc_1fo6or8ie1\">White noise</h3>\n<p>Saya termasuk orang yang sulit fokus ketika bekerja/belajar jika sambil mendengarkan lagu atau percakapan/podcast, saya lebih memilih memutar suara alam, bunyi jam, ataupun menyalakan tivi dengan volume rendah, tapi tak pula menyukai suasana yang sunyi senyap macam menggunakan headset active noise cancelling. Saya akan membuka spotify dan mencari \"natural sound\", suara yang saya suka adalah suara hujan dan angin.</p>\n<h3 id=\"mcetoc_1fo6p1djd2\">Bercakap</h3>\n<p>Yup, sering kali saya menemukan \"Aha! momen\", ide brilian ketika sedang ngobrol ataupun saat mengajari orang lain, entah kenapa saat mengemukakan mendapat itulah saya bisa mendapatkan ide-ide segar dalam fikiran, saya menduga penyebabnya karena aktivitas berbicara inilah, besar kemungkinan karena dengan berbicara kita pun melibatkan sensor pendengaran kita.</p>\n<hr>\n<h2 id=\"mcetoc_1fo6p3iod4\">Belajar melalui suara</h2>\n<p>Sejak 2017 saya aktif mendengarkan podcast sembari berkendara menuju kantor dan mendengar audiobook saat perjalanan pulangnya, perjalanan Bekasi Barat ke Sudirman menghabiskan lebih dari 2 jam perjalanan pulang-pergi, sehingga dengan mendengarkan <em>podcast, audiobook</em> ataupun ceramah sangat cocok untuk menemani dan menghibur kita dikala macet tak terhindarkan.</p>\n<p>Ada satu kekuatan utama dari belajar melalui suara ini yang menurut saya tidak bisa ditandingi oleh medium visual, yaitu kita tidak dituntut penuh perhatianÂ dalam menyimak seperti halnya belajar dari membaca ataupun menonton video pada youtube, yang umumnya akan memaksa kita secara aktif memperhatikan apa yang disampaikan melalui visualnya.</p>\n<p>Dengan audio, kita bisa sembari mengerjakan hal lain sekaligus, misalkan kita mendengarkan podcast secara pasif, sembari mencuci piring, berolahraga, ataupun mengemudi (dengan tetap aktif waspada pada berkendara ya, bisa menggunakan hanya satu sisi headset saja, agar suara klakson masi terdengar)</p>\n<h3 id=\"mcetoc_1fo6p9fhe5\">Podcast</h3>\n<p>Saya senang sekali medium podcast kini mulai marak, ada banyak siniar yang bisa kita pilih di berbagai platform aplikasi podcast, seperti Spotify, google podcast ataupun aplikasi karya anak bangsa yaitu Noise.</p>\n<p>Ada banyak sekali pilihan podcast yang bisa didengarkan dengan berbagai genre, ada podcast komedi, ada talkshow, ada drama suara macam di radio dulu<br>Kita hanya perlu memilih dan berlangganan podcast mana yang berkualitas dan sesuai dengan kebutuhan kita (bermanfaat/menghibur)</p>\n<h3 id=\"mcetoc_1fo6pabkf6\">Audiobook</h3>\n<p>Audible adalah platform audiobook dari amazon untuk buku-buku berbahasa Inggris, sangat sulit ditemui platform yang menyediakan konten audiobook berbahasa indonesia, bahkan saya menggunakan audio sintetis yang ada pada google book, tapi sayangnya hanya support bahasa inggris disini, jadi aneh jika harus membaca buku berbahasa Indonesia, suara mesin TTS ini persis seperti bule membaca text Indo, akhirnya saya membeli aplikasi Moon+ Reader Pro yang support text to speech menggunakan bahasa Indonesia, seperti ini:</p>\n<p>Â <iframe width=\"640\" height=\"480\" src=\"https://drive.google.com/file/d/1G5RHvfaSxxyl_WAtDv8mvRzOtkeAZ7iG/preview\" allow=\"autoplay\"></iframe></p>\n<h3 id=\"mcetoc_1fo6pbld17\">Yang lebih dari sekedar <em>podcast/audiobook</em></h3>\n<p>Lalu saya berkenalan dengan Inspigo, sebuah platform audio content yang penuh inspirasi, saya bisa belajar berbagai macam topik dari narasumber berkualitas, dibawakan dengan luar biasa oleh host nya yang memiliki gaya bicara luwes dan kualitas pertanyaan yang bagus sehingga bisa \"memeras habis\" ilmu dari narasumber.</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/50/inspigo.gif\" alt=\"tampilan aplikasi inspigo terbaru\" width=\"399\" height=\"839\">\n<figcaption >Tampilan aplikasi Inspigo yang manis</figcaption>\n</figure>\n<p>Ada beberapa point utama kenapa Inspigo lebih keren dari konten podcast:</p>\n<ul>\n<li><strong>Narasumber</strong> yang terpilih dan ahli di bidangnya</li>\n<li><strong>Kualitas</strong> Audio sangat <strong>istimewa</strong>. Suara narasumber dan host terdengar jelas</li>\n<li>Host inspigo yang sangat ahli dalam wawancara, kualitas pertanyaan yang diajukan, serta <strong>kepiawaian host</strong> dalam membuat flow yang baik, sehingga kita akan terus aktif menyimak alur diskusi</li>\n<li>Potongan episode yang singkat memberikan <strong>fleksibilitas</strong> dalam mendengarkan, saya seringkali mencari episode dibawah 10 menit, untuk didengarkan sembari perjalanan jalan kaki dari parkiran, menunggu lift sampai tiba di meja kerja</li>\n<li><strong>Keberkahan waktu</strong>, dengan mendengar konten inspiratif dari inspigo, otomatis kita akan mendengarkan hal yang bermanfaat ketimbang mendengar lagu yang gitu-gitu aja</li>\n</ul>\n<h2 id=\"mcetoc_1fo6ta47f8\">Freemium</h2>\n<p>Inspigo bisa di download secara gratis di appstore ataupun playstore dan kamu juga bisa mencoba langsung berbagai konten bermutu disana, namun untuk menikmati keseluruhan episode biasanya hanya bisa diakses oleh member yang sudah berlangganan, sangat murah kok biayanya, kurang lebih Rp1.000 per hari, perbedaan selengkapnya seperti ini:</p>\n<table class=\" align-center\"><caption>Perbedaan tipe member Inspigo</caption>\n<tbody>\n<tr>\n<td><strong>Berlangganan</strong></td>\n<td><strong>Gratis</strong></td>\n</tr>\n<tr>\n<td class=\"align-left\">Bisa akses konten penuh Inspirasi</td>\n<td class=\"align-left\">Bisa akses konten penuh Inspirasi</td>\n</tr>\n<tr>\n<td class=\"align-left\">Akses penuh ke semua episode disemua konten</td>\n<td class=\"align-left\">AksesÂ beberapa episode disetiap konten</td>\n</tr>\n<tr>\n<td class=\"align-left\">Bisa download dan didengar offline</td>\n<td class=\"align-left\">Tidak bisa download</td>\n</tr>\n<tr>\n<td class=\"align-left\">Bisa pilih size audio, pilih hemat quota atau high resulution</td>\n<td class=\"align-left\">Default audio quality</td>\n</tr>\n<tr>\n<td class=\"align-left\">\n<p>Rp85.000/3 bulan atau kalau dihitungÂ kurang dari 1.000/hari</p>\n<p>Atau ikutin berbagai misi untuk dapet bonus premium</p>\n</td>\n<td class=\"align-left\">\n<p>Ga pake bayar, tapi mending subscribe deh semurah itu kok</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Cara berlanggannya kita bisa beli kode voucher berlangganan di Tokopedia ataupun shopee, seperti ini cara membeli kode voucher via tokopedia:</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/50/topup-inspigo-toped.gif\" alt=\"topup inspigo via tokopedia\" width=\"400\" height=\"842\">\n<figcaption >topup inspigo via tokopedia</figcaption>\n</figure>\n<p>Setelah pembayaran komplit, kita harusnya akan mendapatkan kode voucher unik dari tokopedia, lalu cara redeem vouchernya di aplikasi Inspigo seperti ini:</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/50/redeem-voucher-inspigo.gif\" alt=\"cara redeem voucher inspigo\" width=\"398\" height=\"836\">\n<figcaption >cara redeem voucher inspigo</figcaption>\n</figure>\n<p>bahkan mau gratisan jadi premium member juga bisa loh, ada challenge yang bisa kita ikut partisipasi untuk mendapatkan imbalan akses premium, atau share id referal ke orang lain, seperti ini:</p>\n<figure class=\"post__image post__image\" ><img src=\"https://fachrul.id/media/posts/50/Screen-Shot-2021-12-31-at-09.08.18.png\" alt=\"kode referensi inspigo \" width=\"1038\" height=\"1952\">\n<figcaption >kode referensi inspigoÂ </figcaption>\n</figure>\n<p><br>Jadi, jika kalian belum mendaftar Inspigo bisa menggunakan <strong>id referal Inspigo: hnd4y</strong> saya ini ya, saya sangat berterima kasih karena dengan anda mendaftar dengan ID referal ini, saya akan mendapatkan 2 minggu extra langganan premium member.</p>\n<hr>\n<h2 id=\"mcetoc_1fo739rhb9\">Interaksi</h2>\n<p>Saya mengklaim sendiri termasuk ke dalam pendengar setia inspigo sedari awal, sekitar pertengahan 2018 saya sudah berlangganan dan senang sekali jika melihat UI/UX aplikasi inspigo sekarang sangat manis dan enak digunakan.</p>\n<p>Ada beberapa interaksi dengan tim Inspigo via Instagram, dan mereka sangat mendengar aspirasi dari pengguna loh,</p>\n<p>Beberapa feedback dari 2018 dulu:</p>\n<p>Â </p>\n<p><img class=\"post__image--left\" src=\"https://fachrul.id/media/posts/50/Screen-Shot-2021-12-31-at-08.55.09.png\" alt=\"\" width=\"290\" height=\"545\"><br><img class=\"post__image--right\" src=\"https://fachrul.id/media/posts/50/Screen-Shot-2021-12-31-at-08.54.37.png\" alt=\"\" width=\"287\" height=\"540\"></p>\n<p>Â </p>",
            "image": "https://fachrul.id/media/posts/50/pexels-andrea-piacquadio-3965238-1.jpg",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2021-12-31T05:57:57+07:00",
            "date_modified": "2021-12-31T09:48:28+07:00"
        },
        {
            "id": "https://fachrul.id/membentuk-pola-pikir-entrepreneurship-dalam-bekerja-sebagai-karyawan/",
            "url": "https://fachrul.id/membentuk-pola-pikir-entrepreneurship-dalam-bekerja-sebagai-karyawan/",
            "title": "Membentuk Pola Pikir Entrepreneurship dalam Bekerja Sebagai Karyawan",
            "summary": "\"Your job isÂ NOT your carrer\" adalah sebuah kalimat intisari dari diskusi perpisahan dengan manager saya di akhir bulan Oktober lalu, dan kalimat ini masih saja bergema di fikiran saya hingga sekarang dan memicu beberapa perenungan yang akan saya tuliskan disini untuk melepas unek-unek mengganjal ini.",
            "content_html": "<p><em><strong>\"Your job isÂ NOT your carrer\" </strong></em>adalah sebuah kalimat intisari dari diskusi perpisahan dengan manager saya di akhir bulan Oktober lalu, dan kalimat ini masih saja bergema di fikiran saya hingga sekarang dan memicu beberapa perenungan yang akan saya tuliskan disini untuk melepas unek-unek mengganjal ini.</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/48/pexels-rodnae-productions-7413915.jpg\" alt=\"Foto oleh RODNAE Productions dari Pexels\" width=\"640\" height=\"426\">\n<figcaption >Foto olehÂ <strong><a href=\"https://www.pexels.com/id-id/@rodnae-prod?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">RODNAE Productions</a></strong>Â dariÂ <strong><a href=\"https://www.pexels.com/id-id/foto/pemasaran-exit-teknologi-bisnis-7413915/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></strong></figcaption>\n</figure>\n<p>Â </p>\n<hr>\n<p><br>Sabagai pendahuluan, awal mulanya saya mengajukan sebuah pertanyaan kepada dia, <em>\"Why resign now, in time where the company is about to IPO?\",</em> yup mungkin terdengar materialistis, dan saya menduga jawaban dia akan mengarah ke tawaran perusahaan lain jauh lebih seksi, seperti kenaikan gaji yang signifikan ataupun tawaran RSU yang lebih bernilai. Tapi ternyata tidak!</p>\n<p>Dia menjawab bahwa perusahaan nantiÂ akan menarik, karena disana akan mengakselerasi pencapaian goal karir dia secara profesional, ia menegaskan bukan berarti perusahaan sekarang ini jelek, tetapi dia menemukan kapal yang lebih cepat dalam melaju. <em>\"Your job is not your carrier\"</em>Â ujarnya, selanjutnya dibungkus dengan jawaban klise dan politis, nah disini saya tertarik dengan argumen dia, sedikit takjub dengan idealisme yang dia pegang, atau mungkin sugar coating yang menarik jika ujung ujung nya hanya faktor finansial saja ahaha, tapi mari kita kembalikan fokus pada kutipan tadi ya.</p>\n<hr>\n<p><br>Kemudian saya teringat dengan pesan dari sebuah buku yang saya baca tempo lalu, mungkin pada saat itu saya mengingatnya hanya sebuah pengetahuan saja, namun kini mulai terlihat keterkaitannya, karena sangat relevan dengan apa yang dimaksud, bahwa:</p>\n<blockquote>\n<p>kita seharusnyaÂ <strong>tidak</strong>Â berfikir bahwa kita bekerja ke perusahaanÂ <strong>hanya</strong>Â sebagai karyawan yang menjalankan tugas dan kewajiban dan mendapatkan ganjaran gaji bulanan saja, melainkan kita harus memilikiÂ <strong>mental entrepreneurship</strong>, dimana kita memperlakukan karir kita sebagai sebuah bisnis, dan kita harus memikirkan produk/jasa, marketing, bahkan finance-nya.</p>\n</blockquote>\n<p>Jangan mau dibohongi oleh status \"pekerja swasta\" yang tugasnya hanya mengerjakan tugas yang diberikan, dan mendapatkan gaji rutin bulanan. <span style=\"text-decoration: underline;\">Mulai sekarang mulailah berfikir bahwa <strong>karir kamu sebagai bisnis yang kita rinitis</strong>, sebuah perusahaan dan kita sebagai CEO nya,</span> sehingga setiap keputusan yang kamu buat bisa berdampak pada kemajuan perusahaan kamu ini,Â dan anggaplah client perusahaan ini adalah perusahaan dimanaÂ kamu bekerja saat ini, ataupun skala lebih intinya, customerÂ kamu adalah rekan kerja kamu, mereka yang mendapatkan <em>value</em>Â yang kamu berikan.</p>\n<h2 id=\"mcetoc_1fjtd7lb51\">Bagaimana cara mengembangkan bisnis perushaan?</h2>\n<p>Mari kita lanjutkan lebih jauh setelah kita paham bahwa karir kitaÂ adalah sebuah bisnis dan bagaimana membuat perusahaan ini menjadi sukses makmur.</p>\n<p>Pertama, layaknya sebuah perusahaan, ia harus memiliki suatu produk atau jasa yang ditawarkan kepada client, karena hanya dengan hal ini perusahaan bisa menghasilkan uang. Pikirkan apa yang perusahaan karir kamu ini bisa jual? apakahÂ suatu barang atau jasa? ambilah contoh karir saya sebagai software developer, produk perusahaan \"karir\" sayaÂ adalah \"paket membuat website\", atauÂ secara sederhananya yang bisa saya jual adalah jasa untuk membuat sebuah gagasan menjadi produk digital berupa website.</p>\n<p>Sebuah bisnis tentu akan terus menerus mengembangkan produknya menjadi lebih baik, lebih beragam, dan karir kita pun harus seperti itu, contoh produk membuat website tadi misalkan, kita bisa menawarkan produk lain nya yang mendukung seperti TDD <em>(test driven development)</em> sehingga website yang dihasilkan lebih teruji dan berkualitas misalkan, dan salah satu tugas kita pula untuk memasarkan produk ini, kelebihannya dibanding kompetitor, yup kita pun harus bisa menjadi marketing perusahaan (diri) kita sendiri, memiliki produk yang bagus saja belumlah cukup, kita harus bisa meyakinkan klien bahwa produk kita memiliki kualitas yang baik toh, semakin baik kita memasarkan produk kita semakin tinggi keuntungan yang bisa kita dapatkan, bahkan semakin banyak potensial kustomer yang bisa kita peroleh.</p>\n<h2 id=\"mcetoc_1fjtddvqg2\">Bekerja melebihi harapan pelanggan</h2>\n<p>Adalah kunci untuk menjadi yang terdepan, pelanggan kita tidak melulu hanya si perusahaan tempat kita bekerja, rekan kerja kita sebenarnya adalah pelanggan kita, merekalah yang mendapatkan value yang kita berikan.</p>\n<p>Angaplah hubungan di kantor IT adalah hubungan transaksional. Seorang Developer pelanggan nya adalah QA, PM bahkan IT ops. Bagaimana si Developer ini bisa melebihi harapan pelanggan nya? adalah dengan mengetahui keinginan si pelanggan, misal Dev-QA, si developer tentu harus membuat aplikasi dengan kualitas yang baik, dia sendiri pun harus menguji aplikasi yang dia buat dengan teliti, agar dia bisa segera menemukan error dan memperbaiki dengan cepat, sehingga ketika aplikasi di uji oleh seorang QA, maka error sepele tidak lagi ada, dan meringankan kerja QA, atau contoh lain bagi seorang developer adalah membuat code yang baik atau bahkan membuat dokumentasi dari kode yang ia tulis agar di masa depan developer lain yang melanjutkan tidak akan kebingungan atau mengutuk dia dan malah merewrite aplikasi ke kode baru :D</p>\n<figure class=\"post__image post__image--wide\" ><img src=\"https://fachrul.id/media/posts/48/pexels-rodnae-productions-7414050.jpg\" alt=\"Foto oleh RODNAE Productions dari Pexels\" width=\"1280\" height=\"853\">\n<figcaption >Foto olehÂ <strong><a href=\"https://www.pexels.com/id-id/@rodnae-prod?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">RODNAE Productions</a></strong>Â dariÂ <strong><a href=\"https://www.pexels.com/id-id/foto/pemasaran-exit-teknologi-bisnis-7413915/?utm_content=attributionCopyText&amp;utm_medium=referral&amp;utm_source=pexels\">Pexels</a></strong></figcaption>\n</figure>\n<h2 id=\"mcetoc_1fjtdhjvh3\">Selanjutnya</h2>\n<p>Layaknya bisnis, ada banyak faktor yang harus diperhatikan selain hanya produk, seperti tadi sudah disingung mengenai marketing, perusahaan di dunia nyata pun kalau kita lihat banyak menghabiskan biaya untuk iklan kan produk mereka, sebagai software developer kitapun harus bisa \"menjual diri\" kita ke customer agar layak mendapatkan imbalan yang tinggi.</p>\n<p>Contoh marketing yang biasa ditempuh oleh software developer seperti memberikan sharing session, aktif di komunitas, membuat open source, membuat konten di sosial media (instagram, youtube, podcast, ataupun blog/medium).</p>\n<p>Lalu setelah memperoleh income, perusahaan pun harus pandai mengelola uang, divisi finance memegang peranan krusial dalam keberlangsungan perusahaan, kita harus pandai-pandai mengelola aliran uang masuk, khususnya jika kita sebagai pekerja lepas (freelance) dimana penghasilan bisa tak menentu, ataupun jika kamu karyawan bergaji tinggi harus juga mulai melek investasi sehingga bisa membuat portofolio aset untuk masa depan, minimal bisa menjaga kekayaan kita di masa depan (menghindari inflasi) atau bahkan menjadi passive income yang akan memenuhi kebutuhan kita nanti, karena sebesar apapun pendapatan apabila tidak bisa mengelola pengeluaran yang baik serupa ember bolong-bolong, sebanyak apapun air yang kamu isi, kemudian akan bocor juga dan habis suatu saat. Sederhananya, ember boleh saja bolong, tapi pastikan ada banyak keran yang mengisi toh</p>\n<h2 id=\"mcetoc_1fjtdjlq74\">Pekerjaanmu bukanlah karirmu</h2>\n<p>Kembali ke kasus manajer saya tadi, dia tak takut kehilangan potensi keuntungan dan berani mengambil risiko di pekerjaan baru, karena dia tahu keputusan nya pindah pekerjaan akan mengakselerasi karir dia ke depannya.</p>\n<p>Jadi, kita tak perlu setia pada perusahaan dimana kita bekerja, karena kita adalah CEO di perusahaan \"karir\" kita sendiri.</p>\n<p>Bahkan jika dipikirkan kembali, semua pekerjaan pun bisa menerapkan pola pikir entrepreneurship ini, bukan bekerja tapi berkarya, maka dari itu kita kenal istilah karyawan, orang yang berkarya, sekalipun pekerjaan sebagai tukang Vermak lepis keliling, yang mungkin produk utamanya adalahÂ memotong levis customer, namun jika mau meningkatkan layanan produknya, bisa saja dia berinovasi dari sisi marketing jasanyaÂ nya ini, misalnya dengan menuliskan akun sosial media di \"grobak\" nya dia, atau memberikan kartu nama, sehingga bisa \"menjemput rejeki\" ketika pelanggan perlu vermak, maka dia akan menghubungi dia, daripada mengandalkan luasnya cakupan keliling untuk meningkatkan probabilitas bertemu pelanggan yang membutuhkan jasanya.</p>\n<p>Baiklah, sekarang sudah percaya karirmu adalah perusahaanmu? seberapa siap kah kamu memimpin perusahaan \"Karir\" kamu ini?<br><br></p>",
            "image": "https://fachrul.id/media/posts/48/pexels-rodnae-productions-7414050.jpg",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2021-11-07T22:08:00+07:00",
            "date_modified": "2021-11-07T22:17:42+07:00"
        },
        {
            "id": "https://fachrul.id/api-test-framework-python-struktur-framework-dan-fluent-assertion-bagian-3/",
            "url": "https://fachrul.id/api-test-framework-python-struktur-framework-dan-fluent-assertion-bagian-3/",
            "title": "Struktur Framework dan Fluent Assertion - API Test Framework Python (Bagian 3)",
            "summary": " Hi Kawan ğŸ‘‹, Gimana mudah kan belajar bikin API automation dengan python? tentunya,, di kesempatan ini kita akan belajar lebih lanjut dengan pytest dan menggunakan library tambahan (lagi) agar test kita lebih mudah dibaca dan dipahami dengan bantuan fluent assertion Artikel ini adalah salah&hellip;",
            "content_html": "<p>Â </p>\n<p>Hi Kawan ğŸ‘‹,</p>\n<p>Gimana mudah kan belajar bikin API automation dengan python? tentunya,, di kesempatan ini kita akan belajar lebih lanjut dengan pytest dan menggunakan library tambahan (lagi) agar test kita lebih mudah dibaca dan dipahami dengan bantuan fluent assertionÂ </p>\n<p>Artikel ini adalah salah satu dari rangkaian tutorial cara membuat RestfulAPI Test Framework dengan bahasa pemrograman Python, artikel lainnya bisa kamu cekidot disini ya:</p>\n<ul>\n<li><a href=\"https://fachrul.id/yuk-belajar-cara-membuat-api-test-automation-framework-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">PelajaranÂ 1:Â  Setup dan pengenalan HTTP requests</a></li>\n<li><a href=\"https://fachrul.id/api-test-automation-framework-python-bagian-2/\" target=\"_blank\" rel=\"noopener noreferrer\">Pelajaran 2: Pengujian dengan assert dan pytest</a></li>\n<li><a href=\"https://fachrul.id/api-test-framework-python-struktur-framework-dan-fluent-assertion-bagian-3/\" target=\"_blank\" rel=\"noopener noreferrer\">Pelajaran 3: Struktur awal test framework dan library fluent assertion</a></li>\n<li><a href=\"https://fachrul.id/refactoring-dan-base-api-api-test-framework-python-bagian-4/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">Pelajaran 4: Refaktoring dan base helper</a></li>\n<li><a href=\"https://fachrul.id/reporting-api-test-framework-python-bagian-5/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">Pelajaran 5: Reporting</a></li>\n<li><a href=\"https://fachrul.id/json-schema-validation-api-test-framework-python-extra-bonus/\" target=\"_blank\" rel=\"noopener noreferrer\">Extra: Penambahan schema validation dan running test in parallel</a></li>\n</ul>\n<hr>\n<h2 id=\"mcetoc_1et6ojupi0\">Kenapa kita perlu fluent assertion?</h2>\n<p>Karena assert terlalu sederhana, dia hanya bisa mengevaluasi value True/False saja,, (eh tapi pada dasarnya semua juga sama sih mau pake library ini pun gitu, hahaha)</p>\n<p>Maksudnya ada banyak fitur tambahan dari library ini, bisa dilihat dokumentasinya di web resminyaÂ <a href=\"https://github.com/assertpy/assertpy\">https://github.com/assertpy/assertpy</a>Â dan secara kode pun akan mudah dibaca dan dipahami kok</p>\n<p>Install library ini dengan command `pip install assertpy`</p>\n<h2 id=\"mcetoc_1et6oq45a2\">Mengakses API method POST</h2>\n<p>Oke kali ini kita ga akan pake GET airports lagi sebagai contoh, tapi kita akan menggunakan contoh API POST untuk menghitung jarak antar airports ya, kurang lebih kode nya akan seperti ini</p>\n<pre><code class=\"language-python line-numbers\">import requests\nfrom assertpy import assert_that\n\n\ndef test_calculate_distance():\n    payload = {\n        \"from\": \"LAE\",\n        \"to\": \"NRT\"\n    }\n    response = requests.post(\"https://airportgap.dev-tester.com/api/airports/distance\", data=payload)\n    data = response.json().get(\"data\")\n    assert_that(data[\"type\"]).is_equal_to(\"airport_distance\")\n    assert_that(data[\"attributes\"]).is_not_empty()\n    assert_that(data).has_id(\"LAE-NRT\")\n    assert_that(data[\"attributes\"][\"kilometers\"]).is_equal_to(4753.834755437252)</code></pre>\n<p>Â Penjelasan kode, yang beda aja dari artikel sebelumnya ya hehe:</p>\n<ul>\n<li>from assertpy import assert_that ==&gt; melakukan import function assert_that yang berada pada module library assertpy</li>\n<li>payload = {} ==&gt; deklarasi variable dengan tipe data dictionary</li>\n<li>response = requests.post(&lt;url&gt;, data) ==&gt; nah seperti pada umumnya method POST adalah untuk mengirim data, maka kita akan mengirim data payload secara programatis dengan menggunakan argument tambahan data=payload</li>\n<li>assert_that(&lt;condition&gt;).is_equal_to(&lt;expected result&gt;) ==&gt; penggunaan assertpy library untuk assertion, lihatlah kodenya jadi mudah dipahami bukan?</li>\n</ul>\n<hr>\n<h2 id=\"mcetoc_1et6p6r1a3\">Struktur Framework pytest</h2>\n<p>Pada umumnya kode pengujian pada sebuah project python terletak pada directory `test` atau `tests`Â jadi untuk standarisasi kita akan mengikuti kaidah ini, sehingga bentuk project test kita menjadi seperti ini</p>\n<pre>.<br>â””â”€â”€ test<br> â”œâ”€â”€ airport_test.py<br> â””â”€â”€ favorite_test.py</pre>\n<p>Oia, sebagai convention pun kita perlu menamakan file kita dengan _test.py agar pytest bisa menemukan file mana saja yang akan dieksekusi sebagai test</p>\n<p>Kita membagi dua file utnuk pengujian api yang berkaitan dengan airport dan favorite ke dalam file yang terpisah agar mudah dipahami, jadi semua test yang berkaitan dengan module favorite pasti terletak di favorite_test.py jadi test kita pun bisa menjadi sebuah dokumentasi yang baik</p>\n<p>Kurang lebih contoh akhir dari file airport_test.py adalah seperti ini</p>\n<pre><code class=\"language-python line-numbers\">import requests\nfrom assertpy import assert_that\n\nBASE_URL = \"https://airportgap.dev-tester.com/api\"\n\n\ndef test_get_all_airports():\n    response = requests.get(f'{BASE_URL}/airports')\n    data = response.json().get('data')\n\n    assert_that(response.status_code).is_equal_to(200)\n    assert_that(data).is_greater_than_or_equal_to(5)\n\n\ndef test_get_airports_by_id():\n    # arrange/GIVEN\n    airport_id = \"LAE\"\n    # action/WHEN\n    response = requests.get(f'{BASE_URL}/airports/{airport_id}')\n    data = response.json().get('data')\n    data_airport = data[\"attributes\"]\n    # assertion/THEN\n    assert_that(response.status_code).is_equal_to(200)\n    assert_that(data_airport[\"name\"]).is_equal_to(\"Nadzab Airport\")\n\n\ndef test_get_not_found_airport():\n    airport_id = \"NOTFOUND\"\n    response = requests.get(f'{BASE_URL}/airports/{airport_id}')\n    assert_that(response.status_code).is_equal_to(404)\n    assert_that(response.json()).contains_key(\"errors\")\n    assert_that(response.text).contains(\"The page you requested could not be found\")\n\n\ndef test_calculate_distance():\n    payload = {\n        \"from\": \"LAE\",\n        \"to\": \"NRT\"\n    }\n    response = requests.post(\"https://airportgap.dev-tester.com/api/airports/distance\", data=payload)\n    data = response.json().get(\"data\")\n    assert_that(data[\"type\"]).is_equal_to(\"airport_distance\")\n    assert_that(data[\"attributes\"]).is_not_empty()\n    assert_that(data).has_id(\"LAE-NRT\")\n    assert_that(data[\"attributes\"][\"kilometers\"]).is_equal_to(4753.834755437252)\n</code></pre>\n<p>dan favorite_test.py</p>\n<pre><code class=\"language-python line-numbers\">from datetime import datetime\n\nimport requests\nfrom assertpy import assert_that\n\nBASE_URL = \"https://airportgap.dev-tester.com/api\"\n\n\ndef get_token(email, password):\n    return requests.post(BASE_URL + \"/tokens\", data={\n        \"email\": email,\n        \"password\": password\n    })\n\n\ndef get_my_favorite_airport(token):\n    header = {\n        \"Authorization\": f\"Token {token}\"\n    }\n    return requests.get(BASE_URL + \"/favorites\", headers=header)\n\n\ndef test_token():\n    token = get_token(email=\"naruto@mailinator.com\", password=\"shuriken\")\n    assert_that(token.status_code).is_equal_to(200)\n    assert_that(token.json()).contains_key(\"token\")\n    assert_that(token.json().get(\"token\")).is_not_empty()\n\n\ndef test_get_favorite():\n    give_me_token = get_token(email=\"naruto@mailinator.com\", password=\"shuriken\")\n    token = give_me_token.json().get(\"token\")\n    header = {\n        \"Authorization\": f\"Token {token}\"\n    }\n    response = requests.get(BASE_URL + \"/favorites\", headers=header)\n    data = response.json().get(\"data\")\n    assert_that(response.status_code).is_equal_to(200)\n    assert_that(data).is_greater_than_or_equal_to(1)\n\n\ndef test_add_new_favorite():\n    \"\"\"\n    Since the data is hardcoded, then it was not idempotent/repeatable\n    This test will failed, if NRT already in my favorite list\n    Need to remove after test teardown\n    \"\"\"\n    give_me_token = get_token(email=\"naruto@mailinator.com\", password=\"shuriken\")\n    token = give_me_token.json().get(\"token\")\n\n    before_add = get_my_favorite_airport(token)\n    data_before = before_add.json().get(\"data\")\n    assert_that(before_add.text).does_not_contain(\"NRT\")\n\n    new_airport = {\n        \"airport_id\": \"NRT\",\n        \"note\": \"I like Narita\"\n    }\n\n    header = {\n        \"Authorization\": f\"Token {token}\"\n    }\n\n    response = requests.post(BASE_URL + \"/favorites\", headers=header, data=new_airport)\n    assert_that(response.status_code).is_equal_to(201)\n    response_data = response.json().get(\"data\")\n    assert_that(response_data[\"attributes\"][\"airport\"][\"iata\"]).is_equal_to(new_airport[\"airport_id\"])\n    assert_that(response_data[\"attributes\"][\"note\"]).is_equal_to(new_airport[\"note\"])\n\n    after_add = get_my_favorite_airport(token)\n    data_after = after_add.json().get(\"data\")\n    assert_that(len(data_after)).is_greater_than(len(data_before))\n    assert_that(after_add.text).contains(new_airport[\"note\"])\n\n\ndef test_update_favorite_note():\n    give_me_token = get_token(email=\"naruto@mailinator.com\", password=\"shuriken\")\n    token = give_me_token.json().get(\"token\")\n\n    before_add = get_my_favorite_airport(token)\n    data_before = before_add.json().get(\"data\")\n\n    assert_that(len(data_before)).is_greater_than(0)\n    id_airport_to_modify = data_before[0][\"id\"]\n\n    header = {\n        \"Authorization\": f\"Token {token}\"\n    }\n\n    # Add dynamic unique string with a timestamp\n    new_note = {\n        \"note\": f\"The note for ID:{id_airport_to_modify} is changed at time: {datetime.now()} \"\n    }\n\n    response = requests.patch(f\"{BASE_URL}/favorites/{id_airport_to_modify}\", headers=header, data=new_note)\n    assert_that(response.status_code).is_equal_to(200)\n    assert_that(response.text).contains(new_note[\"note\"])\n\n    after_add = get_my_favorite_airport(token)\n    data_after = after_add.json().get(\"data\")\n    for airport_data in data_after:\n        if airport_data[\"id\"] == id_airport_to_modify:\n            print(f\"Found the modified airport {id_airport_to_modify}\")\n            print(\"\\nHere is the check for specific airport in an array data\")\n            assert_that(airport_data[\"attributes\"][\"note\"]).is_equal_to(new_note[\"note\"])\n\n\ndef test_delete_favorite():\n    give_me_token = get_token(email=\"naruto@mailinator.com\", password=\"shuriken\")\n    token = give_me_token.json().get(\"token\")\n\n    before_add = get_my_favorite_airport(token)\n    data_before = before_add.json().get(\"data\")\n\n    assert_that(len(data_before)).is_greater_than(0)\n    id_airport_to_delete = data_before[0][\"id\"]\n\n    header = {\n        \"Authorization\": f\"Token {token}\"\n    }\n\n    response = requests.delete(f\"{BASE_URL}/favorites/{id_airport_to_delete}\", headers=header)\n    assert_that(response.status_code).is_equal_to(204)\n    after_delete = get_my_favorite_airport(token)\n    data_after = after_delete.json().get(\"data\")\n    assert_that(len(data_after)).is_less_than(len(data_before))</code></pre>\n<p>Penjelasan kode? hmm sepertinya akan sangat panjang, nanti akan saya jelaskan pada video sepertinya agar lebih runut ehehe, klo nulis keknya panjang ehehe</p>\n<h2 id=\"mcetoc_1et6pnu1t4\">Bagaimana cara menjalankan kode dengan pytest?</h2>\n<p>Klo mau menjalankan satu satu sih bisa seperti cara sebelumnya `Â pytest test/airport_test.py`</p>\n<p>Tapi klo mau menjalankan seluruh test, karena sudah sesuai convention (dalam folder test, file sudah bearakhiran xxx_test.py dan method berawalan test_xxx) sebenarnya cukup menggunakan `pytest` saja tanpa embel embel loh</p>\n<hr>\n<p>Cukup sekian tutorial kali ini, silakan teman-teman pelajari approach saya dalam menulis kode di atas, apakah sudah test nya seperti itu? atau kamu mungkin punya assertion yang bisa jadi ditambahkan juga, silakan tulis di kolom komentar di bawah ya!</p>\n<p>Â Berikutnya kita akan bahas, bagaimana kode ini bisa kita refactor dengan menggunakan class Base API ya</p>\n<p>Salam!</p>\n<p>Selengkapnya ada pula di video live coding berikut ini:</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/8XcDzl5vVBU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2021-01-29T16:00:31+07:00",
            "date_modified": "2021-08-08T16:36:28+07:00"
        },
        {
            "id": "https://fachrul.id/api-test-automation-framework-python-bagian-2/",
            "url": "https://fachrul.id/api-test-automation-framework-python-bagian-2/",
            "title": "Assert dan Pytest - API Test Framework Python (Bagian 2)",
            "summary": "Hi Kawan ğŸ‘‹, Di artikel sebelumnya kita telah belajar mengenai instalasi python , library requests dan melakukan HTTP call dengan method GET secara programatis melalui kode python, walaupun belum ada test disana, karena memang artikelnya cukup panjang hehehe, jadi kita lanjut disini saja ya. Oh&hellip;",
            "content_html": "<p>Hi Kawan ğŸ‘‹,</p>\n<p>Di artikel sebelumnya kita telah belajar mengenai instalasi python , library requests dan melakukan HTTP call dengan method GET secara programatis melalui kode python, walaupun belum ada test disana, karena memang artikelnya cukup panjang hehehe, jadi kita lanjut disini saja ya.Â </p>\n<p>Oh iya artikel ini adalah salah satu dari rangkaian tutorial cara membuat RestfulAPI Test Framework dengan bahasa pemrograman Python, artikel lainnya bisa kamu cekidot disini ya:</p>\n<ul>\n<li><a href=\"https://fachrul.id/yuk-belajar-cara-membuat-api-test-automation-framework-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">PelajaranÂ 1:Â  Setup dan pengenalan HTTP requests</a></li>\n<li><a href=\"https://fachrul.id/api-test-automation-framework-python-bagian-2/\" target=\"_blank\" rel=\"noopener noreferrer\">Pelajaran 2: Pengujian dengan assert dan pytest</a></li>\n<li><a href=\"https://fachrul.id/api-test-framework-python-struktur-framework-dan-fluent-assertion-bagian-3/\" target=\"_blank\" rel=\"noopener noreferrer\">Pelajaran 3: Struktur awal test framework dan library fluent assertion</a></li>\n<li><a href=\"https://fachrul.id/refactoring-dan-base-api-api-test-framework-python-bagian-4/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">Pelajaran 4: Refaktoring dan base helper</a></li>\n<li><a href=\"https://fachrul.id/reporting-api-test-framework-python-bagian-5/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">Pelajaran 5: Reporting</a></li>\n<li><a href=\"https://fachrul.id/json-schema-validation-api-test-framework-python-extra-bonus/\" target=\"_blank\" rel=\"noopener noreferrer\">Extra: Penambahan schema validation dan running test in parallel</a></li>\n</ul>\n<hr>\n<h2 id=\"mcetoc_1et6mhigj1\">Bagaimana cara menguji API response secara programatis dengan python?</h2>\n<p>Pada umumnya di semua bahasa pemrograman memiliki sebuah statement yang digunakan untuk menguji kebenaran sebuah expresion pada program, dan akan mentrigger error pada saat kondisi tersebut bernilai false, pada python kita mengenalnya dengan `assert`, namun sebelum kita menggunakan fungsi `assert`, alangkah baiknya jika kita mengetahui bagaimana cara menguji aplikasi secara sederhana (atau equivalent dari assert):</p>\n<pre class=\"lang-py s-code-block hljs python\"><code><span class=\"hljs-keyword\">if</span> <span class=\"hljs-keyword\">not</span> condition:\n    <span class=\"hljs-keyword\">raise</span> AssertionError()</code></pre>\n<p>Apabila menggunakan `assert` maka, kode di atas akan menjadi serupa:</p>\n<pre class=\"lang-py s-code-block hljs python\"><code><span class=\"hljs-keyword\">assert</span> condition</code></pre>\n<p>Jika kamu perhatikan, assert tidak memiliki kurung seperti function pada umumnya, karena ia adalah sebuah statement bukan sebuah function, oia assert juga bisa memiliki pesan opsional, jadi ketika program kita bisa menyisipkan sebuah kalimat tambahan yang akan mempermudah proses debug, contohnya:</p>\n<pre class=\"lang-py s-code-block hljs python\"><code><span class=\"hljs-keyword\">assert</span> response_ok, <span class=\"hljs-string\">\"Oh no! Server /api/airports is not responding OK!\"</span>\n</code></pre>\n<p>Nah bagaimana implementasinya di kode kita sebelumnya?</p>\n<pre>import requests<br><br>response = requests.get('https://airportgap.dev-tester.com/api/airports')<br>assert response.status_code == 200</pre>\n<p>Penjelasan kode:</p>\n<ul>\n<li>baris 1-3 =&gt; kita import library request dan mengakses server dengan method GET lalu disimpan ke dalam variable `response`</li>\n<li>baris 4 =&gt; kita melakukan pengujian apakah response.status bernilai 200, jika tidak maka program akan error</li>\n</ul>\n<p>Oia satu yang perlu disimak, jika assert mengevaluasi nilai False, maka program akan BERHENTI karena error, jadi baris setelah assert failed tidak akan di eksekusi loh! ini bisa memiliki efek samping jika kita perlu melakukan teardown atau proses tertentu setelah test selesai dilakukan (contoh pada pengujian Web, teardown untuk menutup browser setelah sesi test selesai)</p>\n<hr>\n<h2 id=\"mcetoc_1et6nb3mn2\">Pytest? Benda apakah itu bro?</h2>\n<p>Pytest adalah test library pada python, mirip junit atau testNG pada java, selengkapnya sudah saya tulis di artikel terpisah diÂ <a href=\"https://fachrul.id/belajar-pytest-framework-1/\">https://fachrul.id/belajar-pytest-framework-1/</a></p>\n<p>Oke penggunaan pytest pada project kita sekarang adalah agar kode test yang kita tulis menjadi rapih dan memiliki report pada command line yang lebih rapih manakala ada kejadian errorÂ </p>\n<p>Untuk menggunakan pytest kita perlu install dahulu library nya dengan cara mengetikan command `pip install pytest` pada terminal/cmd kamu</p>\n<p>contoh implementasi pytest</p>\n<pre>import requests<br><br><br>def test_get_all_airports():<br>    response = requests.get('https://airportgap.dev-tester.com/api/airports')<br>    data = response.json().get('data')<br><br>    assert response.status_code == 200<br>    assert len(data) &gt; 5</pre>\n<p>apa yang beda pada kode kita? berikut penjelasannya</p>\n<ul>\n<li>import requests =&gt; kita meninisiasi import library request sebelum digunakan di baris setelahnya</li>\n<li>def test_get_all_airports(): =&gt; kita membuat sebuah function yang diawali dengan def lalu nama function nya, dan penamaan function ini wajib memiliki prefix test_xxxx untuk dikenali sebagai sebuah test case oleh pytest nantinya</li>\n<li>response = requests.get(&lt;url&gt;) =&gt; kita melakukan permintaan data pada webserver dan ditampung ke dalam variable response</li>\n<li>data = response.json().get('data') =&gt; disini kita akan melakukan chaining proses dari mulai parsing response dalam bentuk json menjadi tipe data dictionary pada python, dan dilanjutkan dengan method .get('data')Â artinya kita akan mengambil value dari atribut \"data\" pada dictionary tadi</li>\n<li>assert response.status_code == 200 =&gt; kita melakukan pengujian dengan mengevaluasi status code http response nya harus sama dengan 200</li>\n<li>assert len(data) &gt; 5 =&gt; function len digunakan untuk menghitung berapa jumlah data pada suatu list/collection, nah disini artinya kita melakukan pengujian jumlah data airport harus lebih dari 5</li>\n</ul>\n<h2 id=\"mcetoc_1et6o5h7m3\">Lalu bagaimana cara menjalankan kodenya?</h2>\n<p>oia untuk pytest ada sedikit perbedaan pada cara menjalankan kode/file test, jika sebelumnya kita menjalankanÂ kode pada terminal/cmd dengan `python nama_file.py` sekarang menjadi `pytest nama_file.py`</p>\n<p>perhatikan output pada console sekarang menjadi berbeda dengan materi sebelumnya di pelajaran 1 kan ya!</p>\n<p>oia untuk lebih informatif bisa tambahkan -v (verbose) pada argument pytest menjadi seperti ini `pytest -v nama_file.py`</p>\n<p>Jika kode tidak berjalan dengan pytestÂ yang perlu diperhatikan adalah penamaan method (def) harus diawali dengan test_xxx yaa!</p>\n<p>Â </p>\n<p>Salam!</p>\n<p>Selengkapnya ada pada video live coding ini:</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/XkrOAdGQ8Zk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2021-01-29T15:58:54+07:00",
            "date_modified": "2021-08-08T16:36:48+07:00"
        },
        {
            "id": "https://fachrul.id/yuk-belajar-cara-membuat-api-test-automation-framework-python-bagian-1/",
            "url": "https://fachrul.id/yuk-belajar-cara-membuat-api-test-automation-framework-python-bagian-1/",
            "title": "Yuk Belajar Cara Membuat API Test Automation Framework Python (Bagian 1)",
            "summary": "Hi Kawan ğŸ‘‹, Di kesempatan kali ini saya akan membuat rangkaian post yang berisi tutorial cara membuat API Test Framework dengan Python dari dasar sampai jadi sebuah framework testing yang siap di integrasikan dengan pipeline CI/CD ğŸ˜ğŸ¤˜ Oke setiap post akan berisi sebuah topik tahapan&hellip;",
            "content_html": "<p>Hi Kawan ğŸ‘‹,</p>\n<p>Di kesempatan kali ini saya akan membuat rangkaian post yang berisi tutorial cara membuat API Test Framework dengan Python dari dasar sampai jadi sebuah framework testing yang siap di integrasikan dengan pipeline CI/CD ğŸ˜ğŸ¤˜</p>\n<p>Oke setiap post akan berisi sebuah topik tahapan pelajaran dari dasar disetiap aspeknya, semoga saja ini bisa bermanfaat bagi teman-teman yangÂ mulai belajar menekuni dunia software quality assurance / Test engineering ya,Â harapan saya, tutorial ini bisa membantuÂ teman-teman untuk memahami approachÂ API testing, dan bisa mempermudah implementasi API testÂ framework dengan python di tempat kerja kalianÂ </p>\n<p>Kurang lebih rangkaian posting akan seperti:</p>\n<ul>\n<li><a href=\"https://fachrul.id/yuk-belajar-cara-membuat-api-test-automation-framework-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">PelajaranÂ 1:Â  Setup dan pengenalan HTTP requests</a></li>\n<li><a href=\"https://fachrul.id/api-test-automation-framework-python-bagian-2/\" target=\"_blank\" rel=\"noopener noreferrer\">Pelajaran 2: Pengujian dengan assert dan pytest</a></li>\n<li><a href=\"https://fachrul.id/api-test-framework-python-struktur-framework-dan-fluent-assertion-bagian-3/\" target=\"_blank\" rel=\"noopener noreferrer\">Pelajaran 3: Struktur awal test framework dan library fluent assertion</a></li>\n<li><a href=\"https://fachrul.id/refactoring-dan-base-api-api-test-framework-python-bagian-4/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">Pelajaran 4: Refaktoring dan base helper</a></li>\n<li><a href=\"https://fachrul.id/reporting-api-test-framework-python-bagian-5/\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">Pelajaran 5: Reporting</a></li>\n<li><a href=\"https://fachrul.id/json-schema-validation-api-test-framework-python-extra-bonus/\" target=\"_blank\" rel=\"noopener noreferrer\">Extra: Penambahan schema validation dan running test in parallel</a></li>\n</ul>\n<p>Kamu bisa berkomentar atau bertanya di pada bagian komentar post tersebut, insya alloh nanti akan saya jawab sebisanya ehehe, atau bisa juga DM dan follow @fachrulch untuk kritik dan saran nya dalam pembahasan iniÂ </p>\n<hr>\n<h2 id=\"mcetoc_1et6qe1m90\">Â Apa itu API sih?</h2>\n<p id=\"mcetoc_1et6f6a0c2\">Sebenernya saya ga yakin bisa menjelaskannya dengan benar, mungkin bisa kamu googling aja nanti ya klo masih belum jelas dari penjelasan saya ehehe, jadi kurang lebih gini:</p>\n<p><img class=\"post__image--left\" src=\"https://fachrul.id/media/posts/41/api-1.png\" alt=\"\" width=\"800\" height=\"454\">API (Application Programming Interface) atau juga seringkali dikenal dengan webservice adalah bentuk komunikasi antar sistem, sederhananya, API menyediakan serangkaian cara/kontrak bagaimana sebuah informasi bisa ditransfer/diakses.</p>\n<p>API ada dua kategori, yaitu SOAP dan REST, SOAPmenggunakan format XML yang membungkus informasi data nya, sejauh yg saya tau soap masih umum dipergunakan oleh perbankan sampai saat ini, sedangkan REST sudah umum dipakai oleh khalayak ramai, karena lebih ringan dalam hal ukuran data yang disimpan dalam format JSON, dan umumnya permintaan dan penerimaan data menggunakan protokol HTTP, biasanya menggunakan verbs GET, POST, PUT dan DELETE dalam berinteraksi.</p>\n<p>Di kesempatan ini kita akan fokus dalam pembuatan API test framework untuk RESTful API ya, tools yang sering dipergunakan dalam berinteraksi dengan API adalah Postman</p>\n<figure class=\"post__image post__image--full\" ><img src=\"https://fachrul.id/media/posts/41/rest-api-contoh-sederhana.png\" alt=\"\" width=\"1280\" height=\"757\">\n<figcaption >RestAPI secara sederhana</figcaption>\n</figure>\n<p>Â </p>\n<h2 id=\"mcetoc_1et6fs4l03\">Kenapa Perlu Membuat API test automation?</h2>\n<p>Test functional dari API sebenarnya lewat postman juga bisa, entah manually atau automation test disana, memiliki functional API automation adalah langkah besar dalam pengujian yang cepat terhadap sistem, apalagi API cenderung lebih stabil daripada UI automation test. Dampak yang bisa kita harapkan dari memiliki automation test pada API/webservice adalah kita bisa menguji user flow, business logic dengan cepat dan stabil.</p>\n<p>Nah kita akan membuat API test automation dengan python, walaupun sebenarnya bisa juga dibuat dengan bahasa pemrograman lain seperti java, kotlin, javascript, dll. tetapi menurut saya python lebih sederhana dan mudah dipelajari oleh pemula, juga sangat powerful bagi tingkat mahir sekalipun, so i think it is good investment</p>\n<h2 id=\"mcetoc_1et6g6lkh4\">OK, terus apa yang diperlukan dalam pengembangan API test framework dengan Python?</h2>\n<p>Udah siap? oke kita list dulu ya apa saja yang diperlukan dalam pengembangan API test framework dengan bahas python</p>\n<ol>\n<li>Komputer kamu sudah terinstal python (saran saya sudah versi 3.8 keatas ya)</li>\n<li>Install code editor, saran saya sih menggunakan PyCharm, tapi klo mau yg lebih ringan boleh pake Visual Code ataupun Notepad++ juga bisa harusnya</li>\n</ol>\n<hr>\n<h2 id=\"mcetoc_1et73n59h0\"><img class=\"post__image--center\" src=\"https://fachrul.id/media/posts/41/airportgap.png\" alt=\"\" width=\"500\" height=\"592\"></h2>\n<h2 id=\"mcetoc_1et6gh63a6\">Studi Kasus</h2>\n<p>Oke, sepertinya kita akan bahas dulu aplikasi apa yang akan menjadi target kita dalam pengembangan API test framework, sebagai contoh kita akan mengautomasi pengujian padaÂ <a href=\"https://airportgap.dev-tester.com\">https://airportgap.dev-tester.com</a>Â sebuah dummy app yang dikhususkan bagi teman-teman yang berlatih dalam mengasah automation skill pada API</p>\n<p>Kenapa saya pilih ini? karena koleksi API disini kurang lebih akan mirip dengan apa yang kamu punya di kantor, ada API yang bisa diakses dengan GET, POST, DELETE dan PUT/PATCH, jadi bisa dikatakan mini project API, apalagi dokumentasinya API juga sudah cukup jelas ya, bisa diakses disiniÂ <a href=\"https://airportgap.dev-tester.com/docs\">https://airportgap.dev-tester.com/docs</a></p>\n<p><img class=\"post__image--left\" src=\"https://fachrul.id/media/posts/41/374px-Requests_Python_Logo.png\" alt=\"\" width=\"374\" height=\"480\"></p>\n<h2 id=\"mcetoc_1et6gchqd5\">Pelajaran 1 - pengenalan HTTP requests</h2>\n<p>SiapÂ kita mulai ya, untuk mengakses API/webservice kita perlu sebuah library yang akan memudahkan kita dalam berinteraksi dengan API, yaitu menggunakan library requests, cara menginstall library ini adalah dengan command</p>\n<pre>pip install requests</pre>\n<p>Dokumentasi requests menurut saya sangat jelas dan keren, coba saja lihat <a href=\"https://requests.readthedocs.io/en/master/\">https://requests.readthedocs.io/en/master/</a> , kita bisa pelajari lebih lanjut fitur dan kemampuan requests disana ya, tapi secara natural sangat mudah diingat kok method dan fungsi nya</p>\n<p>Lanjut,, kita akan mengakses informasi daftar airports yand bisa diakses dengan melakukan request GET pada endpoint `/api/airports` dan melihat apa saja informasi yang terkandung di dalamnya</p>\n<p>Untuk itu kita harus membuat file python baru di folder/direktori yang sudah kamu pilih ya</p>\n<p>Di baris awal kita perlu melakukan import library request dahulu dengan menambahkan kode `import requests` lalu di baris berikutnya kita akan menggunakan library requests dalam mengakses API dengan kode</p>\n<pre><code class=\"language-python line-numbers\">import requests\n\nresponse = requests.get('https://airportgap.dev-tester.com/api/airports')\nprint(response.status_code)\nprint(response.text) \n    </code></pre>\n<p>Â </p>\n<p>Penjelasan kode:</p>\n<ul>\n<li>import requests =&gt; melakukan import library `requests` sebelum penggunaan di baris selanjutnya</li>\n<li>response = requests.get(&lt;url&gt;) =&gt; kita melakukan permintaan GET pada sebuah url yang kemudian di tampung kedalam variable `response`</li>\n<li>print(response.status_code) dan print(response.text) =&gt; kita mengeluarkan text response dan status code kepada python console dengan command print</li>\n</ul>\n<p>Bagaimana cara run file ini? yaitu dengan membuka terminal/cmd lalu masuk ke directory/folder dimana file python ini berada, kemudian kita tinggal menjalankan command `python namafile.py` maka kita bisa melihat hasil requests di dalam console terminal/cmd</p>\n<hr>\n<h2 id=\"mcetoc_1et6i3cek7\">Penutup</h2>\n<p>Namun,,, ini masih belum ada test nya ya, di pelajaran kali ini kita hanya bisa melihat hasil GET pada console, tanpa ada pengujian secara otomatis (pengujian masih visual oleh kita melalui console ehehe)</p>\n<p>Karena materi disini sudah cukup panjang ehehe, PR dari saya di tahap 1 ini adalah untuk mempelajari <a href=\"https://requests.readthedocs.io/en/master/\" target=\"_blank\" rel=\"noopener noreferrer\">dokumentasi requests</a> ya, kita lihat betapa mudahnya mengkases webservice dengan library ini, baik itu dengan method GET, POST, PUT, PATCH ya</p>\n<p>Dimateri berikutnya kita akan menggunakan test dengan assertion jadi sudah mulai masuk ke automation test</p>\n<p>Salam!</p>\n<p>Selengkapnya ada di Video live coding berikut ini</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/nsdHPitMSSI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></p>",
            "image": "https://fachrul.id/media/posts/41/pexels-zachary-debottis-1888883.jpg",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2021-01-29T14:00:27+07:00",
            "date_modified": "2021-08-08T16:37:52+07:00"
        },
        {
            "id": "https://fachrul.id/belajar-pytest-framework-1/",
            "url": "https://fachrul.id/belajar-pytest-framework-1/",
            "title": "Pytest: Memahami Cara Kerja Testing Framework (bagian 1)",
            "summary": "Apa itu pytest?icon PytestAdalah kerangka kerja dari pengujian pada kode python, bisa dibilang semua test framework (junit, testng, rspec, dkk) adalah jantung nya dari segala test automation framework, pytest bisa digunakan pada berbagai tipe dan level dari software testing, sebenarnya ada berbagai alternatif testing tools&hellip;",
            "content_html": "<h2 id=\"mcetoc_1e8ifufs10\">Apa itu pytest?</h2>\n<figure class=\"post__image post__image--left\" ><img src=\"https://fachrul.id/media/posts/34/pytest1.png\" alt=\"\" width=\"150\" height=\"143\">\n<figcaption >icon Pytest</figcaption>\n</figure>\n<p>Adalah kerangka kerja dari pengujian pada kode python, bisa dibilang semua test framework (<em><strong>junit, testng, rspec</strong></em>, dkk) adalah jantung nya dari segala test automation framework, pytest bisa digunakan pada berbagai tipe dan level dari software testing, sebenarnya ada berbagai alternatif testing tools pada python yang lainya seperti uniitest ataupun nose, tapi banyak open source project yang mulai \"hijrah\"Â mengadopsi pytest karena fitur yang ada pada <a href=\"https://docs.pytest.org/en/latest/\">pytest</a>Â yang menarik diantara yang lainya yaitu:</p>\n<ul>\n<li>Mudah membuat kode test dari pengujian sederhana hingga pengujian kompeks tetap mudah menuliskan kodeÂ pengujiannya dengan pytest</li>\n<li>Mudah dibaca</li>\n<li>Mudah dipelajari</li>\n<li>Kode yang Pythonic banget</li>\n<li>Bahkan pytest bisa menjalankan kode pengujian yang ditulis dengan format unittest ataupun nose</li>\n<li>Komunitas yang sangat aktif dan pengembangan yang terjaga</li>\n</ul>\n<p>Â </p>\n<hr>\n<p>Post ini merupakan rangkaian post mengenai membuat automationt test dengan python</p>\n<h4 id=\"mcetoc_1e8mtsf4p6\">Daftar isinya:</h4>\n<ol>\n<li><a href=\"https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/\" target=\"_blank\" rel=\"noopener noreferrer\">Belajar Python dari dasar</a></li>\n<li><a href=\"https://fachrul.id/belajar-pytest-framework-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Memahami cara kerja Pytest (bagian 1)</a> &lt;== Sekarang disini</li>\n<li><a href=\"https://fachrul.id/memulai-automation-test-selenium-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Mulai membuat automation test dengan Selenium</a></li>\n<li><a href=\"https://fachrul.id/selector-locator-strategy-yang-baik/\" target=\"_blank\" rel=\"noopener noreferrer\">Menemukan Element dengan locator strategi yang baik</a></li>\n</ol>\n<hr>\n<p>Â </p>\n<p>Berikutnya akan kitaÂ belajar tentang penggunaan pytest dalam mengembangkan kerangka kerja (framework) pengujian otomatis (automated test) dalam bahasa pemrograman python, dengan menguasai kerangka kerja pengujian di python maka kamu akan dengan mudahÂ mengkombinasikan automated test pada REST API, browser dengan selenium nya ataupun mobile apps dengan appium karena sesungguhnya mereka itu adalah library yang menjadi pelengkap pytest ini ğŸ˜…Â </p>\n<h2 id=\"mcetoc_1e8igll785\">Persiapan Pytest</h2>\n<p>Saya asumsikan python sudah terinstal di komputer kamu, dan tak diperlukan untuk tahu banyak tentang python itu sendiri, karena contoh yang akan saya tunjukan cuma kode sederhana bahkan bisa dibilang terlalu sederhana :D</p>\n<p>Cara installnya cukup menjalankan command berikut pada terminal ataupun command line kamu</p>\n<p><code>pip install pytest</code></p>\n<p>lalu setelah installasi berhasil coba jalankan perintah:</p>\n<p><code>pytest --help</code></p>\n<p>jika installasi benar maka akan memunculkan informasi lengkap tentang cara penggunaan pytest pada command line</p>\n<p>dokumentasi lebih lanjut bisa dilihat diÂ <a href=\"https://docs.pytest.org/en/latest/\">https://docs.pytest.org/en/latest/</a>Â </p>\n<h2 id=\"mcetoc_1e8ifuj801\">Menjalankan Pytest</h2>\n<p id=\"mcetoc_1e8mm5g730\">Secara aturan (convention) di berbagai macam project pengujian, kode test harus ditaruh didalam directory (folder) /tests/, dan secara otomatis pytest akan menemukan dan mengeksekusi test yang ditemukan dalam proses test discovery seperti berikut:</p>\n<ul>\n<li>Nama file mengandung nama \"<em><strong>test_&lt;sesuatu&gt;.py</strong></em>\" ataupun \"<em><strong>&lt;sesuatu&gt;_test.py</strong></em>\"</li>\n<li>Test class yang dinamai \"<strong><em>Test&lt;Sesuatu&gt;</em></strong>\"</li>\n<li>Test method/function yang diawali \"<strong><em>test_&lt;sesuatu&gt;</em></strong>\", dan menariknya, pytest tidak memerlukan sebuah file <strong><em>__init__.py</em></strong> disemua test directory seperti pada aplikasi python pada umumnya</li>\n</ul>\n<p>cara menjalankan kode test:</p>\n<table>\n<tbody>\n<tr>\n<td><code>$ â€‹â€‹pytestâ€‹â€‹ tests/</code></td>\n<td>menjalankan seluruh test pada directory /tests/</td>\n</tr>\n<tr>\n<td><code>$ â€‹â€‹pytestâ€‹â€‹ tests/nama_file.py</code></td>\n<td>menjalankan test hanya pada module \"nama_file.py\"</td>\n</tr>\n<tr>\n<td><code>$ â€‹â€‹pytestâ€‹â€‹ tests/nama_file.py::TestClass</code></td>\n<td>menjalankan test hanya pada class TestClass di module \"nama_file.py\"</td>\n</tr>\n<tr>\n<td>\n<p><code>$ â€‹â€‹pytestâ€‹â€‹ tests/nama_file::TestClass::test_method</code></p>\n<p>atau jika bentuk test bukan dalam Class</p>\n<p><code>$ â€‹â€‹pytestâ€‹â€‹ tests/nama_file::test_method</code></p>\n</td>\n<td>menjalankan test hanya di method tertentu saja, tidak menjalankan method lainnya</td>\n</tr>\n</tbody>\n</table>\n<p>Â </p>\n<h2 id=\"mcetoc_1e8mst3vq1\">Marker</h2>\n<p>Penggunaan decorator <em><strong>@pytest.mark.&lt;sesuatu&gt;</strong></em> sangat memudahkan kita dalam mengelompokan test, ibarat tagging dari test, satu test bisa memiliki lebih dari satu mark, dan kitapun bisa mengeksekusi test berdasarkan mark tertentu, seperti berikut</p>\n<p><code>$ â€‹â€‹pytestâ€‹â€‹ -m smoke</code></p>\n<p>maka pytest akan mencari test mana saja yang memiliki tag @pytest.mark.smoke untuk dijalankan</p>\n<p>Informasi lebih lanjut, kamu bisa akses dokumentasinya langsung di terminal dengan perintah</p>\n<p><code>$ â€‹â€‹pytestâ€‹â€‹ --help</code></p>\n<h2 id=\"mcetoc_1e8ifum052\">Menulis Test</h2>\n<p>Kurang lebih contoh kerangka kerja test pada pytest sebagai berikut:</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/34/Screen-Shot-2020-05-19-at-22.56.59.png\" alt=\"\" width=\"450\" height=\"450\">\n<figcaption >struktur kode pytest pada umumnya</figcaption>\n</figure>\n<p>Â </p>\n<p>File test berada dibawah directory tests, dan pytest.ini adalah file optional, biasanya terkait dengan configurasi default cara menjalankan pytest, lalu pytest.py ini juga optional, bisa dianggap file ini berisikan dari \"local plugin\" karena semua kode yang ada disini bisa diakses oleh seluruh file test yang dijalankan, sehingga sangat cocok untuk menaruh kode yang bisa di reuse antar test</p>\n<p>Pada kesempatan kali ini sebagai contoh sederhana dalam mencoba pytest, buatlah sebuah file /tests/test_math.py yang di dalamnya isinya sebagai berikut:</p>\n<pre><code class=\"language-python\">def test_pertambahan():\n    assert 1 + 11 == 12\n    \n    \nclass TestHimpunan:\n    def test_persamaan(self):\n        assert (1,2,3) == (1,2,3)\n</code></pre>\n<p id=\"mcetoc_1e8mn0coi1\">lalu cara menjalankan nya pada terminal dengan perintah sebagai berikut:</p>\n<p><code>pytest tests/test_math.py</code></p>\n<p>Output yang dihasilkan kurang lebih seperti berikut:</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/34/Screen-Shot-2020-05-19-at-22.21.54.png\" alt=\"\" width=\"1024\" height=\"538\">\n<figcaption >output test berhasil</figcaption>\n</figure>\n<p>Ok kita bahas ya, pada contoh diatas saya menjalankan 2 test pada file <em><strong>test_math.py</strong></em> yaitu <em><strong>def test_pertambahan</strong></em> dan <strong><em>def test_persamaan</em></strong>, disini saya menunjukan bahwa pytest support bentuk kode pengujian yang dituliskan sebagai function mandiri atau method pada class, tidak ada perbedaan signifikan, hanya pengelompokan test saja menurut saya.</p>\n<p>Dan jika ditilik lagi, jika test berjalan baik dan passed akan ditandai dengan simbol titik warna hijau (di windows gada warnanya) pada output console danÂ jika failed ditandai dengan huruf F warna merah, disertai dengan informasi pelengkapnya.</p>\n<p>agar lebih jelas lagi mari kita coba membuat test gagal dengan mengubah nilai pada assertnya, dan agar tampilan output console lebih informatif, jalankan perintahÂ <code>pytest -v tests/test_math.py</code> lalu perhatikan error message yang ditampilkan sebagai berikut</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/34/Screen-Shot-2020-05-19-at-22.26.15.png\" alt=\"\" width=\"1024\" height=\"1352\">\n<figcaption >hasil menjalankan kode test yang ternyata failed :P</figcaption>\n</figure>\n<p>Ada berbagai macam jenis outcome dari sebuah test yang akan dihasilkan oleh pytest sebagai berikut:</p>\n<ul>\n<li><strong>PASSED</strong> (.) adalah test yang berjalan sebagaimana mestinya</li>\n<li><strong>FAILED</strong> (F) adalah test yang tidak berjalan seperti yang diharapkan</li>\n<li><strong>SKIPPED</strong> (s) adalah test yang tidak dijalankan (dilompati), kita bisa mengkonfigurasi test yang harus di lompati dengan menggunakan decorator <em><strong>@pytest.mark.skip()</strong> </em>atau secara programatically</li>\n<li><strong>xfail</strong> (x): adalah test yang tidak seharusnya untuk pass, jadi secara eksplisit kita mengharapkan suatu test untuk failed, ditandai dengan decorator <em><strong>@pytest.mark.xfail()</strong></em></li>\n<li><strong>XPASS</strong> (X): kurang lebih mirip xfail</li>\n<li><strong>ERROR</strong> (E) adalah exception yang terjadi diluar test function tersebut, bisa gara-gara fixture, di hook atau dari mis-configurasi</li>\n</ul>\n<h2 id=\"mcetoc_1e8ifuoob3\">Ekspektasi</h2>\n<p>Pytest akan menggak exception yang tidak dihandle sebagai sebuah failure, pada saat statement assert dihadapkan kepada nilai False maka ia akan melempar exception dan langsung memberhentikan eksekusi program, jadi tidak akan dilanjutkan ke statement setelah assert yang failed tersebut</p>\n<pre><code class=\"language-python\">class TestHimpunan:\n    def test_persamaan(self):\n        assert (1,3,5) == (1,4,5)\n        print('Bagian ini tidak akan dijalankan')</code></pre>\n<p id=\"mcetoc_1e8mp1cg62\">Tapi jika memang justru exception yang diharpkan maka bisa menggunakanÂ <span class=\"pln\">pytest</span><span class=\"pun\">.</span><span class=\"pln\">raises</span></p>\n<p>Â </p>\n<h2 id=\"mcetoc_1e8mr42ou1\">Contoh studi kasus JSON api kode post Indonesia</h2>\n<p>Contoh API test sederhana menggunakan pytest untuk menguji json api dari repo iniÂ <a href=\"https://github.com/bachors/Kode-Pos-API\">https://github.com/bachors/Kode-Pos-API</a>Â yang memiliki aplikasi live di firebaseio</p>\n<p>Kita buat file di tests/feature_kodepost/test_kodepos_indonesia.py, isinya</p>\n<pre><code class=\"language-python\">iimport requests \n\ndef test_provinsi():\n    list_provinsi = requests.get('https://kodepos-2d475.firebaseio.com/list_propinsi.json?print=pretty')\n    data_prov = list_provinsi.json()\n    assert len(data_prov) == 34\n    assert data_prov.get('p9') == 'Jawa Barat'\n    \ndef test_kotakab_jabar():\n    list_kotakab = requests.get('https://kodepos-2d475.firebaseio.com/list_kotakab/p9.json?print=pretty')\n    data_kotakab = list_kotakab.json()\n    assert list_kotakab.status_code == 200\n    assert data_kotakab.get('k60') == 'Tasikmalaya_typo'\n    assert len(data_kotakab) == 21\n    \ndef test_kodepos_tasik():\n    list_keckel = requests.get('https://kodepos-2d475.firebaseio.com/kota_kab/k60.json?print=pretty')\n    data_kodepos = list_keckel.json()\n    assert list_keckel.status_code == 200\n    assert len(data_kodepos) == 420\n </code></pre>\n<p>lalu cara menjalankannya denganÂ  command</p>\n<p><code>âœ pytest -v tests/feature_kodepos</code></p>\n<p>maka akan muncul output sebagai berikut</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/34/Screen-Shot-2020-05-19-at-23.21.32.png\" alt=\"\" width=\"1024\" height=\"1020\">\n<figcaption >output menjalankan test kdoepos</figcaption>\n</figure>\n<p>Test nya sengaja saya buat failed, karena untuk melihat betapa cantiknya error log dari pytest jika terjadi masalah, apa yang menarik disini:</p>\n<ul>\n<li>Informasi kesalahan yang jelas, contoh diatas ada typo pada string yang dibandingkan (assert) maka ditunjukan kelebihan character dengan tanda plus</li>\n<li>test dijalankan sesuai dengan urutan penulisan test pada file, jadi dieksekusi dari atas kebawah</li>\n<li>walaupun test ke-2 failed, tetap melanjutkan ekseskusi test ke-3, (stop ekseskusi karena throw exception hanya pada scope test function, jadi dari failed tersebut tidak akan melanjutkan ekseskusi baris statement berikutnya tapi langsung pindah ke test berikutnya)</li>\n</ul>\n<p>Yuk kita bermain dengan kode test diatas, berikutnya kita ubah kode test sebagai berikut</p>\n<p>Kita tambahkan decorator xfail di method yg gagal menjadi seperti ini</p>\n<div>\n<pre><code class=\"language-python\">@pytest.mark.xfail\ndef test_kotakab_jabar():<br>   ...</code></pre>\n<p>Lalu jalankan kembali testnya dan outputnya sekarang berbeda</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/34/Screen-Shot-2020-05-19-at-23.34.05.png\" alt=\"\" width=\"1024\" height=\"580\">\n<figcaption >semua hasil passed dengan catatan 1 xfail</figcaption>\n</figure>\n<p>Nah terlihat bahwa sekarang semua test hijau (passed) dengan catatan ada 1 test yang memang expected failed (xfailed)</p>\n<h2 id=\"mcetoc_1e8msnr5s0\">Pytest Fixtures</h2>\n<p>Nah bagian ini sebenarnya yang menurut saya paling keren dari pytest, tapi berhubung postingan kali ini sudah cukup panjang, maka informasi lebih lanjut terkait fixture akan disambung di post selanjutnya ya, dengan contoh framework pada web ui testing</p>\n<p>Bersambung ...</p>\n</div>",
            "image": "https://fachrul.id/media/posts/34/Screen-Shot-2020-05-20-at-00.05.17.png",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2020-05-19T23:59:58+07:00",
            "date_modified": "2020-05-20T00:06:39+07:00"
        },
        {
            "id": "https://fachrul.id/selector-locator-strategy-yang-baik/",
            "url": "https://fachrul.id/selector-locator-strategy-yang-baik/",
            "title": "Selector (Locator) Strategy adalah koentji dari Test Automation",
            "summary": "Hi kawan, Jika kamu berkecimpung di pemrograman automation test menggunakan selenium / appium tentunya kamu sudah paham banget kalau sampe salah selector (locator) makaÂ kamu telah membuang banyakÂ waktu karena selector yang kamu telah tuliskan tidak ditemukan dan harus re-run lagi ğŸ˜­ Menemukan element pada tampilan aplikasi&hellip;",
            "content_html": "<p>Hi kawan,</p>\n<p>Jika kamu berkecimpung di pemrograman automation test menggunakan selenium / appium tentunya kamu sudah paham banget kalau sampe salah selector (locator) makaÂ kamu telah membuang banyakÂ waktu karena selector yang kamu telah tuliskan tidak ditemukan dan harus re-run lagi ğŸ˜­</p>\n<p>Menemukan element pada tampilan aplikasi seperti buttons, inputs, divs, checkboxes ataupun anchor tag terkadang cukup \"menantang\", terutama ketika tidak adanya ke-unikan ataupun identitas yang jelas pada element tersebut, bahakan pernah saya menguji aplikasi yang ID nya selalu berubah karena digenerate otomatis oleh library front end nya. Alamakjang ğŸ˜µ</p>\n<hr>\n<p>Post ini merupakan rangkaian post mengenai membuat automationt test dengan python</p>\n<h4 id=\"mcetoc_1e8mtsf4p6\">Daftar isinya:</h4>\n<ol>\n<li><a href=\"https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/\" target=\"_blank\" rel=\"noopener noreferrer\">Belajar Python dari dasar</a></li>\n<li><a href=\"https://fachrul.id/belajar-pytest-framework-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Memahami cara kerja Pytest (bagian 1)</a>Â </li>\n<li><a href=\"https://fachrul.id/memulai-automation-test-selenium-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Mulai membuat automation test dengan Selenium</a></li>\n<li><a href=\"https://fachrul.id/selector-locator-strategy-yang-baik/\" target=\"_blank\" rel=\"noopener noreferrer\">Menemukan Element dengan locator strategi yang baik</a>Â &lt;== Sekarang disini</li>\n</ol>\n<hr>\n<p>Â </p>\n<h2 id=\"mcetoc_1e88anigp0\">Apa sih web/mobile elements itu?</h2>\n<p>Terjemahan ala saya sih ia adalah sebuah element adalah entitas pada aplikasi yang di render menjadi halaman web ataupun user interface pada mobile app. Jadi apapun yang dilihat oleh pengguna (termasuk yang ga keliatan sih) adalah element, seperti buttons submit, foto profile, navigasi halaman.</p>\n<p>Biasanya bentuknya berupa HTML pada web ataupun XML pada mobile apps, jadi bisa dikatakan memiliki struktur seperti tag name, attributes dan contents, termasuk kedalam hierarki posisinya.</p>\n<p>Untuk pembahasan ini saya cenderung membahas element pada web, untuk mobile apps akan dibahas lebih rinci di lain kesempatan karena perbedaan struktur source code tampilan lintas platformnya, tapi masih sangat relevan dengan mobile apps terutama mobile browser ya gaes.</p>\n<h2 id=\"mcetoc_1e88anmi41\">Nah itu kan baru element, trus selector itu apa?</h2>\n<p>Jadi selector ataupun locator adalah sebuah bentuk query untuk mengakses element tertentu yang ada di halaman aplikasi, nah untuk website biasanya object hasil query locator ini disebut node yang terletak di Document Object Model (DOM)</p>\n<p>Perlunya selector element pada aplikasi adalah sebagai awal mula interaksi automation. Setelah selenium/appium menemukan element sesuaiÂ selector maka kamu bisa mengakses method di element itu seperti meng-click button, menginput text, ataupun mengambil text pada element tersebut.</p>\n<h2 id=\"mcetoc_1e88anq9m2\">Kenapa kok perlu banget selector?</h2>\n<p>Jadi gini, sebagai manusia yang menggunakan aplikasi tentu kita tidak perlu selector untuk berinteraksi dengan aplikasi, kita bisa menggunakan indera penglihatan untuk menjalankan aksi seperti submit form, scrollingÂ halaman, click sana sini di halaman web, tapi tidak begitu bagi test automation yang harus menerjemahkan interaksi manusia tadi ke istilah yang komputer bisa mengerti secara programatis. JadiÂ selenium/appium ga akan melihat aplikasi sebagaimana kita kita melihat tampilannya, tapiÂ ia akan melihatnya secara source code struktural seperti html/xml (catatan: tapi jaman now, sedang gandrung library/tools yang mendukung visual testing juga loh seperti <a href=\"https://applitools.com\" target=\"_blank\" rel=\"noopener noreferrer\">applitools</a>, <a href=\"https://www.mabl.com\" target=\"_blank\" rel=\"noopener noreferrer\">mabl</a>, <a href=\"http://test.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">test.ai</a> dkk)</p>\n<h2 id=\"mcetoc_1e88anu3m3\">Hmm gitu ya.. Bentuk element itu seperti apa sih?</h2>\n<p>Sebagai contoh kita akan bedah element di google.co.id ya, coba pada browser chrome kamu (sama juga pada firefox ataupun safari) klik kanan pada kotak pencarian trus pilih opsi menu \"Inspect\" maka akan muncul jendela Developer tool, pada Tab aktif \"Elements\", seperti ini gambarannya: (kamu coba juga donk ah)</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/33/gugel.png\" alt=\"\" width=\"1764\" height=\"901\">\n<figcaption >tampilan inspect element pada google chrome</figcaption>\n</figure>\n<p>Pada gambar diatas saya memberikan keterangan nomer,Â  yang akan saya jelaskan sebagai berikut:</p>\n<ol>\n<li>Pada gambar no.1 diatas, kotak pencarian adalah target element yang kita lihat, nampak ada highlight warna biru di element tersebut</li>\n<li>Ini adalah kode sumber HTML dari halaman google.co.id yang aktif pada bagian kotak pencarian yaitu tag &lt;input/&gt; beserta atribut yang melekat pada nya</li>\n<li>Apa yang disarankan oleh browser chrome jika kamu mencari element kotak pencarian ini, ada tag dengan classnya, accessibility yang ada pada element tersebut</li>\n</ol>\n<p>Nah jika kita terjemahkan pada kode automation dengan python (yang kurang lebih akan sama juga dengan selenium bindder di bahasa pemrograman lainya) nampak seperti berikut:</p>\n<div>\n<pre><code class=\"language-python line-numbers\">search_box = driver.find_element_by_name('q')\n# driver.find_element(By.NAME, 'q')  &lt;= atau alternatif bisa juga seperti ini\nsearch_box.send_keys('Belajar automation testing' + Keys.ENTER)</code></pre>\n</div>\n<p>di baris pertama saya akan membuat variable search_box yang isinya adalah element yang mengandung nama \"q\" seperti pada keterangan element search box yang saya tunjukan sebelumnya si kotak pencarian ini memiliki element &lt;input ...Â <span class=\"webkit-html-attribute-name\">name</span>=\"<span class=\"webkit-html-attribute-value\">q</span>\" ... /&gt; nah disini selector yang kita ambil adalah attribut name sama dengan \"q\", di baris kedua adalah alternatif cara penulisan kode saja</p>\n<p>di baris berikutnya, adalah proses automation test code saya untuk berinteraksi dengan element tersebut yaitu mengirimkan perintah send keys alias ketikan kataÂ Belajar automation testing pada kotak pencarian dilanjutkan dengan menekan tombol Enter</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/33/hasil-pencarian-google-belajar-automation.png\" alt=\"\" width=\"1749\" height=\"890\">\n<figcaption >hasil pencarian kata kunci 'belajar automation' pada google search</figcaption>\n</figure>\n<p>Selector pun adakalanya bersifat tidak unik, seperti pada halaman pencarian google diatas, search result pada umumnya berupa list yang identik secara rupa dan bentuk, karena memiliki stylesheet (CSS) yang sama, hanya isi yang beda, lantas bagaimana cara kita memilih element yang kita mau agar lebih akurat akan kita diskusikan nanti ya.</p>\n<p>Bisa jadi kebutuhan test kita pun perlu mendapatkan element yang lebih dari satu juga, katakan lah contoh diatas mau kita jadikan test code seperti ini jadinya (masih di bahasa python):</p>\n<div>\n<pre><code class=\"language-python line-numbers\">results_title = driver.find_elements_by_css_selector('h3')\nassert len(results_title) &gt; 0\n</code></pre>\n<p>Â Dimana kebutuhannya memang menghitungÂ jumlah dariÂ hasil pencarian yang didapatkan dengan asusi kata kunci tersebut akan menemukan data pada halaman hasil pencarian, makanya kita memerlukan selector pada element judul pencarian yaitu &lt;h3&gt;</p>\n<p>Pada test framework yang besar umumnya mengadopsi design pattern \"<a href=\"https://www.guru99.com/page-object-model-pom-page-factory-in-selenium-ultimate-guide.html\" target=\"_blank\" rel=\"noopener noreferrer\">Page Object Model</a>\" untuk mengelola selector / locator dan interaksi di halaman tertentu, ada juga sih yang mengadopsi <a href=\"https://www.infoq.com/articles/Beyond-Page-Objects-Test-Automation-Serenity-Screenplay\" target=\"_blank\" rel=\"noopener noreferrer\">Screenplay Pattern</a> dimana sedikit ada perbedaan lokasi dimana selector disimpan pada kode automation testnya</p>\n<h2 id=\"mcetoc_1e88aomug4\">Hmm.. trus gimana cara saya menemukan selector?</h2>\n<p>Sebenernya,Â cara untuk menentukan selector itu ada banyak, bisa dari element tag, id, class, attributes, isi text, bahkan relatif terhadap element parent/child/sibling juga bisa, bahkan yang saya sebutkan tadi bisa dikombinasikan juga loh. Wadidaw, banyak banget sih selector strategi yang bisa diterapkan. Dalam waktu dekat saya pun akan membuat video tutorial terkait berbagai penggunaan selector strategi, karena medium video lebih enak untuk langsung terjun praktek penggunaan, jadi jangan lupa <a href=\"https://www.youtube.com/channel/UCZVY3VNPkFs_iINTXEBWWgw\" target=\"_blank\" rel=\"noopener noreferrer\">subscibe disini</a> ya gaes ahaha</p>\n<p>Kita harus hati-hati juga, penulisan selector yang salah mengharuskan kita re-run automation test dan ini mubazir waktu loh. Kalau selectornya terlalu luas bisa salah dalam menentukan element yang harusnya kita dapat, kalau terlalu spesifik malah rawan breaking ketika ada yang berubah di struktur DOM nya, kalau terlalu panjang jadi sulit untuk di baca oleh yang lain. Jadi gimana donk?</p>\n<p>Prinsip yang bisa dipegang dalam membuat selector / locator strategy yang saya pegang adalahÂ <strong>Buatlah selector yang paling sederhana dalam menemukan keunikan element yang menjadi target kita</strong></p>\n<p>Â Nah biasanya urutannya seperti ini:</p>\n<ol>\n<li>Element nya punya ID (yang unik) kah? =&gt; pake ID aja</li>\n<li>CSS class nya spesifik dan cuma ada di element itu (untuk format) =&gt; pake CSS klo selector kalo gitu</li>\n<li>Masih nyampur nih klo pake strategi 1 atau 2 =&gt; yaudah kombinasikan aja kedua nya, jadi \"#id .class\" atau \".class #id\"</li>\n<li>Waduh masih ga bisa nih, saya maunya element yangÂ ke-4 dari filter 1-3 tadi =&gt; Oke tambahin posisi \"#id li:nth-of-type(4)\"</li>\n<li>Tapi saya maunya element yang mengandung text tertentu =&gt; pake xpath klo gituÂ //button[text()[contains(.,'Sebut Saja Mawar')]]</li>\n</ol>\n<p>Di urutan 5 itu udah paling rawan banget deh, selector text emang bisa, tapi klo webnya support ganti bahasa bisa jadi ambyar itu loh. Lebih baik diobrolin lagi deh sama developer untuk mulai menuliskan identitas element yang kita mau jadi lebih unik lagi agar lebih testable.</p>\n<p>Sebagai perbandingan, kita coba lihat web tokopedia, mereka memiliki element khusus yang memudahkan QA membuat locator yang stabil</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/33/contoh-tokopedia-element-data.jpg\" alt=\"\" width=\"1734\" height=\"893\">\n<figcaption >Kode sumber Tokopedia menunjukan penggunaan data-testid sebagai penunjang selector strategy nya</figcaption>\n</figure>\n<p>Â </p>\n<p>Data-* adalah attribute baru di HTML5 dan termasuk atribut yang valid, enaknya punya atribut khusus macam ini tuh klo ada perubahan desain di UI yang biasanya akan pakai ID atau CLASS, test nya akan tetap sama dan stabil karena tidak terganggu</p>\n<p>Atau di bukalapak juga ada, bedanya disana pakai css class</p>\n<figure class=\"post__image post__image--center\" ><img src=\"https://fachrul.id/media/posts/33/contoh-element-qa-class-bukalapak.jpg\" alt=\"\" width=\"1281\" height=\"888\">\n<figcaption >Kode sumberÂ Bukalapak menunjukan penggunaanÂ qa-* class sebagai penunjang selector strategy nya</figcaption>\n</figure>\n<h2 id=\"mcetoc_1e88bdnur5\">Jadi gimana sebenarnya selector / locator yang baik?</h2>\n<p>Kalau menurut saya, automation test menjadiÂ stabil, locator yang baik itu harus memenuhi kriteria seperti:</p>\n<h4 id=\"mcetoc_1e88bdseo6\">Sederhana</h4>\n</div>\n<div>Semakin pendek penulisan query selector semakin baik dan stabil, contoh nya \"#first_name\".Â  Jangan gunakan attribut atau class yang merujuk ke css formating seperti class=\"col-sm\" atau id=\"83924csdj\" yang tampak seperti di generate otomatis oleh JS lib</div>\n<div>Â </div>\n<h4 id=\"mcetoc_1e88be01g7\">Mudah dibaca</h4>\n<div>Jangan menulis query selector yang panjang ataupun sulit dibaca seperti:</div>\n<ul>\n<li>html/body/div[1]/section/div[1]/div/div/div/div[1]/div/div/div/div/div[3]/div[1]/div/h4[1]/b</li>\n<li>//*[@id=\"wakwaw\"]//child::label//following-sibling::input[1]</li>\n</ul>\n<div>Â </div>\n<h4 id=\"mcetoc_1e88beg9k8\">Semantic</h4>\n<div>ArtinyaÂ query yang dipilih harus sesuai kan dengan maksud element tersebut artinya lebih baik menuliskan selector seperti ini \"input#kampus\" daripada hanya \"#kampus\" agar lebih jelas lagi saat membaca kode yang di maksud id=\"kampus\" adalah sebuah element input bukan div ataupun button</div>\n<div>Â </div>\n<h2 id=\"mcetoc_1e88bep6h9\">Jadi Kesimpulannya</h2>\n<div>Selector strategy yang baik berperan besar terhadap stabilitas automation code kamu, jika aplikasi yang akan di test tidak memungkinkan membuat selector yang baik, artinya sudah waktunya mengangkat issue testablility aplikasi dengan developer ataupun stakeholder agar test menjadi lebih stabil maka diperlukan sedikit tunning lagi pada kode sumber aplikasinya<br>\n<h2 id=\"mcetoc_1e88bf1rna\">Â Rujukan lebih lanjut</h2>\n<ul>\n<li><a href=\"https://blog.mozilla.org/fxtesteng/2013/09/26/writing-reliable-locators-for-selenium-and-webdriver-tests/\">https://blog.mozilla.org/fxtesteng/2013/09/26/writing-reliable-locators-for-selenium-and-webdriver-tests/</a>Â </li>\n<li><a href=\"https://www.guru99.com/locators-in-selenium-ide.html\">https://www.guru99.com/locators-in-selenium-ide.html</a>Â </li>\n<li><a href=\"https://www.guru99.com/xpath-selenium.html\">https://www.guru99.com/xpath-selenium.html</a></li>\n<li><a href=\"https://selenium-python.readthedocs.io/locating-elements.html\">https://selenium-python.readthedocs.io/locating-elements.html</a></li>\n<li><a href=\"https://gs.statcounter.com/browser-market-share\">https://gs.statcounter.com/browser-market-share</a>Â Ternyata browser chrome masih paling banyak dipakai oleh orang seluruh dunia</li>\n</ul>\n<p>Â </p>\n</div>",
            "image": "https://fachrul.id/media/posts/33/gugel-selector.png",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2020-05-14T08:25:31+07:00",
            "date_modified": "2020-05-19T23:58:24+07:00"
        },
        {
            "id": "https://fachrul.id/memulai-automation-test-selenium-python-bagian-1/",
            "url": "https://fachrul.id/memulai-automation-test-selenium-python-bagian-1/",
            "title": "Memulai Automation Test Selenium + Python (bagian 1)",
            "summary": "Hi Kawan, Sesuai dengan post sebelumnya, pada kesempatan kali ini saya akan berbagi resep tentang membuat automation test framework dengan menggunakan bahasa pemrograman python + selenium, jadi di akhir sesi kamu pasti bisa membuat otomatisasi pengujian pada browser Google Chrome ya (kalau setup nya benar)&hellip;",
            "content_html": "<p>Hi Kawan,</p>\n<p>Sesuai dengan post sebelumnya, pada kesempatan kali ini saya akan berbagi resep tentang membuat automation test framework dengan menggunakan bahasa pemrograman python + selenium, jadi di akhir sesi kamu pasti bisa membuat otomatisasi pengujian pada browser Google Chrome ya (kalau setup nya benar) ğŸ˜…</p>\n<h3 id=\"mcetoc_1e7uke56u0\">Kenapa membuat tutorial automation test dengan python?</h3>\n<p>Tujuannya saya buat tutorial kali ini adalah untuk memperkaya khasanah tutorial bahasa Indonesia pada automation test menggunakan bahasa pemrograman python, dimana mayoritas hasil penelusuran yang ada di gugle menggunakan bahasa pemrograman java ataupun javascript.</p>\n<hr>\n<p>Post ini merupakan rangkaian post mengenai membuat automationt test dengan python</p>\n<h4 id=\"mcetoc_1e8mtsf4p6\">Daftar isinya:</h4>\n<ol>\n<li><a href=\"https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/\" target=\"_blank\" rel=\"noopener noreferrer\">Belajar Python dari dasar</a></li>\n<li><a href=\"https://fachrul.id/belajar-pytest-framework-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Memahami cara kerja Pytest (bagian 1)</a>Â </li>\n<li><a href=\"https://fachrul.id/memulai-automation-test-selenium-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Mulai membuat automation test dengan Selenium</a>Â Â &lt;== Sekarang disini</li>\n<li><a href=\"https://fachrul.id/selector-locator-strategy-yang-baik/\" target=\"_blank\" rel=\"noopener noreferrer\">Menemukan Element dengan locator strategi yang baik</a>Â </li>\n</ol>\n<hr>\n<p>Â </p>\n<h2 id=\"mcetoc_1e7ukf4el1\">Yuk kita mulai!!!</h2>\n<p>Sebentar.. sebentar.. bentuk tutorial yang akan saya share adalah perpaduan dari video tutorial dan blog post, jadi kedua medium pembelajaran ini akan saling melengkapi, untuk video bisa diakses disini:</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/dApgg02293I\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Lalu catatan pada video akan merujuk pada postingan disini</p>\n<h2 id=\"mcetoc_1e7uki6ad2\">Tools yang digunakan</h2>\n<p>Hal pertama yang kita perlukan adalah interpreter kode python sudah terinstall di laptop/komputer kamu, terlepas dari sistem operasi apapun (windows/macOS/linux) saya asumsikan command `python atau python3` bisa dijalankan di terminal/command line kamu ya, jika belum, silahkan merujuk ke post <a href=\"https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/\" target=\"_blank\" rel=\"noopener noreferrer\">pendahuluan python saya sebelumnya disini</a></p>\n<h3 id=\"mcetoc_1e7ukpuf33\">Kode Editor</h3>\n<p>Editor python ada banyak, dimulai dari yang ada di terminal seperti vim, kode editor ringan dan lengkap seperti:</p>\n<ol>\n<li><a href=\"https://www.sublimetext.com\" target=\"_blank\" rel=\"noopener noreferrer\">sublime</a></li>\n<li><a href=\"https://code.visualstudio.com\" target=\"_blank\" rel=\"noopener noreferrer\">visual code</a></li>\n<li><a href=\"https://atom.io\" target=\"_blank\" rel=\"noopener noreferrer\">atom</a></li>\n<li>ataupun IDE yang kumplit seperti <a href=\"https://www.jetbrains.com/education/download/\" target=\"_blank\" rel=\"noopener noreferrer\">PyCharm Edu</a>.</li>\n</ol>\n<p>Sebagai pendamping dalam menulis kode python saya biasanya akan menginstal pula <a href=\"http://kite.com\" target=\"_blank\" rel=\"noopener noreferrer\">Kite</a>Â sebagai tambahan autocomplete dan documentation di local tapi ini opsional sih, ga di install juga gapapa (ukuran file nya gede sih ahaha)</p>\n<h3 id=\"mcetoc_1e7ul4jfl4\">Chromedriver</h3>\n<p>Bisa diunduh di :Â <a href=\"https://chromedriver.chromium.org/downloads\">https://chromedriver.chromium.org/downloads</a>Â </p>\n<p>Lalu tambahkan directory binary chromedriver ke sistem path kamu, (windows bisa taruh chromedriver.exe di folder c:\\windows\\System32 klo linux bisa tambahkan di path via ~/.bash_profile atau ~/.zshrc kamu. Atau klo macOS bisa lebih mudah tinggal jalankan perintah berikut di terminalÂ <code class=\"language-shell\">brew cask install chromedriver</code></p>\n<h3 id=\"mcetoc_1e7ule8i35\">Â Python Packaging Tools</h3>\n<p>Salah satu best practice pemrograman python adalah memiliki packaging tools yang menjadi depedency management library python agar tidak saling bertabrakan, jadi diperlukan virtual environment, kita akan menggunakan `pipenv` untuk itu, jalankan perintah berikut di terminal</p>\n<pre><code class=\"language-shell-session\"><span class=\"gp\">$ pip install pipenv<br></span></code></pre>\n<p>atau klo gagal karena km menggunakan python3 bisa menggunakan command `pip3 install pipenv`Â </p>\n<p>Nah yuk kita mulai kodingnya.. Silahkan liat videonya ya</p>\n<p>Skenario test yang dijalankan</p>\n<pre><code class=\"language-gherkin\">Scenario: Search Profile in Google</code><br><code class=\"language-gherkin\">Given I am in google home page</code><br><code class=\"language-gherkin\">When I search for \"Fachrul Choliluddin\"</code><br><code class=\"language-gherkin\">Then I should see search result of \"Fachrul Choliluddin\"</code></pre>\n<h2 id=\"mcetoc_1e84lvea30\">Apa itu Selector?</h2>\n<p><em>Selector</em>Â adalah sebuah format yang digunakan oleh library sepertiÂ <em>Selenium</em>Â danÂ <em>Capybara</em>Â untuk menemukan elemen pada web seperti gambar, tulisan, tombol, dan sebagainya. Untuk bisa menggunakanÂ <em>Selector</em>Â akan lebih baik jika anda mengenal HTML terlebih dahulu. Kamu bisa lihat materinyaÂ <a href=\"https://www.w3schools.com/html/\" rel=\"nofollow\">disini</a>.</p>\n<h2 id=\"mcetoc_1e84lvv7e1\">Apa itu CSS Selector?</h2>\n<p><em>CSS</em>Â adalah sebuah notasi (<em>selector</em>) yang digunakan untuk menemukan elemen tertentu pada halaman web. CSS sendiri digunakan oleh web developer untuk memberikanÂ <em>style</em>Â pada halaman web seperti warna, besar dan lebar gambar, bentuk tombol, dan berbagai fungsi lainnya. Properti-properti pada CSS ini bisa kita manfaatkan untuk mendeteksi sebuah elemen pada web.</p>\n<h2 id=\"mcetoc_1e84lvv7e2\">Cara Menggunakan CSS selector</h2>\n<p>Sebenarnya kita sudah menggunakan syntax CSS pada lesson sebelumnya. YaituÂ <code>#login_link</code>. Dimana kita memanfaatkan elemenÂ <code>id</code>Â pada tombol login untuk mendeteksi keberadaan tombol login.</p>\n<p>Materi mengenai CSS sendiri sangat luas, sehingga kamu bisa baca mengenai CSS lebih lanjutÂ <a href=\"https://www.w3schools.com/css/\" rel=\"nofollow\">disini</a>.</p>\n<h2 id=\"mcetoc_1e84m19cn7\">Apa itu XPath?</h2>\n<p><em>XPath</em>Â adalah sebuah notasi (<em>selector</em>) yang digunakan untuk menemukan elemen tertentu pada halaman web.Â <em>Xpath</em>Â memiliki bentuk syntax yang lebih fleksibel jika dibandingkan dengan CSS. Sehingga lebih umum digunakan untuk mencari elemen web yang tidak bisa dicari olehÂ <em>selector</em>Â CSS.</p>\n<h2 id=\"mcetoc_1e84m1dkp8\">Mengapa Memakai XPath?</h2>\n<p>Misalkan saya punya halaman web dengan format HTML seperti ini ...</p>\n<div class=\"highlight highlight-text-html-basic\">\n<pre>&lt;<span class=\"pl-ent\">div</span> <span class=\"pl-e\">class</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>parent<span class=\"pl-pds\">\"</span></span>&gt;\n    &lt;<span class=\"pl-ent\">h2</span>&gt;Ayam&lt;/<span class=\"pl-ent\">h2</span>&gt;\n    &lt;<span class=\"pl-ent\">p</span>&gt;Ayam adalah salah satu unggas yang bisa dimakan&lt;/<span class=\"pl-ent\">p</span>&gt;\n    &lt;<span class=\"pl-ent\">div</span> <span class=\"pl-e\">class</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>child<span class=\"pl-pds\">\"</span></span>&gt;\n        &lt;<span class=\"pl-ent\">h3</span>&gt;Gambar Ayam&lt;/<span class=\"pl-ent\">h3</span>&gt;\n        &lt;<span class=\"pl-ent\">img</span> <span class=\"pl-e\">id</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>ayam_image<span class=\"pl-pds\">\"</span></span> <span class=\"pl-e\">src</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>ayam.jpg<span class=\"pl-pds\">\"</span></span> <span class=\"pl-e\">alt</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>Smiley face<span class=\"pl-pds\">\"</span></span> <span class=\"pl-e\">height</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>42<span class=\"pl-pds\">\"</span></span> <span class=\"pl-e\">width</span>=<span class=\"pl-s\"><span class=\"pl-pds\">\"</span>42<span class=\"pl-pds\">\"</span></span>&gt;\n        &lt;<span class=\"pl-ent\">p</span>&gt;Ini adalah gambar ayam&lt;/<span class=\"pl-ent\">p</span>&gt;\n    &lt;/<span class=\"pl-ent\">div</span>&gt;\n&lt;/<span class=\"pl-ent\">div</span>&gt;</pre>\n</div>\n<p>Anda bisa menggunakanÂ <em>selector</em>Â CSS untuk mengambil elemen image dengan cara seperti ini.</p>\n<div class=\"highlight highlight-source-ruby\">\n<pre>driver.find_element_by_css_selector(<span class=\"pl-s\"><span class=\"pl-pds\">'</span>#ayam_image<span class=\"pl-pds\">'</span></span>)</pre>\n</div>\n<p>Atau menggunakan XPath dengan cara berikut</p>\n<div class=\"highlight highlight-source-ruby\">\n<pre>driver.find_element_xpath(<span class=\"pl-pds\">'</span>//img<span class=\"pl-pds\">'</span>)</pre>\n</div>\n<p>Atau</p>\n<div class=\"highlight highlight-source-ruby\">\n<pre>driver.find_element(by=By.XPATH, value=<span class=\"pl-pds\">'</span>//*[@id=\"ayam_image\"]<span class=\"pl-pds\">'</span>)</pre>\n</div>\n<p>Â </p>\n<div class=\"highlight highlight-source-ruby\">Â </div>\n<p>Dan sebagainya ...</p>\n<p>Intinya,Â <em>XPath</em>Â menawarkan banyak metode alternatif untuk mencari suatu elemen pada halaman web.</p>\n<p>Materi mengenaiÂ <em>XPath</em>Â sendiri sangat luas, sehingga kamu bisa baca mengenai CSS lebih lanjutÂ <a href=\"https://www.w3schools.com/xml/xpath_intro.asp\" rel=\"nofollow\">disini</a>.</p>\n<h2 id=\"mcetoc_1e84lvv7e5\">Perbandingan CSS vs xPath</h2>\n<table>\n<thead>\n<tr>\n<th>XPath</th>\n<th>Css</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>//div/a</td>\n<td>div &gt; a</td>\n</tr>\n<tr>\n<td>//div//a</td>\n<td>div a</td>\n</tr>\n<tr>\n<td>//div[@id='example']</td>\n<td>#example</td>\n</tr>\n<tr>\n<td>//div[@class='example']</td>\n<td>.example</td>\n</tr>\n<tr>\n<td>//input[@id='username']/following-sibling::input[1]</td>\n<td>#username + input</td>\n</tr>\n<tr>\n<td>//input[@name='username']</td>\n<td>input[name='username']</td>\n</tr>\n<tr>\n<td>//input[@name='login'and @type='submit']</td>\n<td>input[name='login'][type='submit']</td>\n</tr>\n<tr>\n<td>a[contains(text(), 'Log out')]</td>\n<td>a:contains('Log Out')</td>\n</tr>\n<tr>\n<td>Â </td>\n<td>#recordlist li:nth-of-type(4)</td>\n</tr>\n<tr>\n<td>Â </td>\n<td>Â a[id^='id_prefix_']</td>\n</tr>\n<tr>\n<td>Â </td>\n<td>Â a[id$='_id_sufix']</td>\n</tr>\n<tr>\n<td>Â </td>\n<td>Â a[id*='id_pattern']</td>\n</tr>\n<tr>\n<td>Â </td>\n<td>Â </td>\n</tr>\n</tbody>\n</table>\n<p>Â </p>\n<p>Command yang dijalankan:<br><br></p>\n<table style=\"width: 681px;\">\n<tbody>\n<tr>\n<td style=\"width: 280.984px;\">âœ pipenv --three</td>\n<td style=\"width: 399.016px;\">Inisiasi directory sebagai virtual environment yang baru dengan python3</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ pipenv shell</td>\n<td style=\"width: 399.016px;\">mengaktivasi virtual environment</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ pip freeze</td>\n<td style=\"width: 399.016px;\">melihat daftar isi library yang sudah di terpasang di virtual environmentÂ </td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ pipenv install selenium</td>\n<td style=\"width: 399.016px;\">memasang library selenium</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ pipenv install pytest</td>\n<td style=\"width: 399.016px;\">memasang library pytest</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ chromedriver -v</td>\n<td style=\"width: 399.016px;\">cek versi chromedriver</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ python test_googling.py</td>\n<td style=\"width: 399.016px;\">menjalankan kode python</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ pytest</td>\n<td style=\"width: 399.016px;\">menjalankan module pytest di directory aktif</td>\n</tr>\n<tr>\n<td style=\"width: 280.984px;\">âœ pytest -s</td>\n<td style=\"width: 399.016px;\">menjalankan pytest disertai stdout untuk print console</td>\n</tr>\n</tbody>\n</table>\n<p>Â Link terkait:</p>\n<table style=\"width: 681px;\">\n<tbody>\n<tr>\n<td style=\"width: 339.984px;\"><a href=\"https://selenium-python.readthedocs.io\">https://selenium-python.readthedocs.io</a>Â </td>\n<td style=\"width: 340.016px;\">DokumentasiÂ library selenium pada python</td>\n</tr>\n<tr>\n<td style=\"width: 339.984px;\"><a href=\"https://docs.pytest.org/en/latest/\">https://docs.pytest.org/en/latest/</a>Â </td>\n<td style=\"width: 340.016px;\">Dokumentasi pytestÂ </td>\n</tr>\n<tr>\n<td style=\"width: 339.984px;\">Â </td>\n<td style=\"width: 340.016px;\">Â </td>\n</tr>\n</tbody>\n</table>\n<p>Â </p>\n<br>\n<p>Â </p>\n<p>Â </p>\n<p>Â </p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2020-05-12T22:03:25+07:00",
            "date_modified": "2020-05-19T23:59:00+07:00"
        },
        {
            "id": "https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/",
            "url": "https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/",
            "title": "Mau Belajar Automation Test dengan Python, Mulai Dari Mana?",
            "summary": "Halo Kawan! Dikesempatan kali ini saya akan bahas hal teknis yang berhubungan dengan pekerjaan sebagai Software Quality Assurance / Test Engineer yaitu membuat sebuah Test Automation Suite,Â saya akan membagikan pengetahuan dan pengalaman saya dalam merancang Automation test framework dengan python. Saya akan buat tulisan berseri&hellip;",
            "content_html": "<p>Halo Kawan!</p>\n<p>Dikesempatan kali ini saya akan bahas hal teknis yang berhubungan dengan pekerjaan sebagai <em>Software Quality Assurance</em> / <em>Test Engineer</em> yaitu membuat sebuah <em>Test Automation Suite</em>,Â saya akan membagikan pengetahuan dan pengalaman saya dalam merancang Automation test framework dengan python.</p>\n<p>Saya akan buat tulisan berseri terkait pemrograman <em>automation test</em> dengan python, nah sebagai permulaan, pada tulisan ini saya akan share sumber belajar python dari dasar yang dulu saya pelajari, semoga bisa berguna buat yang baru berkenalan dengan bahasa python ya.</p>\n<p>Nanti setelah dasar pemrograman python dikuasai, barulah kita akan langsung koding automation nya ya</p>\n<h2 id=\"mcetoc_1e7nsdtta3\">Kenapa Python?</h2>\n<p>Karena menulis automation code dengan python menurut saya sangat mudah sekali, dan secara bahasa pemrograman, python itu termasuk mudah untuk dipelajari dan code yang dihasilkan sangat enak untuk dibaca, jadi sebagai entry barrier nya rendah bagi seorang QA manual untuk mulai terjun di koding automation (walaupun tools lain yang ga perlu koding juga ada sih ğŸ¤£)</p>\n<h2 id=\"mcetoc_1e7nsonlk4\">Yuk kita Mulai Belajar Pemrograman Python</h2>\n<p>Walaupun ingin, sepertinya saya kurang mahir dalam menjelaskan pemrograman python dengan baik, karena saya sendiri pun tidak terlalu mahir, hehe tapi santai saja, keahlian koding yang dibutuhkan untuk menulis automation test itu tidak terlalu kompleks kok, jadi bisa langsung sambil di praktekan ya.</p>\n<p>Ok, berikut ini adalah sumber pembelajaran python yang sudah saya coba dan menjadi rekomendasi utama, terutama karena gratis dan mudah dipahami,Â saya bagi kedalam beberapa kategori ya sesuai dengan gaya belajar kita yang berbeda, ada yang sukanya audio visual, ada yang lebih suka belajar dengan membaca, atau ada yang paling seneng kalo langsung praktek.</p>\n<h2 id=\"mcetoc_1e7ns8n9b0\">Belajar Python Melalui Video</h2>\n<p>Hari gini banyak video tutorial gratis di youtube, saking banyaknya mungkin kalian akan menemukan video tutorial yang jumlahnya sangat banyak, berikut ini adalah beberapa video yang sudah saya tonton dan isinya sangat bermutu, jadi akan menghemat waktu kalian memilih video mana yang akan ditonton ya</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/zpeWE1utrWM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>dengan playlist lengkap dari sekolah koding di:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/playlist?list=PLCZlgfAG0GXDc9Wcsi2fUn0pAr41GDL6m\" target=\"_blank\" rel=\"noopener noreferrer\">Tutorial Python Bahasa Indonesia</a></li>\n<li><a href=\"https://www.youtube.com/playlist?list=PLCZlgfAG0GXC-N-MlNJoG3Jh8nhXHTT6s\" target=\"_blank\" rel=\"noopener noreferrer\">Belajar OOP (object oriented programming) dengan Python</a></li>\n</ul>\n<p>Disini juga lumayan lengkap dari pengenalan pemrograman bahkan</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/fBkeaYZ99iY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe>Â </p>\n<p>Dan aplikasi pembelajaran koding ini juga bagus loh</p>\n<figure class=\"post__image post__image\" ><img src=\"https://fachrul.id/media/posts/31/belajar-koding-python-di-kode-id.png\" alt=\"\" width=\"800\" height=\"863\">\n<figcaption >Kelas pemrograman gratis dari Kode.id</figcaption>\n</figure>\n<p>Dengan link nya sebagai berikut <a href=\"https://kode.id/kelas/pengenalan-bahasa-pemrograman-python/\" target=\"_blank\" rel=\"noopener noreferrer\">https://kode.id/kelas/pengenalan-bahasa-pemrograman-python/</a>Â ,Â bisa diakses melalui browser komputer ataupun aplikasi mobile nya juga lohÂ </p>\n<h2 id=\"mcetoc_1e7ns9skn1\">Belajar Python Melalui Buku</h2>\n<p>Berikut ini adalah sumber belajar bacaan (buku ataupun web, ya kan dibaca juga ğŸ˜…)</p>\n<h3 id=\"mcetoc_1e7nv1kr75\">BelajarPython.com</h3>\n<p>Kamu bisa akses di halamanÂ <a href=\"https://belajarpython.com/tutorial/apa-itu-python\" target=\"_blank\" rel=\"noopener noreferrer\">https://belajarpython.com</a>Â disana kamu bisa menemukan tutorial python dengan pembahasan yang mudah dimengerti</p>\n<p><img class=\"post__image--center\" src=\"https://fachrul.id/media/posts/31/Screen-Shot-2020-05-07-at-23.20.31.png\" alt=\"\" width=\"750\" height=\"974\"></p>\n<h3 id=\"mcetoc_1e7nv646u7\">Workshop Python 101</h3>\n<p>Modul untuk workshop python, bisa kamu akses diÂ <a href=\"https://sakti.github.io/python101/index.html\">https://sakti.github.io/python101/index.html</a> kamu ikutin sendiri kok, tapi bahasannya menggunakan python versi 2.7 dimana sekarang ini sudah ketinggalan (walau masih bisa) dan direkomendasikan untuk menggunakan python versi 3Â </p>\n<h3 id=\"mcetoc_1e7nv4kpe6\">GoalKicker</h3>\n<p>Buku ini salah satu rekomendasi saya untuk belajar python dengan cepat, karena disana ga terlalu banyak basa-basi dan langsung ditunjukan contoh kode nya, bisa diunduh di link <a href=\"https://goalkicker.com/PythonBook/\" target=\"_blank\" rel=\"noopener noreferrer\">https://goalkicker.com/PythonBook/</a></p>\n<p><a href=\"https://goalkicker.com/PythonBook/\"><img class=\"post__image--center\" src=\"https://fachrul.id/media/posts/31/Screen-Shot-2020-05-07-at-23.14.57.png\" width=\"340\" height=\"490\"></a></p>\n<p>Buku python lainnya bisa diakses di:Â <a href=\"https://pythonbooks.revolunet.com/\">https://pythonbooks.revolunet.com/</a></p>\n<h2 id=\"mcetoc_1e7nvl66aa\">Â </h2>\n<h2 id=\"mcetoc_1e7ns9uql2\">Belajar Python Dengan Praktek</h2>\n<p>Nah bagi kalian yang pengennya langsung praktek ngerjain kode bisa dicoba cara berikut ini</p>\n<h3 id=\"mcetoc_1e7nvdpod8\">Python Koans</h3>\n<p>Nah Koans adalah metode pembelajaran interaktif dengan langsung menjalankan kodenya, jadi kamu tinggal clone repositoryÂ Â <a href=\"https://github.com/gregmalcolm/python_koans\">https://github.com/gregmalcolm/python_koans</a>Â lalu jalankan kodenya, dan perbaiki yang salah, bisa di baca juga struktur kodenya langsung</p>\n<h3 id=\"mcetoc_1e7nviakg9\">SoloLearn</h3>\n<p>Enaknya belajar di soloLearn adalah bisa dimana aja, web bisa mobile phone juga bisa, bentuknya seperti kuis interaktifÂ <a href=\"https://www.sololearn.com/Course/Python/\">https://www.sololearn.com/Course/Python/</a></p>\n<h4 id=\"mcetoc_1e7o0jj190\">Â PyCharm Edu</h4>\n<p>Ini favorit saya, karena embeded di IDE nya python yaitu PyCharm, kita tinggal mengaktifkannya dari <a href=\"https://www.jetbrains.com/education/download/\" target=\"_blank\" rel=\"noopener noreferrer\">Pycharm Edu</a> (ini IDE python gratis loh, dan sangat mumpuni) silahkan unduh Pycharm Edu gratis disini <a href=\"https://www.jetbrains.com/education/download/\" target=\"_blank\" rel=\"noopener noreferrer\">https://www.jetbrains.com/education/download/</a>Â lalu install \"EduTools Plugin\" nya juga ya untuk mengaktifkan menu Academy seperti berikut</p>\n<p><img class=\"post__image--center\" src=\"https://fachrul.id/media/posts/31/Screen-Shot-2020-05-07-at-23.47.10.png\" width=\"600\" height=\"996\"></p>\n<p>Info lebih lanjut bisa cekidot ini yaÂ <a href=\"https://hyperskill.org/onboarding?track=python\" target=\"_blank\" rel=\"noopener noreferrer\">https://hyperskill.org/onboarding?track=python</a></p>\n<p>Â </p>\n<h2 id=\"mcetoc_1e7o0rrqg1\">Penutup</h2>\n<p>Ternyata lumayan banyak juga ya sumber belajar python nya, semoga kalian bisa mengikuti salah satunya dengan tuntas ya ğŸ¤£</p>\n<p>Oke di kesempatan berikutnya kita akan langsung mulai belajar automation test dengan python nya ya, untuk sementara ini mulailah dengan memahami bahasa pemrograman Python.. Sekian</p>\n<hr>\n<p>Post ini merupakan rangkaian post mengenai membuat automationt test dengan python</p>\n<h4 id=\"mcetoc_1e8mtsf4p6\">Daftar isinya:</h4>\n<ol>\n<li><a href=\"https://fachrul.id/mau-belajar-automation-test-dengan-python-mulai-dari-mana/\" target=\"_blank\" rel=\"noopener noreferrer\">Belajar Python dari dasar</a>Â &lt;== Sekarang disini</li>\n<li><a href=\"https://fachrul.id/belajar-pytest-framework-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Memahami cara kerja Pytest (bagian 1)</a>Â </li>\n<li><a href=\"https://fachrul.id/memulai-automation-test-selenium-python-bagian-1/\" target=\"_blank\" rel=\"noopener noreferrer\">Mulai membuat automation test dengan Selenium</a>Â Â </li>\n<li><a href=\"https://fachrul.id/selector-locator-strategy-yang-baik/\" target=\"_blank\" rel=\"noopener noreferrer\">Menemukan Element dengan locator strategi yang baik</a>Â </li>\n</ol>\n<hr>\n<p>Â </p>",
            "image": "https://fachrul.id/media/posts/31/belajar-python.jpg",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2020-05-08T00:07:20+07:00",
            "date_modified": "2020-05-19T23:59:51+07:00"
        },
        {
            "id": "https://fachrul.id/catat-ini-berbagai-command-adb-yang-berguna-untuk-automation-tester/",
            "url": "https://fachrul.id/catat-ini-berbagai-command-adb-yang-berguna-untuk-automation-tester/",
            "title": "Catat ini! berbagai command ADB yang berguna untuk automation tester",
            "summary": "Hallo Para Penguji Aplikasi Digital! Pada saat saya mengembangkan kode automation untuk android, seringkali saya menemukan command penting dan berguna dalam membantu automation code saya dan saya simpan di snippet microsoft oneNote, dan setelah dipikir-pikir sangat mubazir kalo catatan itu saya simpan sendiri, jadi pada&hellip;",
            "content_html": "<p>Hallo Para Penguji Aplikasi Digital!</p>\n<p>Pada saat saya mengembangkan kode automation untuk android, seringkali saya menemukan command penting dan berguna dalam membantu automation code saya dan saya simpan di snippet microsoft oneNote, dan setelah dipikir-pikir sangat mubazir kalo catatan itu saya simpan sendiri, jadi pada kesempatan kali ini akan saya tuliskan disini command Android Debug Bridge (ADB) apa saja yang bisa membantu pengujian kita</p>\n<h2 id=\"mcetoc_1e6qomc7p0\">Buka kunci Ponsel</h2>\n<pre><code class=\"language-bash\">adb shell input keyevent  # idupin HP<br>adb shell input text yourpasscode  # Masukin PIN <br>adb shell input keyevent KEYCODE_ENTER   # tekan enter</code></pre>\n<h2 id=\"mcetoc_1e6qomfjh1\">Toggle status bar</h2>\n<pre><code class=\"language-bash\">#pull status bar\nadb shell service call statusbar 1\n#collapse status bar\nadb shell service call statusbar 2</code></pre>\n<h2 id=\"mcetoc_1e6qomirn2\">Buka/tutup app</h2>\n<pre><code class=\"language-bash\">#open app : <br>adb shell monkey -p id.fachrul.packagename 1\n<br># Open gmail <br>adb shell monkey -p com.google.android.gm 1\n#close app :<br>adb shell am force-stop packagename\n# Close gmail \nadb shell am force-stop com.google.android.gm</code></pre>\n<h2 id=\"mcetoc_1e6qommh03\">Â Tap di aplikasi</h2>\n<pre><code class=\"language-shell\">adb shell input tap x y</code></pre>\n<p>nah `x y` itu koordinat sumbu X dan Y, gimana cara dapetinnya?</p>\n<pre><code class=\"language-shell language-shell-session\"># dump the current screen ui</code><br><code class=\"language-shell language-shell-session\">adb shell uiautomator dump</code><br><code class=\"language-shell language-shell-session\"># copy the xml file to computer </code><br><code class=\"language-shell language-shell-session\">adb pull sdcard/window_dump.xml ~/Desktop/</code><br><code class=\"language-shell language-shell-session\"># atau gini juga bisa</code><br><code class=\"language-shell language-shell-session\">adb pull $(adb shell uiautomator dump | grep -oP '[^ ]+.xml') /sdcard/window_dump.xml</code></pre>\n<p>trus cek attribut \"bounds\" di element yang kita mau buat dapetin koordinatnya, hint: bisa juga sih dapetin koordinat dari uiautomatorviewer :D</p>\n<h2 id=\"mcetoc_1e6qomqn04\">Install aplikasi langsung</h2>\n<pre><code class=\"language-shell\">adb install -r namafile.apk</code></pre>\n<p>bisa ditambahin argument</p>\n<pre><code class=\"language-shell\">adb -d = untuk device, <br>adb -e = utk emulator, <br>adb -s = untuk ke serial number tertentu<br></code></pre>\n<p>atau klo mau sekaligus install apk di banyak devicesÂ </p>\n<pre><code class=\"language-shell\">alias apkinstall=\"adb devices | tail -n +2 | cut -sf 1 | xargs -I X adb -s X install -r $1\"</code><br><br><code class=\"language-shell\"># Penggunaannya Install an apk on all devices</code><br><code class=\"language-shell\">apkinstall ~/Downloads/MyAppRelease.apkÂ  <br><br># atau klo cuma mau copy files apk nya doank<br>adb push &lt;lokasi file path&gt; /sdcard/<br></code></pre>\n<h2 id=\"mcetoc_1e6qon7gl5\">Hapus aplikasi</h2>\n<pre><code class=\"language-shell-session\">adb shell pm uninstall com.example.MyApp     <br>adb shell pm clear id.fachrul.package // Deletes all data associated with a package.</code></pre>\n<p>Â </p>\n<h2 id=\"mcetoc_1e6qonajm6\">Buka aktivity langsung</h2>\n<pre><code class=\"language-shell-session\">adb shell am start -W -n com.gojek.life/com.gojek.golife.presentation.feature.LifeSplashActivity -S -a android.intent.action.MAIN -c android.intent.category.LAUNCHER -f 0x10200000</code></pre>\n<p>Apa nama activity sekarang ini (lagi dibuka/focus)</p>\n<pre><code class=\"language-shell-session\">adb shell dumpsys window windows | grep -E 'mCurrentFocus|mFocusedApp'</code>Â </pre>\n<h2 id=\"mcetoc_1e6qonf7v7\">Monkey test</h2>\n<pre><code class=\"language-shell\">adb shell monkey -p &lt;nama package&gt; -v --pct-syskeys 0 3000</code><br><br><code class=\"language-shell\">adb shell monkey -p com.myAppPackage -v 10000 -s 100 // monkey tool is generating 10.000 random events on the real device</code></pre>\n<h2 id=\"mcetoc_1e6qonlc38\">Filter adb log dengan lebih indah</h2>\n<pre><code class=\"language-shell\">pidcat &lt;nama package&gt;</code></pre>\n<p>nah pidcat ini adalah aplikasi tambahan based on python script, bisa di install mengikuti petunjuk <a href=\"https://github.com/JakeWharton/pidcat/blob/master/README.md\" target=\"_blank\" rel=\"noopener noreferrer\">disini</a>Â </p>\n<h2 id=\"mcetoc_1e6qonotm9\">Hapus log device</h2>\n<pre><code class=\"language-shell\">adb logcat -c</code></pre>\n<h2 id=\"mcetoc_1e6qonu54a\">Ambil bug report berupa informasi dari device, dumpstate, dumpsys dan logcat output</h2>\n<pre><code class=\"language-css language-javascript language-shell\">adb bugreport &gt; path_file_nya<br>adb logcat -b crashÂ <br></code></pre>\n<h2 id=\"mcetoc_1eajnp4n81\">Ambil screenshoot</h2>\n<pre class=\"wp-block-code\">adb exec-out screencap -p &gt; &lt;nama_sshot&gt;.png</pre>\n<h2 id=\"mcetoc_1eajnp4s92\">Â </h2>\n<h2 id=\"mcetoc_1e6qoo9omc\">Open deeplink</h2>\n<p><code class=\"language-shell\">adb shell am start -a android.intent.action.VIEW -d \"schema://link\"</code></p>\n<h2 id=\"mcetoc_1e6qood6ad\">Reset permissions</h2>\n<pre><code class=\"language-shell\">adb shell pm reset-permissions -p your.app.package</code></pre>\n<h2 id=\"mcetoc_1e6qoog3me\">Kasih permission</h2>\n<pre><code class=\"language-shell-session\">adb shell pmÂ grantÂ your.app.package</code></pre>\n<h2 id=\"mcetoc_1e6qoomaof\">Key event</h2>\n<pre><code class=\"language-shell-session\">adb shell input keyevent 3 // Home btn<br>adb shell input keyevent 4 // Back btn<br><br>adb shell input keyevent 5 // Call<br><br>adb shell input keyevent 6 // End call<br><br>adb shell input keyevent 26Â  // Turn Android device ON and OFF. It will toggle device to on/off status.<br><br>adb shell input keyevent 27 // Camera<br><br>adb shell input keyevent 64 // Open browser<br><br>adb shell input keyevent 66 // Enter<br><br>adb shell input keyevent 67 // Delete (backspace)<br><br>adb shell input keyevent 207 // Contacts<br><br>adb shell input keyevent 220 / 221 // Brightness down/up<br><br>adb shell input keyevent 277 / 278 /279 // Cut/Copy/Paste<br><br>// https://developer.android.com/reference/android/view/KeyEvent.html<br><br><br></code></pre>\n<p><code></code>AmbilÂ serial dariÂ connected device</p>\n<pre><code class=\"language-shell-session\">adb devices | tail -n +2</code>Â </pre>\n<h2 id=\"mcetoc_1eajnnqvv0\">Emulator</h2>\n<pre class=\"wp-block-code\">emulator -avd &lt;nama emulatornya&gt; -netdelay none -netspeed fullÂ </pre>\n<h2 id=\"mcetoc_1eajnrqt03\">Â Cara menampilkan screen android di Windows/mac/linux (cocok buat presentasi)</h2>\n<p>Bisa menggunakan aplikasi <a href=\"https://github.com/Genymobile/scrcpy\" target=\"_blank\" rel=\"noopener noreferrer\">Scrcpy</a>Â aplikasi ini open source jadi bisa menjadi alternatif kamu yang biasa menggunakan Vysor, klo pake mac bisa langsung instal via `brew install scrcpy` trus jalanin nya tinggal jalanin command `scrcpy` atau klo mau lihat dia bisa ngapain aja bisa cekidot `scrcpy --help`</p>\n<pre>scrcpy --help<br># mulai mirroring android, tapi tampilin juga lokasi sentuhan<br>scrcpy -t<br># mirroring android sambil direkam<br>scrcpy -r coba_health.mp4<br># klo ada lebih dari satu, bisa konek sesuai dengan serial device nya<br>scrcpy -s serial_1234<br><br></pre>",
            "image": "https://fachrul.id/media/posts/30/ADB.png",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2020-04-27T15:24:00+07:00",
            "date_modified": "2020-06-12T14:51:23+07:00"
        }
    ]
}
