{
    "version": "https://jsonfeed.org/version/1",
    "title": "Catatan celoteh @FachrulCH",
    "description": "",
    "home_page_url": "https://fachrul.id",
    "feed_url": "https://fachrul.id/feed.json",
    "user_comment": "",
    "icon": "https://fachrul.id/media/website/profile-newletter-3.png",
    "author": {
        "name": "Fachrul Choliluddin"
    },
    "items": [
        {
            "id": "https://fachrul.id/selintas-2023/",
            "url": "https://fachrul.id/selintas-2023/",
            "title": "Selintas 2023",
            "summary": "Post ini tidak berisi tutorial software testing, juga bukan hal inspiratif yang bisa diambil oleh kamu, ini hanyalah tulisan yang mengakomodasi penyaluran dari pikiran yang seharian ini menyelimuti saya, dan pesan untuk saya di masa depan, semua tulisan ini sebenernya adalah monolog saya sendiri Awal&hellip;",
            "content_html": "<p>Post ini tidak berisi tutorial software testing, juga bukan hal inspiratif yang bisa diambil oleh kamu, ini hanyalah tulisan yang mengakomodasi penyaluran dari pikiran yang seharian ini menyelimuti saya, dan pesan untuk saya di masa depan, semua tulisan ini sebenernya adalah monolog saya sendiri</p>\n<p>Awal tahun 2024, hari pertama.</p>\n<p>Seperti orang lain lakukan, dan yang sudah-sudah dahulu saya jalankan. Retrospeksi 2023 saya coba fikirkan, baik dan buruk kejadian selama tahun 2023 ini membuat saya sedih dan bahagia, tapi sangat disayangkan di pertengahan tahun 2023 ini saya sedikit sekali membuat konten, bukan karena sibuk bekerja, tapi terlalu sibuk main FIFA &gt;_&lt;</p>\n<p><strong>Alhamdulillah, Apa yang berjalan baik:</strong></p>\n<ul>\n<li><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Quality time bersama keluarga</span></li>\n<li><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Rutin Pulang Dubai-Jakarta</span></li>\n<li>\n<div>Rekreasi bersama keluarga &amp; teman</div>\n<div>Â </div>\n<div>Â </div>\n</li>\n<li>\n<div>Ikut acara startup award (perusahaan menang startup of the year timur tengah 2023)</div>\n<div>Â </div>\n</li>\n<li>\n<div>Memiliki sahabat dekat baru</div>\n</li>\n</ul>\n<p><strong>Komplain pribadi:</strong></p>\n<ul>\n<li>Kurang tepat waktu</li>\n<li><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Harusnya mulai serius belajar bahasa arab, mumpung bisa praktek langsung</span></li>\n<li>Terlalu banyak main game FIFA</li>\n<li>Baca buku banyak tapi ga ada yang tuntas</li>\n<li>Optimis berlebihan itu racun</li>\n<li>Mumpung kepikiran itu sebaiknya ga langsung dikerjain, catat/rekam dan prioritaskan</li>\n<li>Katanya sibuk, tapi masi bisa disempetin maen game</li>\n<li>Catat ilmu dengan menulis, yang dikerjain minggu lalu aja sering lupa, apalagi ilmu baru</li>\n<li>Subscribe course banyak, tapi banyak yang ga dilahap abis ilmunya</li>\n<li>Ngapain di budgetin (waktu/financial) kalo sering over spending tanpa konsekuensi</li>\n</ul>\n<p><strong>Action item:</strong></p>\n<ul>\n<li>Muhasabah diri setiap minggu</li>\n<li>Implementasi skill baru:\n<ul>\n<li>Catat</li>\n<li>PDCA</li>\n<li>Breakdown, jangan terlalu ngawang-ngawang</li>\n<li>non teknis: bisnis/people skill</li>\n</ul>\n</li>\n</ul>\n<p>Bagusnya review kehidupan tuh ga tahunan, tapi bulanan/mingguan biar ga terlambat perbaikan diri nya, cuma alesan aja sebenernya klo bilang sibuk, lebih ga taruh di prioritas yang mendesak</p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
                   "opinion"
            ],
            "date_published": "2024-01-01T20:19:51+04:00",
            "date_modified": "2024-01-01T20:19:51+04:00"
        },
        {
            "id": "https://fachrul.id/menjaga-hubungan-baik-dengan-developer/",
            "url": "https://fachrul.id/menjaga-hubungan-baik-dengan-developer/",
            "title": "Menjaga Hubungan Baik dengan Developer",
            "summary": "Bekerja sebagai QA memang terkadang menantang, terutama ketika harus melaporkan kesalahan atau bug ke tim developer. Berikut adalah beberapa tips untuk membangun hubungan kerja yang baik dengan developer dan membuat proses ini menjadi lebih mudah: Penting untuk menjaga komunikasi yang baik dengan Developer. Kamu harus&hellip;",
            "content_html": "<p>Bekerja sebagai QA memang terkadang menantang, terutama ketika harus melaporkan kesalahan atau bug ke tim developer.Â </p>\n<p>Berikut adalah beberapa tips untuk membangun hubungan kerja yang baik dengan developer dan membuat proses ini menjadi lebih mudah:</p>\n<h3>1. Komunikasi yang Jelas dan Profesional</h3>\n<p>Penting untuk menjaga komunikasi yang baik dengan Developer. Kamu harus sampaikan informasi dengan jelas dan jangan ragu untuk bertanya jika ada hal yang tidak jelas. Pastikan bahwa komunikasimu selalu jelas, profesional, dan berorientasi pada solusi.Â </p>\n<p>Gunakan bahasa yang netral dan fokus pada fakta ketika melaporkan bug, bukan menyalahkan individu.</p>\n<p>Pelajari juga bahasa teknis, biar ngobrol sama developer bisa lebih nyambung. Gunakan bahasa yang sederhana dan mudah dipahami agar pesan Anda dapat disampaikan dengan jelas.</p>\n<h3>2. Pahami Perspektif Developer</h3>\n<p>Cobalah untuk memahami perspektif developer dan tantangan yang mereka hadapi. Ini akan membantu kamu untuk berkomunikasi dengan lebih efektif dan menunjukkan empati. Apalagi kalo dapet bugs yang susah banget.</p>\n<h3>3. Berikan Feedback yang Konstruktif</h3>\n<p>Jika kamu menemukan bug, berikan feedback yang konstruktif dan bantu mencari solusinya. Hal ini akan dihargai oleh tim developer dan membantu membangun hubungan kerja yang positif.</p>\n<figure class=\"image\"><img loading=\"lazy\" src=\"https://assets.karyakarsa.com/post-image-647cc7eb3e62b.jpg\" data-is-external-image=\"true\"></figure>\n<h3>4. Apresiasi Kerja Mereka</h3>\n<p>Hargai kerja keras tim developer. Jika mereka telah melakukan pekerjaan yang baik atau memperbaiki bug dengan cepat, berikan mereka pujian. Ini akan membangun suasana kerja yang positif dan mempererat hubungan antara QA dan developer.</p>\n<h3>5. Jadilah Tim</h3>\n<p>Ingatlah bahwa kamu dan developer adalah bagian dari tim yang sama dan tujuannya adalah untuk menciptakan produk yang berkualitas. Jangan melihat diri kamu sebagai \"polisi kode\", tapi sebagai partner yang membantu memastikan kualitas produk.</p>\n<h3>6. Lakukan Sosialisasi</h3>\n<p>Mencoba untuk berinteraksi dengan tim developer di luar lingkungan kerja, misalnya makan siang bersama atau kegiatan tim lainnya, bisa membantu membangun hubungan yang lebih baik dan membuatmu merasa lebih nyaman untuk melaporkan masalah.</p>\n<p>Ingatlah bahwa tujuan utama QA adalah untuk membantu meningkatkan kualitas produk, bukan untuk menunjuk kesalahan. Dengan pendekatan yang tepat, kamu bisa membangun hubungan kerja yang efektif dengan tim developer dan bekerja sama untuk mencapai tujuan bersama.</p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2023-11-05T14:55:53+04:00",
            "date_modified": "2023-11-05T14:55:53+04:00"
        },
        {
            "id": "https://fachrul.id/lanjutan-morning-check-buat-software-tester/",
            "url": "https://fachrul.id/lanjutan-morning-check-buat-software-tester/",
            "title": "Lanjutan: Morning Check buat Software Tester",
            "summary": "<p>Menyambung pembahasan lebih lanjut dari materi sebelumnya tentang <a href=\"https://fachrul.id/cem-mana-keseharian-menjadi-software-tester-itu-sih/\" target=\"_blank\" rel=\"noopener noreferrer\">keseharian menjadi software tester</a></p>\n<p>Sure, ayo kita bahas lebih dalam soal \"morning check\" dalam dunia Quality Assurance (QA)!<br>Morning check, atau yang bisa kita sebut \"cek pagi\", biasanya adalah langkah pertama yang dilakukan oleh seorang QA saat memulai hari kerjanya. Apa aja sih yang biasanya diperiksa dalam morning check ini?<br>Â </p>\n",
            "content_html": "<p>Menyambung pembahasan lebih lanjut dari materi sebelumnya tentang <a href=\"https://fachrul.id/cem-mana-keseharian-menjadi-software-tester-itu-sih/\" target=\"_blank\" rel=\"noopener noreferrer\">keseharian menjadi software tester</a></p>\n<p>Sure, ayo kita bahas lebih dalam soal \"morning check\" dalam dunia Quality Assurance (QA)!<br>Morning check, atau yang bisa kita sebut \"cek pagi\", biasanya adalah langkah pertama yang dilakukan oleh seorang QA saat memulai hari kerjanya. Apa aja sih yang biasanya diperiksa dalam morning check ini?<br>Â </p>\n\n<h3>1. Melihat Email<br>Â </h3>\n<p>Pagi hari adalah waktu yang pas buat memeriksa email atau slack kantor. Mungkin ada update dari tim developer, laporan production bug baru dari user atau anggota tim lainnya, atau mungkin saja ada email penting lain yang berkaitan dengan proyek yang sedang dikerjakan.Â </p>\n<p>Intinya, memeriksa email ini buat memastikan kamu nggak ketinggalan info penting apa pun.</p>\n<h3><br>2. Memeriksa Update Laporan Bug<br>Â </h3>\n<p>Kalau tim kamu menggunakan alat pelaporan bug seperti JIRA, Bugzilla, atau Trello, morning check adalah waktu yang baik buat cek apakah ada laporan bug baru dari tim QA lain,, atau mungkin update tentang bug yang kemarin sudah kamu laporin.Â </p>\n<p>Lagi-lagi, ini buat memastikan kamu selalu up to date dengan progress sprint, karena biasanya tiap pagi kan akan ada Daily Standup Meeting.</p>\n<figure class=\"image\"><img loading=\"lazy\" src=\"https://assets.karyakarsa.com/post-image-647cc187a3b7a.jpg\" data-is-external-image=\"true\"></figure>\n<h3><br>3. Melihat Progress dan Task Hari Itu<br>Â </h3>\n<p>Setelah mengecek email dan alat pelaporan bug, biasanya QA akan melihat progress proyek secara keseluruhan dan apa saja task atau tugas yang harus dikerjakan hari itu, tiket apa aja yang udah pindah ke kolom <i>ready for testing</i>. Mungkin hari ini ada pengujian fungsional yang harus dilakukan, atau mungkin ada meeting dengan tim developer buat bahas rencana pengembangan fitur baru.</p>\n<h3><br>4. Membuat Rencana Kerja<br>Â </h3>\n<p>Setelah tahu apa saja yang harus dilakukan hari itu, QA biasanya akan membuat rencana kerja atau to-do list. Ini bisa membantu memprioritaskan tugas-tugas dan memastikan bahwa semua tugas penting dapat diselesaikan dengan efisien.</p>\n<p><br>Jadi, intinya morning check ini adalah proses persiapan dan perencanaan untuk memastikan hari kerja berjalan dengan lancar. Semacam ritual pagi yang membantu QA tetap terorganisir dan efisien dalam mengerjakan tugas-tugasnya.Â </p>\n<p>Cukup menarik, bukan? Siapa tahu, kamu juga mau coba menerapkan ritual pagi ini dalam pekerjaanmu!<br>Â </p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2023-11-05T14:54:43+04:00",
            "date_modified": "2023-11-05T14:54:43+04:00"
        },
        {
            "id": "https://fachrul.id/cem-mana-keseharian-menjadi-software-tester-itu-sih/",
            "url": "https://fachrul.id/cem-mana-keseharian-menjadi-software-tester-itu-sih/",
            "title": "Cem mana keseharian menjadi Software Tester itu sih?",
            "summary": "<p>Halo, sobat teknologi!Â </p>\n<p>Kayaknya banyak yang penasaran nih sama kerjaan sebagai Quality Assurance atau biasa disebut QA.Â </p>\n<p>Apa sih yang biasa dilakukan seorang QA dalam sehari-hari? Kok rasanya serem ya, kayak detektif yang mencari-cari kesalahan? Yuk, kita kupas tuntas cerita hidupnya QA!<br>Â </p>\n",
            "content_html": "<p>Halo, sobat teknologi!Â </p>\n<p>Kayaknya banyak yang penasaran nih sama kerjaan sebagai Quality Assurance atau biasa disebut QA.Â </p>\n<p>Apa sih yang biasa dilakukan seorang QA dalam sehari-hari? Kok rasanya serem ya, kayak detektif yang mencari-cari kesalahan? Yuk, kita kupas tuntas cerita hidupnya QA!<br>Â </p>\n\n<figure class=\"image image-style-align-center\"><img loading=\"lazy\" src=\"https://assets.karyakarsa.com/post-image-647c65b68c1cf.jpg\" data-is-external-image=\"true\"></figure>\n<h3>Morning Check<br>Â </h3>\n<p>Pagi-pagi, biasanya QA akan melakukan morning check, alias mengecek slack/email atau tools pelaporan bug seperti JIRA atau report test automation, buat lihat ada laporan bug baru atau nggak. Atau mungkin ada update dari tim developer soal perbaikan bug yang kemarin dilaporkan.Â </p>\n<p>Intinya, morning check ini buat update status proyek dan siapkan diri buat aktivitas yang bakal dihadapi hari itu (dan modal update di daily standup meeting)</p>\n<h3><br>Pengujian, Pengujian, dan Pengujian<br>Â </h3>\n<p>Setelah morning check, biasanya QA akan langsung masuk ke aktivitas utamanya: testing atau pengujian. Ada berbagai macam pengujian yang biasanya dilakukan, mulai dari pengujian fungsional (apakah fitur A, B, C berfungsi dengan baik?), pengujian non-fungsional (bagaimana performa dan keamanannya?), sampai pengujian regresi (setelah bug diperbaiki, apakah ada fitur lain yang jadi terganggu?). Sering juga, pengujian ini dilakukan secara manual dan otomatis.Â </p>\n<p>Pengujian manual biasanya dilakukan untuk melihat pengalaman pengguna secara langsung, istilahnya exploratory testing, sedangkan pengujian otomatis biasanya dilakukan dengan alat atau software khusus macam selenium/appium/API test gitu, buat cek fungsi-fungsi tertentu secara cepat dan efisien, jadi nanti kelar ngejalanin testnya bisa di lihat apakah fitur baru ini bikin error di module lain nggaknya</p>\n<h3><br>Laporan Bug<br>Â </h3>\n<p>Nah, kalau dalam pengujian tadi ditemukan bug atau masalah, QA harus melaporkannya ke tim developer. Biasanya, laporan ini dilakukan dengan cara yang sistematis dan detail, mulai dari menjelaskan bug yang ditemukan, langkah-langkah untuk mereproduksi bug tersebut, hingga memberikan screenshot atau video sebagai bukti.</p>\n<h3>Diskusi dan Meeting</h3>\n<p>Selain pengujian dan pelaporan, dalam kesehariannya, QA juga sering kali melakukan diskusi dan pembahasan dengan tim developer dan stakeholder lainnya. Misalnya, membahas fitur baru yang akan dikembangkan, memberikan masukan terkait user experience, atau mungkin melakukan review terhadap bug yang sudah diperbaiki.<br>Â </p>\n<h3>Selalu Belajar dan Update<br>Â </h3>\n<p>Dalam dunia yang selalu berubah seperti teknologi, seorang QA juga harus selalu belajar dan update pengetahuan. Misalnya belajar teknik pengujian baru, belajar menggunakan tools pengujian yang baru, atau mungkin belajar tentang tren dan perkembangan teknologi terkini.</p>\n<p><br>Intinya mah menjadi QA itu seru dan penuh tantangan. Kamu harus jeli dan teliti, tapi juga harus bisa bekerja sama dengan tim dan terus belajar. Tapi percaya deh, rasanya puas banget kalau bisa membantu menciptakan software yang bebas dari bug dan nyaman digunakan pengguna. Jadi, siapa nih yang tertarik jadi QA?<br>Â </p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2023-11-05T14:51:37+04:00",
            "date_modified": "2023-11-05T14:51:37+04:00"
        },
        {
            "id": "https://fachrul.id/9-hal-penting-untuk-dikuasai-software-tester-quality-assurance/",
            "url": "https://fachrul.id/9-hal-penting-untuk-dikuasai-software-tester-quality-assurance/",
            "title": "9 Hal Penting untuk Dikuasai Software Tester (Quality Assurance)",
            "summary": "1. Pemahaman Dasar tentang Perangkat Lunak Untuk menjadi Software Tester handal, kamu harus memahami gimana cara kerja aplikasi digital (Web, Android, iOS, API). Ditambah juga harus ngerti konsep dasar pemrograman, struktur data, dan algoritma itu penting banget loh. Memang kamu ga mesti paham sedalam Developernya&hellip;",
            "content_html": "<h3>1. Pemahaman Dasar tentang Perangkat Lunak</h3>\n<p>Untuk menjadi Software Tester handal, kamu harus memahami gimana cara kerja aplikasi digital (Web, Android, iOS, API).Â </p>\n<p>Ditambah juga harus ngerti konsep dasar pemrograman, struktur data, dan algoritma itu penting banget loh. Memang kamu ga mesti paham sedalam Developernya (programmer), cukup punya pemahaman dasar cara bikin aplikasinya, cara kerja aplikasi, cara deploy/compile, tentu akan sangat membantu kamu memahami dan menemukan bug dalam aplikasi yang diuji.</p>\n<h3><br>2. Metodologi Pengujian Software</h3>\n<p>Pelajari berbagai teknik dan jenis pengujian software, seperti metode pengujian fungsional, pengujian non-fungsional (performa, keamanan, usability), pengujian regresi, dan test automation.Â </p>\n<p>Setiap jenis pengujian ini punya tujuan dan tekniknya sendiri yang perlu dipahami, di kesempatan lain saya akan jabarkan lebih dalam ya.</p>\n<h3><br>3. Belajar Bahasa Pemrograman</h3>\n<p>Paling nggak punya satu bahasa pemrograman yang kamu kuasai adalah modal yang sangat berguna dalam karir Software Engineer secara umum, jadi menjadi software tester/QA juga perlu punya bahasa pemrograman andalan, misal buat bikin test automation.</p>\n<p>Kamu bisa pilih bahasa pemrograman seperti: Javascript, Python dan Java adalah bahasa pemrograman yang umum digunakan dalam pengujian perangkat lunak dan digunakan developer untuk bikin aplikasinya, jadi kamu bisa tanya Dev kalo mentok soal koding.</p>\n<figure class=\"image image-style-align-center\"><img loading=\"lazy\" src=\"https://assets.karyakarsa.com/post-image-647c670139c48.jpg\" data-is-external-image=\"true\"></figure>\n<h3>4. Belajar Komunikasi</h3>\n<p>Kemampuan komunikasi yang baik memainkan peran krusial dalam kesuksesan seorang software tester. Karena kamu perlu banget skill komunikasi yang mumpuni biar ga salah paham dengan tim pengembang, tim QA lainnya, pemangku kepentingan, buat hal seperti menyampaikan laporan bug, kolaborasi tim, dan memahami requirement produk.</p>\n<h3><br>5. Pengujian Otomatis</h3>\n<p>Dalam lingkungan kerja modern, pengujian otomatis adalah keterampilan yang penting. Hampir semua startup gede di Indonesia mengimplementasi test automation ke dalam proses rilis nya, biar bisa membantu proses testing perubahan dengan lebih cepat dan konsisten.Â </p>\n<p>Belajarlah untuk menggunakan, membuat, merawat alat test automation tools seperti Selenium/appium, JUnit, TestNG, dan lainnya.</p>\n<h3><br>6. Pemahaman tentang Siklus Hidup Pengembangan Sistem (SDLC)</h3>\n<p>Seorang QA harus memahami proses SDLC dan bagaimana pengujian perangkat lunak cocok dalam proses tersebut. Pahami juga metode pengembangan seperti Agile dan DevOps.</p>\n<h3><br>7. Pelajari Manajemen Bug dan Alat Pelaporan</h3>\n<p>Software tester biasanya menggunakan tools seperti JIRA, Bugzilla, atau Trello untuk melacak dan melaporkan bug. Laporan bugs yang baik akan berguna bagi Dev untuk memperbaiki bugs dengan cepat, kamu bisa masukin informasi yang jelas dan mudah dipahami dalam laporan bugs, seperti detail masalahnya, cara reporoduce, rekaman video atau screenshot masalah tersebut, hmm di kesempatan lain nanti gw bahas hal ini dengan lebih detail, karena pentingnya kemampuan ini.</p>\n<h3><br>8. Pelajari tentang Basis Data</h3>\n<p>Sebagai seorang software tester, memahami SQL dan operasi basis data dasar adalah keterampilan yang berguna. Karena kamu bisa menguji apakah hasil proses di aplikasi sudah disimpan dengan benar di database, apakah bener nyimpen datanya di kolom tersebut (ga ketuker fieldnya), atau suka ada beberapa element yang suka kelewat, seperti timezone, misal datanya di input jam 7 malem waktu indonesia barat, tetapi di database disimpen GMT+0, pas di cek di sistem lain gada conversi balik ke WIB, dulu saya menemukan bugs ini setelah liat di database</p>\n<h3><br>9. Belajar tentang Keamanan Perangkat Lunak</h3>\n<p>Pemahaman dasar tentang keamanan perangkat lunak juga penting, termasuk topik seperti serangan XSS, SQL Injection, dan teknik penipuan lainnya, walaupun biasanya sudah ada tim khusus terkait software security ini seperti pentester dan devops, tapi keamanan aplikasi baru ini masuk ke dalam non-functional testing</p>\n<p><br>Gitu deh, gimana menurut kamu? Ternyata jadi software tester bukan hanya tentang menemukan bug ya.Â </p>\n<p>Kita juga harus paham â€œluar-dalamâ€ aplikasi biar yakin aplikasi kita berfungsi seperti yang diharapkan dan memberikan pengalaman yang baik bagi pengguna.Â </p>\n<p>Semoga sukses dalam perjalanan belajar Anda menjadi seorang software tester!</p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2023-11-05T14:46:17+04:00",
            "date_modified": "2023-11-05T14:46:17+04:00"
        },
        {
            "id": "https://fachrul.id/puisi-setahun-merantau-di-dubai/",
            "url": "https://fachrul.id/puisi-setahun-merantau-di-dubai/",
            "title": "Puisi: Setahun Berlalu di Dubai",
            "summary": "Di antara gedung pencakar langit di Dubai, aku berdiri Seorang perantau, jauh dari tanah air. Satu tahun berlalu secepat kilat, seperti mimpi yang lewat Meninggalkan yang terkasih, tak nampak ada wajah mereka di setiap embun pagi di oasis. Mimpi yang kugenggam, tak semudah angan menggapai,&hellip;",
            "content_html": "<div>\n<div>Di antara gedung pencakar langit di Dubai, aku berdiri</div>\n<div>Seorang perantau, jauh dari tanah air.</div>\n<div>Satu tahun berlalu secepat kilat, seperti mimpi yang lewat</div>\n<div>Meninggalkan yang terkasih,</div>\n<div>tak nampak ada wajah mereka di setiap embun pagi di oasis.</div>\n<div>Â </div>\n</div>\n<div><figure class=\"post__image post__image--left\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/63/masuk-ae.webp\" alt=\"\" width=\"250\" height=\"333\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/63/responsive/masuk-ae-xs.webp 300w ,https://fachrul.id/media/posts/63/responsive/masuk-ae-sm.webp 480w ,https://fachrul.id/media/posts/63/responsive/masuk-ae-md.webp 768w ,https://fachrul.id/media/posts/63/responsive/masuk-ae-lg.webp 1024w ,https://fachrul.id/media/posts/63/responsive/masuk-ae-xl.webp 1360w ,https://fachrul.id/media/posts/63/responsive/masuk-ae-2xl.webp 1600w\"></figure>\n<div>Mimpi yang kugenggam, tak semudah angan menggapai,</div>\n<div>Setiap langkahku ada bayang kerinduan yang tak pernah layu.</div>\n<div>\"Apakah ini layak? Ketika harus meninggalkan mereka yang kucinta\"</div>\n<div>Tanya tanya ku pada hati di malam yang sunyi,</div>\n<div>Kerinduan pada senyum anak, atau tawa istri yang tak bisa kusentuh.</div>\n<br>\n<div>Namun, di balik rindu ini, harapan terus bersinar,</div>\n<div>Semua demi masa depan yang cerah, itulah yang kuharapkan.</div>\n<div>Ku berdoa suatu hari nanti, saat perjalanan ini berakhir,</div>\n<div>Tak ada penyesalan yang tersisa, hanya syukur yang mengalir.</div>\n<br>\n<div>Istriku yang sabar ya</div>\n<div>Aku tahu betul tak mudah mendidik dua anak kita sendirian.</div>\n<div>Semoga kesabaran mengisi setiap detik yang kita lalui terpisah,</div>\n<br>\n<div>Aku berdoa, semoga tak lama lagi kita dapat bersua,</div>\n<div>Dan semua pengorbanan ini,</div>\n<div>menjadi anugerah terbaik untuk keluarga.</div>\n<div>Kuharap ini takkan sia-sia, dan aku yakin kerinduan akan berbuah bahagia.</div>\n<div>Â </div>\n<div>Dubai, 29 Oktober 2023</div>\n</div>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
            ],
            "date_published": "2023-10-29T13:11:00+04:00",
            "date_modified": "2023-11-05T13:12:46+04:00"
        },
        {
            "id": "https://fachrul.id/teka-teki-segitiga-sebuah-pelajaran-penting-dalam-critical-thinking-dan-software-testing/",
            "url": "https://fachrul.id/teka-teki-segitiga-sebuah-pelajaran-penting-dalam-critical-thinking-dan-software-testing/",
            "title": "Teka-Teki Segitiga: Sebuah Pelajaran Penting! Critical Thinking dan Software Testing",
            "summary": "Salam ğŸ™Œ Beberapa waktu lalu, di timeline gw ada tweet yang lagi rame soal tantangan menghitung jumlah segitiga dalam satu gambar, gw langsung mikir \"nah ini contoh bagus buat melatih critical thinking buat software tester\" Kemarin (1 Juli 2023), gw bikin quiz kecil-kecilan di instagram&hellip;",
            "content_html": "<p>Salam ğŸ™Œ</p>\n<p>Beberapa waktu lalu, di timeline gw ada tweet yang lagi rame soal tantangan menghitung jumlah segitiga dalam satu gambar, gw langsung mikir \"nah ini contoh bagus buat melatih critical thinking buat software tester\"</p>\n<p>Kemarin (1 Juli 2023), gw bikin quiz kecil-kecilan di instagram <a href=\"https://www.instagram.com/ngetest.id/\" target=\"_blank\" rel=\"noopener noreferrer\">@ngetest.id</a>, soal pertanyaan teka-teki menghitung segitiga ini \"How many triangles?\"</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/62/WhatsApp-Image-2023-07-02-at-10.34.17-2.jpeg\" alt=\"\" width=\"360\" height=\"800\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.34.17-2-xs.jpeg 300w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.34.17-2-sm.jpeg 480w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.34.17-2-md.jpeg 768w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.34.17-2-lg.jpeg 1024w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.34.17-2-xl.jpeg 1360w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.34.17-2-2xl.jpeg 1600w\"></figure>\n<figcaption >quiz di akun @ngetest.id (silakan follow klo belum)</figcaption>\n</figure>\n<p>Rate yang jawab ga banyak sih sekitar 27% orang yang menjawab, tapi pas gw cek jawabannya, gw kaget juga banyak yang jawab \"salah\" alias kejebak pas ngitung jumlah segitiganya! Terus sebenernya, berapa sih jumlah segitiga yang bener?</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/62/WhatsApp-Image-2023-07-02-at-10.35.45-2.jpeg\" alt=\"\" width=\"350\" height=\"451\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.35.45-2-xs.jpeg 300w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.35.45-2-sm.jpeg 480w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.35.45-2-md.jpeg 768w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.35.45-2-lg.jpeg 1024w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.35.45-2-xl.jpeg 1360w ,https://fachrul.id/media/posts/62/responsive/WhatsApp-Image-2023-07-02-at-10.35.45-2-2xl.jpeg 1600w\"></figure>\n<figcaption >jawabannya 18</figcaption>\n</figure>\n<p>Jawaban utamanya 18, tapi plot twist nya, ini bukan jawaban yang gw harapkan loh ğŸ˜±</p>\n<p>Oke kita bahas dulu, dari mana sih angka 18 ini muncul? ini di dapat dari kombinasi garis yang membentuk segitiga, percaya-gak percaya ada rumus matematika juga loh untuk ini, karena katanya menghitung segitiga sama halnya dengan menghitung kombinasi dari tiga garis (three lines chosen out of six)</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/62/jawaban-teka-teki-segitiga.jpeg\" alt=\"\" width=\"350\" height=\"355\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/62/responsive/jawaban-teka-teki-segitiga-xs.jpeg 300w ,https://fachrul.id/media/posts/62/responsive/jawaban-teka-teki-segitiga-sm.jpeg 480w ,https://fachrul.id/media/posts/62/responsive/jawaban-teka-teki-segitiga-md.jpeg 768w ,https://fachrul.id/media/posts/62/responsive/jawaban-teka-teki-segitiga-lg.jpeg 1024w ,https://fachrul.id/media/posts/62/responsive/jawaban-teka-teki-segitiga-xl.jpeg 1360w ,https://fachrul.id/media/posts/62/responsive/jawaban-teka-teki-segitiga-2xl.jpeg 1600w\"></figure>\n<figcaption >jawaban jumlah segitiga</figcaption>\n</figure>\n<p>Begitulah kenapa muncul angka 18 sebagai jawaban Quiz di instagram <a href=\"https://www.instagram.com/ngetest.id/\" target=\"_blank\" rel=\"noopener noreferrer\">@ngetest.id</a>, tapi bukan itu jawaban yang gw harapkan dari followers akun ngetest.id yang gw yakin sebagian besar adalah seorang software tester, yaitu \"Bertanya\"</p>\n<hr>\n<h2>Eh gimana maksudnya?</h2>\n<p>Karena di keterangan quiz nya itu banyak informasi yang ambigu bahkan multi tafsir sih, kebiasaan kita tuh banyak yang anggep asumsi umum sebagai kebenaran dari sebuah requirements (user story), padahal belum tentu itu yang diharapkan.</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/62/jawaban-yang-diharapkan.jpeg\" alt=\"\" width=\"350\" height=\"778\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/62/responsive/jawaban-yang-diharapkan-xs.jpeg 300w ,https://fachrul.id/media/posts/62/responsive/jawaban-yang-diharapkan-sm.jpeg 480w ,https://fachrul.id/media/posts/62/responsive/jawaban-yang-diharapkan-md.jpeg 768w ,https://fachrul.id/media/posts/62/responsive/jawaban-yang-diharapkan-lg.jpeg 1024w ,https://fachrul.id/media/posts/62/responsive/jawaban-yang-diharapkan-xl.jpeg 1360w ,https://fachrul.id/media/posts/62/responsive/jawaban-yang-diharapkan-2xl.jpeg 1600w\"></figure>\n<figcaption >harusnya ada yang tanya di story ini</figcaption>\n</figure>\n<p>Oke di context quiz segitiga ini, informasi yang perlu diklarifikasi dari pertanyaan (reqirements) \"How many <em><strong>triangles</strong></em>?\" sebenernya:</p>\n<ul>\n<li>Triangles? eh segitiga yang mana nih? segitiga sama kaki? sama sisi? atau segitiga sembarangan?</li>\n<li>Ini ngitung segitiga yang keliatan doang?</li>\n<li>Luar nya doang? apa termasuk yang di dalem? (segitiga dalam segitiga)</li>\n<li>Atau yang paling epik tuh klo ada yang tanya \"Ini garis di lembar kertas diitung membelah segitiga juga ga?\"</li>\n</ul>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/62/detail-segitiga.png\" alt=\"\" width=\"350\" height=\"100\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/62/responsive/detail-segitiga-xs.png 300w ,https://fachrul.id/media/posts/62/responsive/detail-segitiga-sm.png 480w ,https://fachrul.id/media/posts/62/responsive/detail-segitiga-md.png 768w ,https://fachrul.id/media/posts/62/responsive/detail-segitiga-lg.png 1024w ,https://fachrul.id/media/posts/62/responsive/detail-segitiga-xl.png 1360w ,https://fachrul.id/media/posts/62/responsive/detail-segitiga-2xl.png 1600w\"></figure>\n<figcaption >garis kertas juga keiting bikin segitiga baru?</figcaption>\n</figure>\n<p>Pertanyaan ini penting banget untuk dipahami sebelum menjawab (ngeTest), karena jumlah jawabanya (jumlah segitiga) akan tergantung dari kesepakatan bersama dalam konteks pertanyaan ini (requirements), karena salah tafsir bisa ngasih jawaban yang salah atau nggak lengkap</p>\n<p>Sebagai Software Tester, kita harus paham banget apa sih yang kita tes dan konteks nya gimana. Kita harus pastiin klo tim (QA, Dev, dkk) punya pemahaman yang sama tentang apa yang diharapkan dari softwarenya</p>\n<h2>Jadi, apa yang bisa kita pelajari dari teka-teki segitiga ini?</h2>\n<p>Jangan takut buat nanya. Jangan asumsi kamu udah ngerti semuanya. Pahami konteks, pahami requirement, asah critical thinking kamu. Kita harus bisa melihat lebih dari apa yang nampak di depan mata, kita harus bisa \"melihat\" apa yang tidak tampak oleh orang lain, menguji batas dan memastikan bahwa tim bisa memberikan yang terbaik melebihi harapan pelanggan (production user)</p>\n<hr>\n<p>Sumber artikel: <a href=\"https://www.popularmechanics.com/science/math/a30706968/viral-triangle-brain-teaser-solved/\">https://www.popularmechanics.com/science/math/a30706968/viral-triangle-brain-teaser-solved/</a>Â </p>\n<p>Â </p>",
            "image": "https://fachrul.id/media/posts/62/Teka-Teki-Segitiga-Sebuah-Pelajaran-Penting-Critical-Thinking-dan-Software-Testing.jpg",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
                   "merdeQA",
                   "belajar-qa"
            ],
            "date_published": "2023-07-02T11:07:30+04:00",
            "date_modified": "2023-07-02T12:02:21+04:00"
        },
        {
            "id": "https://fachrul.id/resensiqan-karir-cemerlang-seorang-software-quality-assurance/",
            "url": "https://fachrul.id/resensiqan-karir-cemerlang-seorang-software-quality-assurance/",
            "title": "ResensiQAn: Karir Cemerlang Seorang Software Quality Assurance",
            "summary": "Salam, Apa kabar teman-teman? Semoga selalu dalam keadan baik dan sehat walafiat ya, mohon maaf yak sempat tertunda beberapa pekan tidak rilis tulisan baru, karena ada beberapa kesibukan di kantor, jadi baru sempat di pekan ini saat libur Idul Adha buat ngelarin tulisan ini ğŸ˜…&hellip;",
            "content_html": "<p data-pm-slice=\"0 0 []\">Salam,</p>\n<p>Apa kabar teman-teman? Semoga selalu dalam keadan baik dan sehat walafiat ya, mohon maaf yak sempat tertunda beberapa pekan tidak rilis tulisan baru, karena ada beberapa kesibukan di kantor, jadi baru sempat di pekan ini saat libur Idul Adha buat ngelarin tulisan ini ğŸ˜…</p>\n<p>Ok, kita lanjutin series â€œResensi QAâ€ merangkum hasil dari gw menyimak suatu video/buku, kali ini gw udah nulis resensi dari sebuah youtube <strong>Kuncie:</strong> <strong>Bright Opportunity of a Quality Assurance</strong></p>\n<div id=\"youtube2-SuA_fKCL5Pw\" class=\"youtube-wrap\" data-attrs=\"{&quot;videoId&quot;:&quot;SuA_fKCL5Pw&quot;,&quot;startTime&quot;:null,&quot;endTime&quot;:null}\" data-component-name=\"Youtube2ToDOM\">\n<div class=\"youtube-inner\"><div class=\"post__iframe\"><iframe width=\"728\" height=\"409\" src=\"https://www.youtube-nocookie.com/embed/SuA_fKCL5Pw?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></div></div>\n</div>\n<p>Video ini sangat cocok buat lo yang baru lulus kuliah dan tertarik untuk memiliki karir di Software Quality Assurance, gw saranin buat nonton videonya sampe akhir ya, karena di sesi tanya jawabnya juga menarik banget!</p>\n<p>Video rekaman webminar di atas adalah sebuah <em>teaser </em>dari kursus yang ditawarkan Kuncie di bulan Januari/Februari 2023 kemarin, dan Kuncie baik sekali membuat dan membagikan webminar ini sehingga kita bisa menyimaknya juga ğŸŒŸ</p>\n<p>Oke gw bahas intisari dari pembahasan Mas Tegar yang keren banget</p>\n<p class=\"button-wrapper\" data-attrs=\"{&quot;url&quot;:&quot;%%checkout_url%%&quot;,&quot;text&quot;:&quot;Subscribe now&quot;,&quot;action&quot;:null,&quot;class&quot;:null}\" data-component-name=\"ButtonCreateButton\"><a class=\"button primary\" href=\"%%checkout_url%%\">Subscribe now</a></p>\n<hr>\n<p>Profesi Software Quality Assurance itu sangat menjanjikan di jaman sekarang, terlebih saat AI mulai merajalela, peran QA justru semakin penting, karena gak semua bisa di kerjakan oleh AI, bahkan hasil generated kode dari AI perlu di verifikasi lagi oleh manusia, bahkan menurut Gartner yang membuat daftar skill critical dan niche di masa depan ternyata banyak irisannya dengan peran QA loh.</p>\n<p>Tapi, jangan salah kaprah, banyak mahasiswa jurusan IT yang bilangnya mau jadi QA karena ga bisa koding, padahal faktanya, menjadi QA perlu juga keahlian koding, bahkan kalo mau menjadi QA yang â€œmembaraâ€ harus bisa testing fitur, membantu Dev untuk bikin unit test yang efektif &amp; efisien sampe ke membantu proses deployment ke user, QA ikut memupuk DevOps culture di perusahaan.</p>\n<div class=\"captioned-image-container\">\n<figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png\" data-component-name=\"Image2ToDOM\" rel=\"noopener\">\n<div class=\"image2-inset\"><figure class=\"sizing-normal\"><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 1456w\" sizes=\"100vw\"><img loading=\"lazy\"  src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png\" sizes=\"100vw\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png 1456w\" alt=\"\" width=\"1456\" height=\"816\" data-attrs=\"{&quot;src&quot;:&quot;https://substack-post-media.s3.amazonaws.com/public/images/a223c3ac-c643-44c8-aaff-5a7f427910a3_1860x1042.png&quot;,&quot;fullscreen&quot;:null,&quot;imageSize&quot;:null,&quot;height&quot;:816,&quot;width&quot;:1456,&quot;resizeWidth&quot;:null,&quot;bytes&quot;:1545993,&quot;alt&quot;:null,&quot;title&quot;:null,&quot;type&quot;:&quot;image/png&quot;,&quot;href&quot;:null,&quot;belowTheFold&quot;:false,&quot;topImage&quot;:false,&quot;internalRedirect&quot;:null}\" data-is-external-image=\"true\"></figure></picture>\n<div>Â </div>\n</div>\n</a></figure>\n</div>\n<p>Di bagian selanjutnya, Mas Tegar menjabarkan kalo karir QA juga ga jauh beda dengan software engineer lainya, umumnya ada jalur karir sebagai managerial atau individual contributor, tapi yang lebih menarik adalah pagian 3 nya tentang Roadmap!</p>\n<div class=\"captioned-image-container\">\n<figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png\" data-component-name=\"Image2ToDOM\" rel=\"noopener\">\n<div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 1456w\" sizes=\"100vw\"><img loading=\"lazy\" class=\"sizing-normal\" title=\"kuncie \n03 | Roadmaps \nPhase I \nIntroduction to \nf Kilat \nQuality Assurance. \nDefine Short Term \nGoal on Career \nStarting learn the \nbasic and \nfundamental \nLeverage it into the \nreal domain portfolio \nPhase 2 \nSpecific Platform \nTesting: Backend and \nRespecting Testing \nPyramid by AT \nShaping Test \nOperational: \nDevelopment. \nExecutions. Reporting \nPhase 3 \nSpecific Platform \nTesting: AOS and i0S \nMobile AT \nRespecting Testing \nPyramid by AT \nLeverage it into real \nproject \nSOET &amp; QA \nPhase 4 \nAgile Maturity Matrix \non Engineering \nCI/CD Beginner: \nIntegrated and \nImpactful \nTesting on \nEngineering \nPerspective: Unit &amp; \ncomponent T est \nFirst Critical Fundamental Portfolio \nO kuncie \" src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png\" sizes=\"100vw\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png 1456w\" alt=\"kuncie \n03 | Roadmaps \nPhase I \nIntroduction to \nf Kilat \nQuality Assurance. \nDefine Short Term \nGoal on Career \nStarting learn the \nbasic and \nfundamental \nLeverage it into the \nreal domain portfolio \nPhase 2 \nSpecific Platform \nTesting: Backend and \nRespecting Testing \nPyramid by AT \nShaping Test \nOperational: \nDevelopment. \nExecutions. Reporting \nPhase 3 \nSpecific Platform \nTesting: AOS and i0S \nMobile AT \nRespecting Testing \nPyramid by AT \nLeverage it into real \nproject \nSOET &amp; QA \nPhase 4 \nAgile Maturity Matrix \non Engineering \nCI/CD Beginner: \nIntegrated and \nImpactful \nTesting on \nEngineering \nPerspective: Unit &amp; \ncomponent T est \nFirst Critical Fundamental Portfolio \nO kuncie \" width=\"1456\" height=\"812\" data-attrs=\"{&quot;src&quot;:&quot;https://substack-post-media.s3.amazonaws.com/public/images/4dbefe64-73ac-4b73-8f9a-7120c41c8a27_2266x1263.png&quot;,&quot;fullscreen&quot;:null,&quot;imageSize&quot;:null,&quot;height&quot;:812,&quot;width&quot;:1456,&quot;resizeWidth&quot;:null,&quot;bytes&quot;:null,&quot;alt&quot;:&quot;kuncie \\n03 | Roadmaps \\nPhase I \\nIntroduction to \\nf Kilat \\nQuality Assurance. \\nDefine Short Term \\nGoal on Career \\nStarting learn the \\nbasic and \\nfundamental \\nLeverage it into the \\nreal domain portfolio \\nPhase 2 \\nSpecific Platform \\nTesting: Backend and \\nRespecting Testing \\nPyramid by AT \\nShaping Test \\nOperational: \\nDevelopment. \\nExecutions. Reporting \\nPhase 3 \\nSpecific Platform \\nTesting: AOS and i0S \\nMobile AT \\nRespecting Testing \\nPyramid by AT \\nLeverage it into real \\nproject \\nSOET &amp; QA \\nPhase 4 \\nAgile Maturity Matrix \\non Engineering \\nCI/CD Beginner: \\nIntegrated and \\nImpactful \\nTesting on \\nEngineering \\nPerspective: Unit &amp; \\ncomponent T est \\nFirst Critical Fundamental Portfolio \\nO kuncie &quot;,&quot;title&quot;:null,&quot;type&quot;:null,&quot;href&quot;:null,&quot;belowTheFold&quot;:false,&quot;topImage&quot;:false,&quot;internalRedirect&quot;:null}\" data-is-external-image=\"true\"></picture>\n<div>Â </div>\n</div>\n</a></figure>\n</div>\n<p>Jadi disini dijelasin klo roadmap QA itu ibarat mendaki gunung, awalnya mendaki itu gampang saat landai, tapi perjalanan tentu naik-turun sebelum sampai puncak, ketika sampai puncak pun jangan dulu puas dengan apa yang dicapai, masih ada puncak lain (phase) yang perlu ditaklukan juga</p>\n<p>Nah poin-poin yang ada di tiap fase nya itu dijelasin lagi secara rinci di dalam video, ga mungkin gw tulis semua disini karena nanti jadi panjang ahaha, langsung di cekidot aja video sumbernya ya.</p>\n<p>Lompat ke bagian tanya jawab, sebenernya ada berbagai pertanyaan yang umumnya ditanyakan oleh pemula, yang mungkil lo juga penasaran gitu soal karir di QA ini, tapi klo bisa gw simpulkan dari tanya jawab adalah:</p>\n<p>Dengan adanya test automation, artificial intelligence, ChatGPT itu semua hanya tools yang akan bikin testing menjadi lebih efisien, sehingga jumlah software tester di perusahaan ga sebanyak dulu, tapi bukan berarti peran QA akan tergantikan oleh robot, justru perlu QA expert yang bisa mengendalikan tools tadi.</p>\n<p>QA Expert ga cuma perlu keahlian koding, test infra (devops), tapi fundamental testing juga sangat perlu dilatih, dan business domain di perusahaan juga harus dimengerti juga.</p>\n<p>Talenta software tester di Indonesia tuh ga kalah bagus kok dari luar negeri, bahkan banyak yang lebih jago, cuma untuk bisa berkarir di luar negeri harus bisa bahasa Inggris, ga mesti grammarly correct, yang penting bisa berkomunikasi dengan jelas aja, dan punya rasa curious yang tinggi dan ga malu bertanya.</p>\n<hr>\n<p>Nah begitu deh resensi webminar dari Mas Tegar di channel <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/@KuncieID\">Kuncie</a>, silakan di cek deh, ada beberapa video lanjutan juga terkait software testing loh!</p>\n<div id=\"youtube2-fazDUaBhotc\" class=\"youtube-wrap\" data-attrs=\"{&quot;videoId&quot;:&quot;fazDUaBhotc&quot;,&quot;startTime&quot;:null,&quot;endTime&quot;:null}\" data-component-name=\"Youtube2ToDOM\">\n<div class=\"youtube-inner\"><div class=\"post__iframe\"><iframe width=\"728\" height=\"409\" src=\"https://www.youtube-nocookie.com/embed/fazDUaBhotc?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></div></div>\n</div>\n<div id=\"youtube2-besHeAIpWYk\" class=\"youtube-wrap\" data-attrs=\"{&quot;videoId&quot;:&quot;besHeAIpWYk&quot;,&quot;startTime&quot;:null,&quot;endTime&quot;:null}\" data-component-name=\"Youtube2ToDOM\">\n<div class=\"youtube-inner\"><div class=\"post__iframe\"><iframe width=\"728\" height=\"409\" src=\"https://www.youtube-nocookie.com/embed/besHeAIpWYk?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></div></div>\n</div>\n<p>Klo ada video yang mau dibikinin resensinya, silakan komen disini ya ğŸ™</p>\n<p class=\"button-wrapper\" data-attrs=\"{&quot;url&quot;:&quot;%%share_pub_url%%&quot;,&quot;text&quot;:&quot;Share âœ… NgeTest Bareng Fachrul ğŸ§‘ğŸ»â€ğŸ’»&quot;,&quot;action&quot;:null,&quot;class&quot;:null}\" data-component-name=\"ButtonCreateButton\"><a class=\"button primary\" href=\"%%share_pub_url%%\">Share âœ… NgeTest Bareng Fachrul ğŸ§‘ğŸ»â€ğŸ’»</a></p>",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
                   "belajar-qa"
            ],
            "date_published": "2023-06-29T21:46:43+04:00",
            "date_modified": "2023-07-02T10:39:36+04:00"
        },
        {
            "id": "https://fachrul.id/hemat-di-dubai-panduan-hidup-ekonomis-ala-anak-kos/",
            "url": "https://fachrul.id/hemat-di-dubai-panduan-hidup-ekonomis-ala-anak-kos/",
            "title": "Siasat Hemat di Dubai: Panduan Hidup Ekonomis ala Anak Kos",
            "summary": "<p>Sebagai kota yang dikenal dengan kemegahannya, Dubai mungkin tidak langsung terlintas di pikiran kamu ketika memikirkan hidup hemat. Namun, meski kota ini memang memiliki biaya hidup yang cukup tinggi apalagi bagi orang Indonesia, masih ada loh cara untuk menjalani gaya hidup yang hemat dan memaksimalkan penghasilan kita sebagai tenaga kerja dari Indonesia, ya kan kita di Dubai mau cari duit, bukan wisatawan yang siap ngabisin duit liburan ğŸ¤£</p>\n<p>Berikut beberapa pengalaman saya menjadi hidup hemat ala anak kos di Dubai!</p>\n<h2 class=\"align-center\">Daftar isi:</h2>\n<ul>\n<li><a href=\"#makanan\">Pilihan Makan Murah di Dubai</a></li>\n<li><a href=\"#akomodasi\">Tempat Tinggal di Dubai</a></li>\n</ul>\n",
            "content_html": "<p>Sebagai kota yang dikenal dengan kemegahannya, Dubai mungkin tidak langsung terlintas di pikiran kamu ketika memikirkan hidup hemat. Namun, meski kota ini memang memiliki biaya hidup yang cukup tinggi apalagi bagi orang Indonesia, masih ada loh cara untuk menjalani gaya hidup yang hemat dan memaksimalkan penghasilan kita sebagai tenaga kerja dari Indonesia, ya kan kita di Dubai mau cari duit, bukan wisatawan yang siap ngabisin duit liburan ğŸ¤£</p>\n<p>Berikut beberapa pengalaman saya menjadi hidup hemat ala anak kos di Dubai!</p>\n<h2 class=\"align-center\">Daftar isi:</h2>\n<ul>\n<li><a href=\"#makanan\">Pilihan Makan Murah di Dubai</a></li>\n<li><a href=\"#akomodasi\">Tempat Tinggal di Dubai</a></li>\n</ul>\n\n<h1 id=\"makanan\" class=\"msg msg--info align-center\">ğŸ½ï¸ Makanan</h1>\n<p>Mengatur anggaran makanan sebagai anak kos di Dubai bisa pos pengeluaran yang fleksibel, memang anggaran makanan ini sifatnya relatif terhadap gaya hidup kamu, tapi dengan sedikit kreativitas dan perencanaan, kita bisa mendapatkan makanan bergizi dengan harga yang terjangkau juga loh!</p>\n<p>Hal pertama yang langsung terasa hilang saat berada di Dubai adalah, tidak adanya budaya makanan kaki lima ğŸ˜¢ , jadi pengusaha kuliner harus memiliki toko fisik seperti halnya restoran, mungkin ini karena Dubai dikenal sebagai kota modern dan futuristik, yang memiliki standar yang tinggi untuk segala hal, termasuk standar kesehatan dan kebersihan dalam penyajian makanan, kata pemilik restoran kenalan saya sih, katanya usaha kuliner itu harus memenuhi serangkaian aturan dan regulasi yang cukup ketat, termasuk memiliki izin tempat, mematuhi standar kebersihan, dan menjaga kualitas makanan.</p>\n<p>Alasan lain kenapa gakÂ  Sebagai kota gurun, Dubai memiliki suhu yang sangat panas saat Summer bahkan malem hari pun hawanya masih gerah, dan ini membuat lingkungan kurang menguntungkan untuk penjual makanan jalanan kaki lima (kalau winter sih sering liat popup food festival di lokasi populer juga kok).</p>\n<h4>Seberapa dirhamkah yang termasuk murah?</h4>\n<p>Memang, jika diconversikan dirham ke rupiah (1 dirham sekitar Rp4.000), semua akan terlihat mahal sekali, bisa 3x lipat harga benda yang sama di Jakarta, jadi tidak adil rasanya jika uang dirham yang didapat dari kerja disini selalu dikalikan nilai rupiahnya, semua kelihatan mahal jadinya (kecuali memang kita liburan ke Dubai, jadi gajian Rupiah spendingnya Dirham).</p>\n<p>Lebih bijaksana jika kita memiliki standar harga wajar, apakah untuk ukuran Dubai, harganya termasuk murah atau mahal. Saya akan bagikan rumus pribadi saya dalam menilai harga makanan/minuman itu termasuk mahal atau murah menurut standar hidup dubai</p>\n<p class=\"msg msg--highlight \">Harga wajar senilai Rupiah = 1,5 Harga Dirham x 1000</p>\n<h5>Contoh:</h5>\n<p>Harga Indomie goreng mentah di Dubai itu AED 2/pc, jadi kalau pakai rumus di atas menjadi Rp3.000, tentu harga wajar sama kek di Jakarta kan</p>\n<h5>Contoh lain:</h5>\n<p>Makan siang di kantor itu nasi briyani + minum itu AED25 jadi setara dengan nilai Rp37.500 di Jakarta, dimana ini wajar buat makan siang di restoran wilayah perkantoran Jakarta.</p>\n<p>Saya punya anggaran makan itu 20-30 dirham untuk sekali makan, di bawah 20 dirham (Rp80ribuan) termasuk murah dan di atas 30 dirham (Rp120ribuan) itu sudah termasuk mahal buat saya</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/aneka-bahan-masakan.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/aneka-bahan-masakan-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/aneka-bahan-masakan-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/aneka-bahan-masakan-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/aneka-bahan-masakan-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/aneka-bahan-masakan-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/aneka-bahan-masakan-2xl.jpg 1600w\"></figure>\n<figcaption >Aneka harga bahan masakan di Lulu (Mei 2023)</figcaption>\n</figure>\n<p>Sebagai anak kosan yang hidup sendirian di Dubai, menurut saya pribadi, lebih murah beli makan di luar daripada masak sendiri di rumah loh ğŸ˜…, mungkin kalau untuk makan sekeluarga itu tentu bisa lebih murah masak sendiri, tapi kalau buat sendirian sih mahal ya, menurut saya kalau masak itu minimal harus siapin 3 jenis makanan, yaitu sayuran, protein (telur/daging/ikan) dan nasi, belanja bahan masakan aja kadang ga bisa dalam porsi kecil, jadi harus beli banyak dalam satu pack gitu (bisa disimpen di kulkas sih), belum minyak dan bumbunya ya, kalau saya hitung biayanya lebih mahal daripada beli makan di luar, apalagi restoran masakan india itu seperti nasi padang, kalau di bungkus porsinya jumbo! jadi sekali beli bisa buat 2x makan loh ğŸ¤£ nah pada kesempatan kali ini saya akan fokus pembahasanya adalah <span style=\"text-decoration: underline;\"><span style=\"color: #000000; text-decoration: underline;\">beli makan di luar dengan harga terjangkau</span></span> ya, bukan masak sendiri biar hemat.</p>\n<p>Dan kalau ada yang nyari makanan Indonesia di Dubai itu ada banyak juga kok, dan rasanya sangat mirip citarasa asli di Indonesia, walaupun beberapa tempat itu pake bumbu instan karena sulit dapet rempah-rempah masakan Indonesia di Dubai, tapi jangan kaget kalau harganya tergolong mahal, karena makanan Indonesia termasuk makanan luar negeri yang beberapa bahan baku bahkan harus di import, jadi biasanya untuk makan dan minum bisa habis sekitar 30 sampai 50 dirham loh (sekitar 120rbuan atau harga wajarnya 45ribuan sampai 200rbuan), kalau mau hemat pilihannya ada di makanan lokal sini aja masakan arab atau india, seperti nasi briyani, nasi kebuli, nasi mandi itu harganya jauh lebih murah daripada harga di Jakarta ğŸ˜…</p>\n<h2>1. Beli Makanan Matang di Supermarket</h2>\n<p>Carrefour, Lulu, Viva, Waitrose, Choitram adalah nama supermarket yang menawarkan menu makan ala warteg, aneka masakan dari eropa, asia, india, salad sudah tersedia, misal kita bisa beli ayam goreng, ayam bakar, bisa satu potong, setengah ekor, bahkan satu ekor utuh (bakakak) pun ada! harganya murah</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/makanan-mateng.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/makanan-mateng-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/makanan-mateng-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/makanan-mateng-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/makanan-mateng-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/makanan-mateng-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/makanan-mateng-2xl.jpg 1600w\"></figure>\n<figcaption >aneka masakanan matang di Lulu (Mei 2023)</figcaption>\n</figure>\n<p>perhatikan harga yang tertera dan satuannya, ada yang dalam \"per piece\" harga satuan, ada yang harga \"per kg\" jadi perlu ditimbang dulu.</p>\n<h4>Gimana Cara Pesannya:</h4>\n<p>Mirip warteg, kita tinggal sentuh kaca nya aja dan bilang \"karo iki mase\" dalam bahasa Inggris tapi ya ğŸ¤£ \"I want this one pc/scoop please\" dan si mas-mas india nya akan menimbang dulu berapa gram hasil cidukan buat ditentukan harga jualnya, sehabis itu kita juga bisa kombinasikan dengan beberapa menu, misal nasi kebuli dan setengah ekor ayam guling, lalu bayar di kasir.</p>\n<p>Biasanya sekali beli sekitar 25 dirham (harga wajarnya senilai 37ribuan) bisa buat makan seharian, jadi beli pagi untuk makan siang dan malam, tinggal dihangatkan saja pakai microwave atau kompor gas, jadi kalo dibagi dua jadi sekali makan kan cuma 12.5 dirham aja, murah banget! atau kalau mau lebih murah lagi, untuk sumber karbohidratnya jangan beli nasi tapi beli roti arab gitu 1.75 dirham udah bikin kenyang untuk 2x makan loh</p>\n<h2>2. Beli Makanan Jadi di Supermarket</h2>\n<p>Carrefour, Lulu, Viva, Waitrose, Choitram, dan Zoom pun biasanya menyediakan makanan jadi satu set kumplit yang siap saji, tapi tetap harus dipanaskan di microwave dulu, biasanya disana sudah ada, tinggal minta tolong ke pramusaji nya untuk dihangatkan dlu, ya kurang lebih 2 menit sampai siap santap, dari mulai salad, burger, sandwich, makanan india, makanan filipina, sampe kadang ada nasi goreng juga loh!Â </p>\n<p>Makanan siap saji ini memang perlu microwave untuk kembali segar, ini sebenarnya sudah ada banyak di Jakarta seperti di Lawson, Family Mart gitu kalo gak salah.</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/makanan-siap-saji.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/makanan-siap-saji-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/makanan-siap-saji-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/makanan-siap-saji-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/makanan-siap-saji-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/makanan-siap-saji-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/makanan-siap-saji-2xl.jpg 1600w\"></figure>\n<figcaption >Aneka makanan siap saji di supermarket Dubai</figcaption>\n</figure>\n<p>Harganya banyak yang di bawah 20 dirham, bahkan 3 dirham buat roti sandwich isi (harga wajarnya senilai Rp4500), tapi memang untuk sekali makan saja, beda dengan yang makanan matang sebelumnya yang bisa 2 kali makan</p>\n<h2>3. Beli Makan di Cafetaria</h2>\n<p>Hampir di setiap stasiun kereta Metro itu ada kerjasama dengan UMKM Dubai untuk buka warung makanan, harga disini murah-murah menu yang nasi biasanya 18 dirham, menu roti-rotian lebih murah lagi, cocok sekali untuk sarapan sebelum berangkat kerja</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/nasi-goreng-metro.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/nasi-goreng-metro-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/nasi-goreng-metro-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/nasi-goreng-metro-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/nasi-goreng-metro-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/nasi-goreng-metro-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/nasi-goreng-metro-2xl.jpg 1600w\"></figure>\n<figcaption >Sarapan Nasi Goreng Ayam Spesial di Metro</figcaption>\n</figure>\n<p>Kalau nasi goreng terlalu berat bisa minta spring roll atau samosa dan karak tea, biasanya cuma 5 dirham (harga wajar senilai Rp7500) aja loh</p>\n<p>Atau favorit sarapan saya adalah wrap porata egg seharga 5 dirham, porata itu sebenarnya biasa kita kenal dengan roti canai, terus bentuknya di gulung menyerupai kebab gitu</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/porata-cafetaria.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/porata-cafetaria-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/porata-cafetaria-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/porata-cafetaria-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/porata-cafetaria-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/porata-cafetaria-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/porata-cafetaria-2xl.jpg 1600w\"></figure>\n<figcaption >porata di cafetaria</figcaption>\n</figure>\n<h2>4. Beli Makanan di Restoran</h2>\n<p>Menikmati makanan di restoran gak selalu harus merogoh kocek dalam-dalam. Ada beberapa restoran yang harganya miring loh, seperti sudah disebutkan sekilas di atas, yaitu restoran lokal yang menyajikan makanan india, chinese, wrap, burger gitu</p>\n<p>Salah satunya restoran ini yang berlokasi di Al Rashidiya, dekat dengan tempat tinggal saya, lihat saja harganya masi murah banget banyak yang dibawah 20 dirham, dan kalau dibungkus porsinya jumbo, kadang bisa buat 2x makan untuk saya sih:</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://fachrul.id/media/posts/60/gallery/foto-depan-restoran.jpeg\" data-size=\"960x1280\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/60/gallery/foto-depan-restoran-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"960\"></a>\n<figcaption>tampak depan restoran</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-5.jpg\" data-size=\"960x1280\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-5-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"960\"></a>\n<figcaption>aneka nasi briyani</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-4.jpg\" data-size=\"960x1280\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-4-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"960\"></a>\n<figcaption>shawarma yang menggoda</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-3.jpg\" data-size=\"960x1280\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-3-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"960\"></a>\n<figcaption>aneka mie goreng</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-2.jpg\" data-size=\"960x1280\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"960\"></a>\n<figcaption>aneka nasi goreng</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-1.jpg\" data-size=\"960x1280\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/60/gallery/foto-menu-restoran-1-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"960\"></a>\n<figcaption>menu india</figcaption>\n</figure>\n</div></div>\n<p>Dan jangan lupa dipantau juga aplikasi antar makanan online seperti Careem Food, Talabat, Deliveroo dkk karena terkadang ada promo diskon makanan juga, jadi bisa hemat untuk pesan makanan online</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/mcd-kfc.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/mcd-kfc-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/mcd-kfc-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/mcd-kfc-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/mcd-kfc-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/mcd-kfc-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/mcd-kfc-2xl.jpg 1600w\"></figure>\n<figcaption >Harga McD dan KFC di Dubai</figcaption>\n</figure>\n<p>Â </p>\n<h1>5. Kreatifitas Anak Kos</h1>\n<p>Sempet saya singung juga di atas, kalau masak sendiri lebih mahal? sebenernya ga berlaku kalau yang dimasak adalah Indomie dan telur ahaha, karena indomie selalu jadi penyelamat di tanggal tua</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/indomie.jpg\" alt=\"\" width=\"1080\" height=\"810\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/indomie-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/indomie-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/indomie-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/indomie-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/indomie-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/indomie-2xl.jpg 1600w\"><figcaption>indomie 8.95 dirham isi 5 bungkus</figcaption></figure>\n<p>Untuk menambah variasi dan gizinya, saya sering berkreasi dengan masaknya tambah telur, sayuran dan sosis bahkan sarden pun pernah, ini beneran bisa sangat menghemat di hari-hari menjelang gajian ğŸ˜‚</p>\n<p>Atau kadang juga saya berkreasi dengan roti arab ditambah telur ceplok, harga rotinya murah 1-2 dirham bisa buat makan seharian sih untuk satu plastik seperti ini</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/roti-arab.jpg\" alt=\"\" width=\"810\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/roti-arab-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/roti-arab-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/roti-arab-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/roti-arab-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/roti-arab-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/roti-arab-2xl.jpg 1600w\"><figcaption>roti arab</figcaption></figure>\n<p>Tapi harus seimbangkan juga dengan buah-buahan ya biar ada asupan vitamin juga, karena sakit disini itu mahal, panadol aja bisa 150ribuan harganya ğŸ˜…</p>\n<p>Jadi harus dirutinkan mengkonsumsi buah, biasanya saya membeli buah botong campur biar bisa dapet beragam jenis buah dan dapet banyak vitamin</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/aneka-buah-2.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/aneka-buah-2-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/aneka-buah-2-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/aneka-buah-2-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/aneka-buah-2-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/aneka-buah-2-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/aneka-buah-2-2xl.jpg 1600w\"><figcaption>aneka buah dan harganya</figcaption></figure>\n<p>Bonus:</p>\n<p>Perbandingan makanan yang biasa ada di supermarket Indonesia dengan supermarket di Dubai (Lulu di Mei 2023)</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/jajanan-indo.jpg\" alt=\"\" width=\"1280\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/jajanan-indo-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/jajanan-indo-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/jajanan-indo-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/jajanan-indo-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/jajanan-indo-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/jajanan-indo-2xl.jpg 1600w\"><figcaption>Jajanan Indonesia di Dubai (kecuali oronamin sih, ini made in Japan)</figcaption></figure>\n<hr>\n<h1 id=\"akomodasi\" class=\"msg msg--info align-center\"><strong>ğŸ  Tempat Tinggal</strong></h1>\n<p>Alias kosan nya, adalah kebutuhan primer yang paling signifikan dalam biaya hidup di Dubai, ibaratnya kalo biaya makan itu bisa diakalin cara murahnya gimana, tapi klo biaya sewa tempat tinggal itu udah pasti sama perbulannya, jadi perlu cermat dalam memilih jenis tempat tinggal, karena biayanya sangat bervariasi, tergantung pada tipe properti, lokasi, dan fasilitas yang ditawarkan, dan kalo bisa cari tempat tinggal yang dekat dengan tempat kerja, klo naek metro harus dalam 1 zona biar hemat poll.</p>\n<p>Yang pertama yang perlu dipahami adalah perbedaan bentuk sewa tempat tinggal (kosan) antara Jakarta dan Dubai, yaitu:</p>\n<p>Tipe Apartment (pusat kota):</p>\n<ul>\n<li>Sharing\n<ul>\n<li>bed space</li>\n<li>partition</li>\n<li>private (master) room,</li>\n</ul>\n</li>\n<li>Tipe Studio (sendirian)Â </li>\n</ul>\n<p>Biasanya klo tipe apartemen sharing ini bentuknya tuh tipe kondominium yang luas tapi dipermak sedemikian rupa buat di sewain eceran gitu, lalu biaya sewa bulannya udah termasuk berbagai fasilitas umum:</p>\n<ul>\n<li>Internet high speed (biasanya diatas 250 mpbs)</li>\n<li>Air minum, gas &amp; Listrik</li>\n<li>Kamar mandi diluar (air panas/dingin), biasanya satu apartemen ada 2 kamar mandi luar</li>\n<li>Dapur umum (bisa masak di kompor dan microwave)</li>\n<li>Mesin cuci &amp; Setrikaan (ada yang termasuk keringin jadi ga perlu jemur)</li>\n</ul>\n<p>Tipe Rumah/Kamar di atas tanah:</p>\n<ul>\n<li>Villa</li>\n</ul>\n<p>Nanti akan saya jelasin perbedaannya satu-satu, tapi perlu dipahami dulu, bentuk hunian umum di Dubai itu adalah gedung apartemen, hampir ga ada pilihan rumah di atas tanah untuk hunian di pusat kota Dubai, kecuali jika melipir jauh lagi baru biasanya ada pilihan sewa rumah arab (rumah lama penduduk lokal) gitu yang disebutnya Villa.</p>\n<p>Hal berikutnya yang perlu kamu lakukan adalah memahami struktur kota dan zona mana yang menawarkan harga sewa yang lebih terjangkau. Wilayah Deira, Al Qusais, Al Rashidiya, dan Karama biasanya harga sewanya yang lebih rendah dibandingkan dengan area pusat kota seperti Downtown Dubai atau Marina.</p>\n<p>Biasanya saya mencari di website seperti <a href=\"https://dubai.dubizzle.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Dubizzle</a>, <a href=\"https://www.propertyfinder.ae/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Property Finder</a>, dan <a href=\"https://www.bayut.com/to-rent/property/dubai/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Bayut</a>. Prosesnya biasanya kita janjian dengan Landlord (yang punya properti) untuk lihat dulu ke TKP, liat fasilitas umumnya, lingkungan, dan jarak dengan transportasi umum, kalo cocok bisa langsung deal dan DP, atau bilang mau lihat yang lain dulu, nanti di kabari lagi dalam tempo tertentu (tapi bisa jadi juga di tikung sama pencari yang lain sih, buat mereka yang penting laku) Oh iya, jangan ragu buat menawar atau bernegosiasi terkait biaya sewa dengan Landlord.</p>\n<p>Yuk kita bahas penjelasan tipe kosan di Dubai</p>\n<h3>Bed Space</h3>\n<p>Secara harfiah adalah sewa kasur! Jadi cuma buat tidur aja gitu, ala backpacker. Ini adalah opsi paling murah, sewa perbulan sekitar 300 dirham (harga wajar 450ribuan) dan harga kasur bawah itu lebih mahal, biasanya satu apartemen gede akan dibagi beberapa kamar, di dalam kamar itu ada beberapa kasur untuk disewakan.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/Screenshot-2023-05-20-at-21.45.58-2.png\" alt=\"bed space\" width=\"1024\" height=\"747\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/Screenshot-2023-05-20-at-21.45.58-2-xs.png 300w ,https://fachrul.id/media/posts/60/responsive/Screenshot-2023-05-20-at-21.45.58-2-sm.png 480w ,https://fachrul.id/media/posts/60/responsive/Screenshot-2023-05-20-at-21.45.58-2-md.png 768w ,https://fachrul.id/media/posts/60/responsive/Screenshot-2023-05-20-at-21.45.58-2-lg.png 1024w ,https://fachrul.id/media/posts/60/responsive/Screenshot-2023-05-20-at-21.45.58-2-xl.png 1360w ,https://fachrul.id/media/posts/60/responsive/Screenshot-2023-05-20-at-21.45.58-2-2xl.png 1600w\"><figcaption>taken from Dubizzle</figcaption></figure>\n<p>Dan penghuni kamarnya pun bisa beragam, bisa orang asia selatan, filipin, eropa atau afrika dalam satu ruangan, yang ga kuat denger suara ngorok mending jangan coba-coba deh ğŸ˜…</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/kosan-bed-space.jpg\" alt=\"\" width=\"1080\" height=\"569\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/kosan-bed-space-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/kosan-bed-space-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/kosan-bed-space-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/kosan-bed-space-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/kosan-bed-space-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/kosan-bed-space-2xl.jpg 1600w\"><figcaption>harga kosan bedspace di dubizzle</figcaption></figure>\n<h3>Partition Room</h3>\n<p>Klo ini kita sewa satu kamar, jadi lebih ada privasinya ya, biasanya satu kondominium apartemen itu dibagi jadi banyak kamar, sempet suatu waktu pas lagi survei lokasi saya menghitung ga kurang dari 24 pintu untuk satu apartemen itu loh! dan kamar mandi luar nya cuma 2, ga kebayang antri mandinya tiap pagi itu loh ğŸ˜±</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/kosan-barsha.png\" alt=\"kosan private partition\" width=\"1024\" height=\"995\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/kosan-barsha-xs.png 300w ,https://fachrul.id/media/posts/60/responsive/kosan-barsha-sm.png 480w ,https://fachrul.id/media/posts/60/responsive/kosan-barsha-md.png 768w ,https://fachrul.id/media/posts/60/responsive/kosan-barsha-lg.png 1024w ,https://fachrul.id/media/posts/60/responsive/kosan-barsha-xl.png 1360w ,https://fachrul.id/media/posts/60/responsive/kosan-barsha-2xl.png 1600w\"><figcaption>saya sempet ngekos di kamar ini</figcaption></figure>\n<p>Gambar di atas adalah contoh partition room yang saya sempet tinggali, lebarnya itu serentangan tangan aja, itu di foto aja keliatan ga sampe 3 ubin lebarnya, sempit banget ya ğŸ˜…</p>\n<p>Dulu di kamar itu saya bisa sewa klo perbulannya sekitar 1600 dirham (harga wajar 2,4jutaan, emang berasa mahal sih sekamar 3 ubin gini ğŸ¤£), fasilitasnya sama kayak di atas, dapet lemari baju, free internet, sharing kitchen dan kamar mandi di luar, dan selimut karena AC central nya dingin banget ga bisa dikecilin!</p>\n<p>Oia biasanya variasi harga tergantung fasilitas juga, misal ada balkon nya, ada meja kerjanya atau bahkan ada jendelanya gitu juga bisa mempengaruhi harga loh.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/kosan-room-partition.jpg\" alt=\"\" width=\"1080\" height=\"571\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/kosan-room-partition-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/kosan-room-partition-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/kosan-room-partition-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/kosan-room-partition-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/kosan-room-partition-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/kosan-room-partition-2xl.jpg 1600w\"><figcaption>harga iklan room partition di dubizzle</figcaption></figure>\n<p>Â </p>\n<h3>Private Room</h3>\n<p>Klo perlu ruangan yang lebih luas dari pada Partition room, ini dia Private Room, masi di dalam kawasan yang sama di sebuah kondominium apartemen biasanya ada satu/beberapa ruangan yang punya ruangan lebih lega lagi, banyak yang bilang tipe ruangan yang master bedroomÂ </p>\n<p>fasilitasnya juga lebih banyak, saya sempet sewa yang beberapa tempat tipe ini, biasanya ada tivi, kamar mandi dalam, sofa, lemari, meja kerja dan pernah sekali yang ada kulkasnya di kamar, harga perbulannya sekitar 2000-3500 dirham (harga wajar senilai Rp3juta-5,2jutaan)</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/private-room-2.jpg\" alt=\"\" width=\"800\" height=\"600\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/private-room-2-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/private-room-2-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/private-room-2-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/private-room-2-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/private-room-2-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/private-room-2-2xl.jpg 1600w\"><figcaption>diambil dari Dubizzle</figcaption></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/harga-kosan-private-room.jpg\" alt=\"\" width=\"1080\" height=\"555\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/harga-kosan-private-room-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/harga-kosan-private-room-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/harga-kosan-private-room-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/harga-kosan-private-room-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/harga-kosan-private-room-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/harga-kosan-private-room-2xl.jpg 1600w\"><figcaption>contoh harga kosan private room</figcaption></figure>\n<h3>Apartemen Studio (flat)</h3>\n<p>Kalo ini kita sewa satu apartemen bisa tipe studio, ataupun tipe yang punya 2-3 kamar gitu, tentu harganya akan mahal, untuk yang ke Dubai bersama keluarga tentu pilihan sewa apartemen studio lebih cocok, pun biasanya harga sewa yang ditawarkan sudah termasuk dengan barang-barang fasilitas (furnished) seperti TV, mesin cuci, kulkas, sofa dan kadang ada juga fasilitas umum apartemen seperti gym dan kolam renang.</p>\n<p>Untuk mencari apartemen bisa kita lihat spanduk merah/putih yang isinya \"TOLET 05xxx (nomer telp)\" artinya apartemen itu ada yang kosong dan silahkan hubungi nomer tersebut untuk komunikasi dengan agen landlordnya, emang aneh sih tolet mungkin dari To Let yang artinya di sewakan ğŸ˜‚</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/tolet.jpg\" alt=\"\" width=\"901\" height=\"1080\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/tolet-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/tolet-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/tolet-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/tolet-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/tolet-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/tolet-2xl.jpg 1600w\"><figcaption>iklan apartemen</figcaption></figure>\n<p>Jadi biasanya daerah Al Barsha, Al Karama yang banyak sekali apartemen Tolet ini, lingkungannya juga bagus, banyak makanan enak dilingkungan ini loh ğŸ˜</p>\n<p>Tapi prosesnya beda dengan sharing apartemen yang saya bahas sebelumnya, untuk tipe satu apartemen sendiri seperti ini prosesnya lebih rinci, seperti ada perjanjian sewa dengan landlordnya, ada uang jaminan, lalu pembayarannya juga biasanya dihitung pertahun walaupun sebenarnya bisa di cicil dengan menggunakan cek bank gitu (ditagih berkala sebanyak jumlah ceknya), ga pembayaran dengan tunai ataupun transfer bulanan, karena dengan cek bisa memiliki posisi hukum yang lebih kuat lagi.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/iklan-apartemen.jpg\" alt=\"\" width=\"1080\" height=\"550\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/iklan-apartemen-xs.jpg 300w ,https://fachrul.id/media/posts/60/responsive/iklan-apartemen-sm.jpg 480w ,https://fachrul.id/media/posts/60/responsive/iklan-apartemen-md.jpg 768w ,https://fachrul.id/media/posts/60/responsive/iklan-apartemen-lg.jpg 1024w ,https://fachrul.id/media/posts/60/responsive/iklan-apartemen-xl.jpg 1360w ,https://fachrul.id/media/posts/60/responsive/iklan-apartemen-2xl.jpg 1600w\"><figcaption>iklan flat di bulan Mei 2023</figcaption></figure>\n<p>Kisaran harganya 40.000 dirham (harga yang tercantum biasanya per tahun) itu biasanya jauh dari metro, atau bahkan ga ada akses transportasi umum, jadi harus punya kendaraan pribadi, bisa beli scooter listrik (otopad) biar bisa ambil yang jaraknya lebih jauh sedikit dari transportasi umum</p>\n<p><strong>Penting untuk diperhatikan:</strong></p>\n<p>Lokasi tempat tinggal usahakan dekat dengan transportasi umum, seperti bus ataupun metro (seperti MRT) yang bisa diakses dengan jalan kaki, atau kalau pekerjaan sensitif dengan waktu lebih baik dekat dengan metro, karena menunggu bus itu tidak tentu, kadang perlu 30 menit atau sering kali lebih malah (kadang penuh dan harus nunggu selanjutnya dan lama datengnya), metro itu di jam sibuk bisa 1 menit sekali udah dateng keretanya.</p>\n<p>Ongkos Metro untuk 1 zona itu sekitar 5 dirham</p>\n<hr>\n<h1>Penutup</h1>\n<p>Sekian kiranya sebuah catatan siasat bagaimana cara saya untuk bisa hidup murah sebagai anak kos di Dubai, mudah-mudahan ini bisa kamu jadikan referensi untuk melihat biaya hidup di Dubai seperti apa dan gak salah negosiasi gaji ya</p>\n<hr>\n<p>Terkadang, perjalanan hidup membawa kita ke tempat-tempat yang gak pernah kita bayangin sebelumnya, di post kali ini, kita akan berbicara tentang hidup di salah satu metropolis yang menjadi tujuan populer para ekspatriat: Dubai</p>\n<p>Salah satu cita-cita kecil saya adalah merantau ke negeri orang, alhamdulilah, sejak November 2022 kemarin saya berkesempatan menjadi talenta digital Indonesia yang di export ke Dubai! Saya akan berbagi siasat untuk bisa hidup murah ala anak kosan ditengah gemerlap kemegahan kota Dubai.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/60/IMG_0109-2.JPG\" alt=\"\" width=\"1080\" height=\"1088\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/60/responsive/IMG_0109-2-xs.JPG 300w ,https://fachrul.id/media/posts/60/responsive/IMG_0109-2-sm.JPG 480w ,https://fachrul.id/media/posts/60/responsive/IMG_0109-2-md.JPG 768w ,https://fachrul.id/media/posts/60/responsive/IMG_0109-2-lg.JPG 1024w ,https://fachrul.id/media/posts/60/responsive/IMG_0109-2-xl.JPG 1360w ,https://fachrul.id/media/posts/60/responsive/IMG_0109-2-2xl.JPG 1600w\"><figcaption>Mampir ke Burj Khalifa</figcaption></figure>\n<p>Â </p>\n<p>Â </p>",
            "image": "https://fachrul.id/media/posts/60/siasat-hidup-hemat-dubai.png",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
                   "ulasan",
                   "opinion",
                   "Dubai"
            ],
            "date_published": "2023-05-20T21:37:18+04:00",
            "date_modified": "2024-02-09T19:59:33+04:00"
        },
        {
            "id": "https://fachrul.id/time-management-sebagai-software-tester/",
            "url": "https://fachrul.id/time-management-sebagai-software-tester/",
            "title": "Time Management sebagai Software Tester",
            "summary": "Sebagai software tester, apakah kamu sering merasakan hal seperti ini? Keteteran kerjaan Sering dapet tugas dadakan Ga tau bisa kelar hari ini apa nggak Sama, gw juga! ahaha, tapi jangan sedih dulu, gw akan share siasat gw dalam mengelola waktu biar lebih efisien dengan cara&hellip;",
            "content_html": "<p data-pm-slice=\"0 0 []\">Sebagai software tester, apakah kamu sering merasakan hal seperti ini?</p>\n<ul>\n<li>\n<p>Keteteran kerjaan</p>\n</li>\n<li>\n<p>Sering dapet tugas dadakan</p>\n</li>\n<li>\n<p>Ga tau bisa kelar hari ini apa nggak</p>\n</li>\n</ul>\n<p>Sama, gw juga! ahaha, tapi jangan sedih dulu, gw akan share siasat gw dalam mengelola waktu biar lebih efisien dengan cara <strong>mengurangi</strong> waktu!!</p>\n<hr>\n<h2><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/59//coin.png\" alt=\"\" width=\"1008\" height=\"192\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/59//responsive/coin-xs.png 300w ,https://fachrul.id/media/posts/59//responsive/coin-sm.png 480w ,https://fachrul.id/media/posts/59//responsive/coin-md.png 768w ,https://fachrul.id/media/posts/59//responsive/coin-lg.png 1024w ,https://fachrul.id/media/posts/59//responsive/coin-xl.png 1360w ,https://fachrul.id/media/posts/59//responsive/coin-2xl.png 1600w\"></figure></h2>\n<h2>Mengelola waktu</h2>\n<p>Sepertinya, time management (manajemen waktu) sudah menjadi sebuah skill wajib bagi software testing, karena pekerja software itu dituntut result oriented, banyak variabel yang bisa bikin waktu tempuh pengujian jadi semakin lama. Misal, klo nemu bugs tapi intermitten atau bahkan klo testnya lancar ga nemu bugs baru (malah was-was ga sih).</p>\n<p>Karena waktu adalah <strong>sumber daya yang tidak bisa ditambah atau kurangin</strong>, bahkan ga bisa di transfer juga, jadinya keahlian mengelola waktu sangat kritikal bagi software tester, biar ga burnout saat bekerja, dan kualitas pengujian juga tetap semangat dan produktif.</p>\n<h2>Waktunya Ngaret</h2>\n<p>Sering kali perusahaan itu menempatkan software tester sebagai â€œQuality gate keeperâ€, alias si penentu rilis apa nggaknya sebuah fitur/version, akhirnya software tester (QA) menjadi bottleneck, berasa semua pada nungguin kerjaan QA kelar ga sih ğŸ˜…</p>\n<p>Dengan kek gitu, sering kali QA jadi kambing hitam saat tim harus ambil delay rilis/waktu yang ga sesuai jadwal. Karena ujung-ujungnya klo delay itu nambah cost produksi software loh, kebayang ga sih klo ada hard deadline launching produk, tapi H-1 fiturnya masih kayak zombie! klo sampe mesti delay,, beeuuuh berasa duduk di kursi panas!</p>\n<h2>Waktu Efisien</h2>\n<p>Ga selalu loh istilah â€œLebih cepat, Lebih baikâ€ berlaku di software testing, karena bisa jadi ternyata cepat dan banyak yang kelewat! ahaha, ujung-ujungnya puter balik ğŸ˜‚</p>\n<p>Jadi harus cepat DAN baik, hasilnya adalah efisien, sungguh idaman setiap software tester ya untuk bisa terus efisien, nah karena kita ga bisa menambah waktu lebih dari 24 jam sehari, atau menambah waktu rilis dengan mudah, makanya gw mo share cara gw mengurangi waktu!</p>\n<h2><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/59//ilustrasi-jeda-nulis.png\" alt=\"\" width=\"1008\" height=\"192\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/59//responsive/ilustrasi-jeda-nulis-xs.png 300w ,https://fachrul.id/media/posts/59//responsive/ilustrasi-jeda-nulis-sm.png 480w ,https://fachrul.id/media/posts/59//responsive/ilustrasi-jeda-nulis-md.png 768w ,https://fachrul.id/media/posts/59//responsive/ilustrasi-jeda-nulis-lg.png 1024w ,https://fachrul.id/media/posts/59//responsive/ilustrasi-jeda-nulis-xl.png 1360w ,https://fachrul.id/media/posts/59//responsive/ilustrasi-jeda-nulis-2xl.png 1600w\"></figure></h2>\n<h2>Mengurangi Waktu Regression Test</h2>\n<p>Regression test adalah salah satu sumber pengeluaran waktu terbesar bagi seorang software tester, jalanin regression test suite itu bisa berhari-hari (beda-beda sih tiap tim/kantor), gw pun kadang mo muntah ngeliatin testrail runner ga kelar-kelar keknya!</p>\n<p>Nah gimana cara ngurangin waktu regression test yang biasa gw lakuin:</p>\n<h4>1. Rawatlah test suite si regression test</h4>\n<p>Lo tentu akan masukin fitur baru ke koleksi test suite, tapi apakah lo akan kurangin juga test fitur lama dari koleksi? Udah 10 rilis loh itu ga ada perubahan, aman-aman aja kan? masi tetep perlu di cek berkala? Tentu tergantung ya, klo bukan core features sih lebih baik dikurangin, atau bahkan outsource aja ke test automation</p>\n<h4>2. Test planning yang bener</h4>\n<p>Katakanlah di sprint planning udah ketahuan fitur baru apa aja yang akan di rilis, nah kita bisa rencanain tuh nanti ada dampaknya ga di regression test, klo bisa colong start, coba jalanin regression test dulu di fase feature test biar keliatan ada imbas ke regression test suite ga nya.</p>\n<p>Atau bahkan dengan fitur baru, kita perlu persiapan lebih lama buat production testing nantinya, misal kita perlu setup akun dengan kondisi tertentu biar bisa gampang di testnya.</p>\n<p>Dan terkait nomer 1 tadi, di planning juga prioritas test cases nya, mana yang masuk test run nanti, mana yang penting di cek duluan sebelum yang lain</p>\n<h4>3. Nyuruh Robot</h4>\n<p>Alias test automation, dengan adanya test automation, pengujian software tentu akan lebih mudah, mereka akan nurut terus disuruh ngetest kapanpun bisa, ga ada capeknya, ga bosen-bosen ngetest hal yang sama 100x sehari. Tentu, robot/automation ini ga akan menggantikan kualitas pengujian yang dijalankan oleh manusia, tapi bayangin deh kita kan klo ngetest ga bisa paralel sekaligus semuanya dikerjain barengan, nah contoh, saat kita lagi test module sign up dengan fitur baru, si test automation ini akan ngetest module login/reset password, nanti pas kita kelar test sign up tinggal liat hasilnya dulu dari yang dikerjain test automation, sebelum kita terjun lebih jauh di pengujian manual, karena kesel juga kan pas ditengah test gataunya ada error dan perbaikannya bisa bikin test kita yang udah kelar harus di-retest lagi.</p>\n<p>Â </p>\n<figure class=\"post__image post__image--center\" ><a href=\"https://www.tokopedia.com/ngetest-jualan\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" src=\"https://fachrul.id/media/posts/59/baju-keren-software-tester.jpeg\" alt=\"baju keren software tester nih gaes\" width=\"304\" height=\"304\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/59/responsive/baju-keren-software-tester-xs.jpeg 300w ,https://fachrul.id/media/posts/59/responsive/baju-keren-software-tester-sm.jpeg 480w ,https://fachrul.id/media/posts/59/responsive/baju-keren-software-tester-md.jpeg 768w ,https://fachrul.id/media/posts/59/responsive/baju-keren-software-tester-lg.jpeg 1024w ,https://fachrul.id/media/posts/59/responsive/baju-keren-software-tester-xl.jpeg 1360w ,https://fachrul.id/media/posts/59/responsive/baju-keren-software-tester-2xl.jpeg 1600w\"></a>\n<figcaption >klik gambar ini buar beli di Tokopedia</figcaption>\n</figure>\n<p class=\"align-center\"><a href=\"https://www.tokopedia.com/ngetest-jualan\" target=\"_blank\" rel=\"noopener noreferrer\">Coba cek ini, deh kaos keren di toko gw \"NgeTest Jualan\" Tokopedia</a></p>\n<h4>4. Menggunakan jurus pengujian yang tepat</h4>\n<p>Pernah denger jurus â€œKunyuk Melempar buahâ€? ahaha generasi 90an doang keknya yang inget!</p>\n<p>Oke maksudnya adalah menggunakan teknik pengujian yang tepat bisa meningkatkan kualitas pengujian lebih efektif dan confidence, contohnya gini, pada suatu fitur baru untuk tambah validasi pada suatu form input, kita punya 30 macem validasi, nah kita harus tau ini validasi dari Backend apa frontend, klo tau ini validasi datengnya dari BE, jadi si 30 macem validasi kita test di level API aja, 1x di FE, buat liat tampilan errornya aja, karena konten error message nya dateng dari BE toh, jadi ga perlu deh tuh kita habisin waktu lama-lama buat ngetest semua 30 validasi tadi (atau bahkan influence dev buat cover 30 test tadi di level unit testing)</p>\n<h2><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/59/ilustrasi-jeda-nulis-2.png\" alt=\"\" width=\"1008\" height=\"192\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-2-xs.png 300w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-2-sm.png 480w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-2-md.png 768w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-2-lg.png 1024w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-2-xl.png 1360w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-2-2xl.png 1600w\"></figure></h2>\n<h2>Mengurangi Waktu Debug</h2>\n<p>Gw sangat senang sama debugging, ibarat detektif yang lagi ngumpulin bukti kriminal, dan cari tau siapa dalangnya, dalam hati â€œini tuh beneran error loh gaes, nih liat aja lognya, screenshot nya, video reproducenyaâ€</p>\n<p>Tapi semua itu perlu waktu yang ga singkat, reproduce issue deh minimal lebih dari satu kali, kadang buat mastiin ini kejadiannya cuma di kondisi A aja apa juga di kondisi B, belom lagi klo kita mau mastiin ini kejadain nya sejak di versi baru aja atau kejadian juga di production! gimana ga lama tuh waktu debuging nya ahahaa</p>\n<p>Yang bisa kita kurangin di waktu debug adalah:</p>\n<h4>1. Error Logging sistem yang terintegrasi</h4>\n<p>Pastikan aplikasi kamu udah terkoneksi dengan logging system yang baik, minta developer manager buat pasang di aplikasi development (integration/alpha/beta) juga, ga cuma di production aja gitu, karena kan fitur baru pasti di testnya ga langsung di production donk!</p>\n<p>Jadi mana kala muncul bugs/crash/faliures, langkah pertama kita adalah ngecek log ini, yang barusan kejadian tuh stacktrace nya kek mana, seringkali informasi ini udah cukup jelas buat dev</p>\n<h4>2. Laporan bugs yang jelas</h4>\n<p>Red flag deh klo devnya selalu nanya QA di standup/DM buat jelasin temuan bugsnya, karena itu berarti laporan bugsnya ga jelas dimengerti oleh dev (atau Devnya masih baru, atau emang pengen ngobrol sama lo aja/PDKT ğŸ¤£ )</p>\n<p>Coba refleksi, apa yang ditanyakan dev itu, apakah step reproduce nya ga jelas? tambahin foto, klo kurang jelas juga tambahin video! apakah mungkin bugs report lo itu description nya ga jelas, ekspektasi yang ga make sense.</p>\n<p>Intinya, ini adalah feedback dari dev agar komunikasi lo jadi lebih baik, kalaupun ga ada komentar dari Dev, coba tanyain kira-kira ada yang bisa di improve ga dari bugs report nya yang biasa dia terima? kadang ada dev yang mau juga di tambahin info device/browser detail.</p>\n<p>Jadi devnya bisa sat-set langsun ngerjain bugsnya.</p>\n<h2><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://fachrul.id/media/posts/59/ilustrasi-jeda-nulis-1.png\" alt=\"\" width=\"1008\" height=\"192\" sizes=\"100vw\" srcset=\"https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-1-xs.png 300w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-1-sm.png 480w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-1-md.png 768w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-1-lg.png 1024w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-1-xl.png 1360w ,https://fachrul.id/media/posts/59/responsive/ilustrasi-jeda-nulis-1-2xl.png 1600w\"></figure></h2>\n<h2>Mengurangi Waktu Nunggu</h2>\n<p>Menunggu itu pemborosan waktu, apalagi klo sambil bengong gada kuota internet, beuh mati gaya dah tuh nunggu! ehehe tapi ini bukan soal nunggu bus transjakarta gaes, kita harus identifikasi titik mana aja yang biasanya kita habiskan buat menunggu</p>\n<h4>Menunggu feature yang Ready for Testing</h4>\n<p>Di awal sprint biasanya belum ada fitur baru yang ready for testing langsung kan, coba liat apa yang bisa QA kerjain di waktu kosong ini, misalkan cek crashlytic di production, di release sebelumnya banyak error ganya, bikin test automation, entah buat automate fitur lama atau fitur yang berjalan (API sih ada kontrak response yang bisa dipake buat automate), atau ngerjain apa kek biar nanti test nya langsung sat-set-sat-set, macam prepare test data gitu</p>\n<h4>Menunggu bugs yang Ready for Testing</h4>\n<p>Nah ini sering jadi bumerang, kita udah rise issue tapi ternyata ga kunjung dikerjain developer! Mana itu bugs severity critical, bisa masalah klo dilolosin sebelum rilis! nah makanya tetep pantau terus itu bugs report kita, tiap hari di standup kita harus sundul developernya:</p>\n<ul>\n<li>\n<p>bugs yang gw report udah di baca belom?</p>\n</li>\n<li>\n<p>ada yang perlu gw jelasin ga soal bugs itu?</p>\n</li>\n<li>\n<p>ke reproduce ga di tempat lo?</p>\n</li>\n<li>\n<p>apa perlu gw yang kerjain itu bugs? (ini klo bisa ya ahaha)</p>\n</li>\n<li>\n<p>gw bilangin bapak lo ya! (eskalasi)</p>\n</li>\n</ul>\n<p>Â </p>",
            "image": "https://fachrul.id/media/posts/59/thumbnail-post-fachrul.id-2.jpg",
            "author": {
                "name": "Fachrul Choliluddin"
            },
            "tags": [
                   "merdeQA",
                   "belajar-qa"
            ],
            "date_published": "2023-03-26T14:56:35+04:00",
            "date_modified": "2023-03-26T16:22:30+04:00"
        }
    ]
}
